{"qid": "0e6185c3ebc5451db91e8dae2dceac7e_q2", "doc_id": "0e6185c3ebc5451db91e8dae2dceac7e", "question": "Describe what Sam Burnett does for his job.", "chunks": [{"chunk_id": "0e6185c3ebc5451db91e8dae2dceac7e__chunk_014", "distance": "0.51101726", "text": "all by themselves at his sides. His mouth twisted, \"You're one hell of a patriot, Sam Burnett!\" Burnett reached out with one long finger, tapped it quietly on Rice's barrel-chest. \"Haul a cargo of corpses for three thousand nights and days and see how patriotic you feel. All those fine muscled lads bloated and crushed by space pressures and heat-blasts. Fine lads who start out smiling and get the smile burned off down to the bone—\" Burnett swallowed and didn't say anything more, but he closed his eyes. He stood there, smelling the death-odor in the hot air of the ship, hearing the"}, {"chunk_id": "0e6185c3ebc5451db91e8dae2dceac7e__chunk_037", "distance": "0.51417112", "text": "ce over him. Burnett groaned. Rice said, \"Sam, you shouldn't have done it. You shouldn't have, Sam.\" \"To hell with it.\" Burnett winced, and fought to keep his eyes open. Something wet and sticky covered his chest. \"I said this was my last trip and I meant it. One way or the other, I'd have quit!\" \"This is the hard way—\" \"Maybe. I dunno. Kind of nice to think of all those kids who'll never have to come aboard the Constellation , though, Rice.\" His voice trailed off. \"You watch the shelves fill up and you never know who'll be next. Who'd have thought, four days ago—\" Something happened to his"}, {"chunk_id": "0e6185c3ebc5451db91e8dae2dceac7e__chunk_036", "distance": "0.54984272", "text": "ike a red-hot ramrod stabbed Sam Burnett, catching him in the ribs, spinning him back like a drunken idiot to fall in a corner. Fists made blunt flesh noises. Lethla went down, weaponless and screaming. Rice kicked. After awhile Lethla quit screaming, and the room swam around in Burnett's eyes, and he closed them tight and started laughing. He didn't finish laughing for maybe ten minutes. He heard the retriever claws come inside, and the star-port grind shut. Out of the red darkness, Rice's voice came and then he could see Rice's young face over him. Burnett groaned. Rice said, \"Sam, you"}, {"chunk_id": "0e6185c3ebc5451db91e8dae2dceac7e__chunk_009", "distance": "0.56273878", "text": "chanical hands. But even a machine breaks down.... \"Sam!\" Rice turned swiftly as Burnett dragged himself up the ladder. Red and warm, Rice's face hovered over the body of a sprawled enemy official. \"Take a look at this!\" Burnett caught his breath. His eyes narrowed. There was something wrong with the body; his experienced glance knew that. He didn't know what it was. Maybe it was because the body looked a little too dead. Burnett didn't say anything, but he climbed the rest of the way, stood quietly in the grey-metal air-lock. The enemy official was as delicately made as a fine white spider."}]}
{"qid": "0e6185c3ebc5451db91e8dae2dceac7e_q3", "doc_id": "0e6185c3ebc5451db91e8dae2dceac7e", "question": "How does Sam Burnett feel about his job?", "chunks": [{"chunk_id": "0e6185c3ebc5451db91e8dae2dceac7e__chunk_037", "distance": "0.49935508", "text": "ce over him. Burnett groaned. Rice said, \"Sam, you shouldn't have done it. You shouldn't have, Sam.\" \"To hell with it.\" Burnett winced, and fought to keep his eyes open. Something wet and sticky covered his chest. \"I said this was my last trip and I meant it. One way or the other, I'd have quit!\" \"This is the hard way—\" \"Maybe. I dunno. Kind of nice to think of all those kids who'll never have to come aboard the Constellation , though, Rice.\" His voice trailed off. \"You watch the shelves fill up and you never know who'll be next. Who'd have thought, four days ago—\" Something happened to his"}, {"chunk_id": "0e6185c3ebc5451db91e8dae2dceac7e__chunk_014", "distance": "0.50781024", "text": "all by themselves at his sides. His mouth twisted, \"You're one hell of a patriot, Sam Burnett!\" Burnett reached out with one long finger, tapped it quietly on Rice's barrel-chest. \"Haul a cargo of corpses for three thousand nights and days and see how patriotic you feel. All those fine muscled lads bloated and crushed by space pressures and heat-blasts. Fine lads who start out smiling and get the smile burned off down to the bone—\" Burnett swallowed and didn't say anything more, but he closed his eyes. He stood there, smelling the death-odor in the hot air of the ship, hearing the"}, {"chunk_id": "0e6185c3ebc5451db91e8dae2dceac7e__chunk_036", "distance": "0.55556130", "text": "ike a red-hot ramrod stabbed Sam Burnett, catching him in the ribs, spinning him back like a drunken idiot to fall in a corner. Fists made blunt flesh noises. Lethla went down, weaponless and screaming. Rice kicked. After awhile Lethla quit screaming, and the room swam around in Burnett's eyes, and he closed them tight and started laughing. He didn't finish laughing for maybe ten minutes. He heard the retriever claws come inside, and the star-port grind shut. Out of the red darkness, Rice's voice came and then he could see Rice's young face over him. Burnett groaned. Rice said, \"Sam, you"}, {"chunk_id": "0e6185c3ebc5451db91e8dae2dceac7e__chunk_028", "distance": "0.59439260", "text": "e him believe he could actually do it? Two muscles moved on Burnett, one in each long cheek. The sag in his body vanished as he tautened his spine, flexed his lean-sinewed arms, wet thin lips. \"Now, where do you want this crate?\" he asked Lethla easily. Lethla exhaled softly. \"Cooperation. I like it. You're wise, Earthman.\" \"Very,\" said Burnett. He was thinking about three thousand eternal nights of young bodies being ripped, slaughtered, flung to the vacuum tides. Ten years of hating a job and hoping that some day there would be a last trip and it would all be over. Burnett laughed through"}]}
{"qid": "0e6185c3ebc5451db91e8dae2dceac7e_q4", "doc_id": "0e6185c3ebc5451db91e8dae2dceac7e", "question": "What is the setting of the story?", "chunks": [{"chunk_id": "0e6185c3ebc5451db91e8dae2dceac7e__chunk_004", "distance": "0.74198866", "text": "le up behind gutted wrecks of ships, salvaging any bodies still intact after the conflict. Two men. Rice and himself. Sharing a cozy morgue ship with a hundred other men who had forgotten, quite suddenly, however, to talk again. Ten years of it. Every hour of those ten years eating like maggots inside, working out to the surface of Burnett's face, working under the husk of his starved eyes and starved limbs. Starved for life. Starved for action. This would be his last trip, or he'd know the reason why! \"Sam!\" Burnett jerked. Rice's voice clipped through the drainage-preservative lab, bounded"}, {"chunk_id": "0e6185c3ebc5451db91e8dae2dceac7e__chunk_001", "distance": "0.74724734", "text": "g to think clearly. Pallid and quiet, three bodies lay on the cold transparent tables around him; machines stirred, revolved, hummed. He didn't see them. He didn't see anything but a red haze over his mind. It blotted out the far wall of the laboratory where the shelves went up and down, numbered in scarlet, keeping the bodies of soldiers from all further harm. Burnett didn't move. He stood there in his rumpled white surgical gown, staring at his fingers gloved in bone-white rubber; feeling all tight and wild inside himself. It went on for days. Moving the ship. Opening the star-port."}, {"chunk_id": "0e6185c3ebc5451db91e8dae2dceac7e__chunk_039", "distance": "0.75680918", "text": "asy on the good green earth. Not right to be going back any way—but—the way—we used to—\" His voice got all full of fog. As thick as the fists of a dozen warriors. Rice was going away from him. Rice was standing still, and Burnett was lying down, not moving, but somehow Rice was going away a million miles. \"Ain't I one hell of a patriot, Rice?\" Then everything got dark except Rice's face. And that was starting to dissolve. Ninety-eight: Lethla. Ninety-nine: Kriere. He could still see Rice standing over him for a long time, breathing out and in. Down under the tables the blood-pumps pulsed and"}, {"chunk_id": "0e6185c3ebc5451db91e8dae2dceac7e__chunk_023", "distance": "0.75962603", "text": "y; we took the chance. We set a small time-bomb to destroy the life-rocket, and cast off, wearing our chrysali-helmets. It was the first time we had ever tried using them to trick anyone. We knew you wouldn't know we were alive until it was too late and we controlled your ship. We knew you picked up all bodies for brief exams, returning alien corpses to space later.\" Rice's voice was sullen. \"A set-up for you, huh? Traveling under the protection of the Purple Cross you can get your damned All-Mighty safe to Venus.\" Lethla bowed slightly. \"Who would suspect a Morgue Rocket of providing safe"}]}
{"qid": "0e6185c3ebc5451db91e8dae2dceac7e_q5", "doc_id": "0e6185c3ebc5451db91e8dae2dceac7e", "question": "What is the significance of the phrase “You can never catch up with war” in the story?", "chunks": [{"chunk_id": "0e6185c3ebc5451db91e8dae2dceac7e__chunk_006", "distance": "0.45100045", "text": "oward the rungs that gleamed up into the air-lock, control-room sector of the rocket. He climbed without making any noise on the rungs. He kept thinking the one thing he couldn't forget. You never catch up with the war. All the color is ahead of you. The drive of orange rocket traces across stars, the whamming of steel-nosed bombs into elusive targets, the titanic explosions and breathless pursuits, the flags and the excited glory are always a million miles ahead. He bit his teeth together. You never catch up with the war. You come along when space has settled back, when the vacuum has"}, {"chunk_id": "0e6185c3ebc5451db91e8dae2dceac7e__chunk_008", "distance": "0.63387799", "text": "ace suits, mouths open for air that had never been there in a hundred billion centuries. And they kept dancing without music until you extended the retriever-claw and culled them into the air-lock. That was all the war-glory he got. Nothing but the stunned, shivering silence, the memory of rockets long gone, and the shelves filling up all too quickly with men who had once loved laughing. You wondered who all the men were; and who the next ones would be. After ten years you made yourself blind to them. You went around doing your job with mechanical hands. But even a machine breaks down...."}, {"chunk_id": "0e6185c3ebc5451db91e8dae2dceac7e__chunk_017", "distance": "0.64750206", "text": "ion go deep and tight, biting lines into his sharp face. Rice got it out, finally. \"How'd you do it?\" he demanded, bitterly. \"How'd you live in the void? It's impossible!\" A crazy thought came ramming down and exploded in Burnett's head. You never catch up with the war! But what if the war catches up with you? What in hell would Lethla be wanting aboard a morgue ship? Lethla half-crouched in the midst of the smell of death and the chugging of blood-pumps below. In the silence he reached up with quick fingers, tapped a tiny crystal stud upon the back of his head, and the halves of a"}, {"chunk_id": "0e6185c3ebc5451db91e8dae2dceac7e__chunk_027", "distance": "0.64985526", "text": ". Help Kriere escape? See him safely to Venus, and then be freed? Sounded easy, wouldn't be hard. Venusians weren't blind with malice. Rice and he could come out alive; if they cooperated. But there were a lot of warriors sleeping on a lot of numbered shelves in the dim corridors of the long years. And their dead lips were stirring to life in Burnett's ears. Not so easily could they be ignored. You may never catch up with the war again. The last trip! Yes, this could be it. Capture Kriere and end the war. But what ridiculous fantasy was it made him believe he could actually do it? Two muscles"}]}
{"qid": "96c9e45de562458a90d15a9e1a7bbb2e_q2", "doc_id": "96c9e45de562458a90d15a9e1a7bbb2e", "question": "Why Does Kayle Not Allow Granthan to Re-enter Earth?", "chunks": [{"chunk_id": "96c9e45de562458a90d15a9e1a7bbb2e__chunk_009", "distance": "0.45521688", "text": "ost the risk I'd be running if you were allowed to pass the patrol line. \"I'm sorry, Granthan. I can't let you land on Earth. I can't accept the risk.\" \"What do I do now?\" I stormed. \"Go into orbit and eat pills and hope you think of something? I need a doctor!\" Presently Kayle replied. \"Yes,\" he said. \"You'll have to enter a parking orbit. Perhaps there will be developments soon which will make it possible to ... ah ... restudy the situation.\" He didn't meet my eye. I knew what he was thinking. He'd spare me the mental anguish of knowing what was coming. I couldn't really blame him; he was"}, {"chunk_id": "96c9e45de562458a90d15a9e1a7bbb2e__chunk_033", "distance": "0.49835563", "text": "ve an urgent report for Colonel Kayle of Aerospace Intelligence.\" Kayle's face appeared. \"Don't fight it, Granthan,\" he croaked. \"You penetrated the planetary defenses—God knows how. I—\" \"Later,\" I snapped. \"How about calling off your dogs now? And send somebody out here to pick me up, before I add sea-sickness to my other complaints.\" \"We have you pinpointed,\" Kayle cut in. \"It's no use fighting it, Granthan.\" I felt cold sweat pop out on my forehead. \"You've got to listen, Kayle,\" I shouted. \"I suppose you've got missiles on the way already. Call them back! I have information that can win"}, {"chunk_id": "96c9e45de562458a90d15a9e1a7bbb2e__chunk_035", "distance": "0.53236145", "text": "y out the schemes of the inhuman enemy, this in no way detracts from your gallant attempt. Mr. Granthan, I salute you.\" The general's arm went up in a rigid gesture. \"Stow that, you pompous idiot!\" I barked. \"I'm no spy!\" Kayle was back, blanking out the startled face of the general. \"Goodbye, Granthan. Try to understand....\" I flipped the switch, sat gripping the couch, my stomach rising with each heave of the floating escape capsule. I had perhaps five minutes. The missiles would be from Canaveral. I closed my eyes, forced myself to relax, reached out.... I sensed the distant shore, the hot"}, {"chunk_id": "96c9e45de562458a90d15a9e1a7bbb2e__chunk_006", "distance": "0.56295073", "text": "om the Ganymede relay station, another ten minutes before Kayle's face swam into view. Even through the blur of the screen I could see the haggard look. \"Granthan!\" he burst out. \"Where are the others? What happened out there?\" I turned him down to a mutter. \"Hold on,\" I said. \"I'll tell you. Recorders going?\" I didn't wait for an answer—not with a fifteen-minute transmission lag. I plowed on: \" Belshazzar was sabotaged. So was Gilgamesh —I think. I got out. I lost a little skin, but the aid cabinet has the case in hand. Tell the Med people the drinks are on me.\" I finished talking and"}]}
{"qid": "96c9e45de562458a90d15a9e1a7bbb2e_q3", "doc_id": "96c9e45de562458a90d15a9e1a7bbb2e", "question": "How does Granthan learn, and use the Gool's mind control technique to his advantage?", "chunks": [{"chunk_id": "96c9e45de562458a90d15a9e1a7bbb2e__chunk_008", "distance": "0.43715179", "text": "sychodynamics people have been telling me the Gool may have some kind of long-range telehypnotic ability that might make it possible for them to subvert a loyal man without his knowledge. You've told me yourself that you blacked out during the attack—and came to on the lifeboat, with no recollection of how you got there. \"This is war, Granthan. War against a vicious enemy who strike without warning and without mercy. You were sent out to investigate the possibility of—what's that term you use?—hyper-cortical invasion. You know better than most the risk I'd be running if you were allowed to"}, {"chunk_id": "96c9e45de562458a90d15a9e1a7bbb2e__chunk_011", "distance": "0.47715390", "text": "the chance that I was acting under Gool orders. I wasn't, of course. I was still the same Peter Granthan, psychodynamicist, who had started out with Dayan's fleet six weeks earlier. The thoughts I was having weren't brilliant, but they were mine, all mine.... But how could I be sure of that? Maybe there was something in Kayle's suspicion. If the Gool were as skillful as we thought, they would have left no overt indications of their tampering—not at a conscious level. But this was where psychodynamics training came in. I had been reacting like any scared casualty, aching to get home and lick"}, {"chunk_id": "96c9e45de562458a90d15a9e1a7bbb2e__chunk_019", "distance": "0.51571631", "text": "e was a soundless shriek. \" Effulgence! It reached out—touched me! \" Using the technique I had grasped from the Gool itself, I struck, stifling the outcry, invaded the fetid blackness and grappled the obscene gelatinous immensity of the Gool spy as it spasmed in a frenzy of xenophobia—a ton of liver writhing at the bottom of a dark well. I clamped down control. The Gool mind folded in on itself, gibbering. Not pausing to rest, I followed up, probed along my channel of contact, tracing patterns, scanning the flaccid Gool mind.... I saw a world of yellow seas lapping at endless shores of mud."}, {"chunk_id": "96c9e45de562458a90d15a9e1a7bbb2e__chunk_026", "distance": "0.52901852", "text": "ego free. I talked about subliminal hypnotics and the resilience quotient of the ego-complex. I might have saved my breath. \"I don't understand that psychodynamics jargon, Granthan,\" he snapped. \"It smacks of mysticism. But I understand what the Gool have done to you well enough. I'm sorry.\" I leaned back and chewed the inside of my lip and thought unkind thoughts about Colonel Ausar Kayle. Then I settled down to solve the problem at hand. I keyed the chart file, flashed pages from the standard index on the reference screen, checking radar coverages, beacon ranges, monitor stations,"}]}
{"qid": "96c9e45de562458a90d15a9e1a7bbb2e_q4", "doc_id": "96c9e45de562458a90d15a9e1a7bbb2e", "question": "What is the setting of the story?", "chunks": [{"chunk_id": "96c9e45de562458a90d15a9e1a7bbb2e__chunk_044", "distance": "0.68778950", "text": "ildings in the distance, the corner of a platform. I closed my eyes and let my awareness stretch out. \"— lousy job. What's the use? Little witch in the lunch room ... up in the hills, squirrel hunting, bottle of whiskey.... \" I settled into control gently, trying not to alarm the man. I saw through his eyes the dusty box car, the rust on the tracks, the listless weeds growing among cinders, and the weathered boards of the platform. I turned him, and saw the dingy glass of the telegraph window, a sagging screen door with a chipped enameled cola sign. I walked the man to the door, and through"}, {"chunk_id": "96c9e45de562458a90d15a9e1a7bbb2e__chunk_043", "distance": "0.69550931", "text": "possible. I didn't disturb the bandages. I needed new clothes—or at least different ones—and something to cover my shaved skull. I couldn't stay hidden forever. The yard cop had recognized me at a glance. I lay back, waiting for the train to slow for a town. I wasn't unduly worried—at the moment. The watchman probably hadn't convinced anyone he'd actually seen me. Maybe he hadn't been too sure himself. The click-clack slowed and the train shuddered to a stop. I crept to the door, peered through the crack. There were sunny fields, a few low buildings in the distance, the corner of a platform."}, {"chunk_id": "96c9e45de562458a90d15a9e1a7bbb2e__chunk_051", "distance": "0.73128384", "text": "n hour later he dropped me on a street corner in a shabby marketing district of the city and drove off. I hoped he made out all right with the dark-haired girl. I spotted a used-clothing store and headed for it. Twenty minutes later I was back on the sidewalk, dressed in a pinkish-gray suit that had been cut a long time ago by a Latin tailor—maybe to settle a grudge. The shirt that went with it was an unsuccessful violet. The black string tie lent a dubious air of distinction. I'd swapped the railroader's cap for a tarnished beret. The man who had supplied the outfit was still asleep. I"}, {"chunk_id": "96c9e45de562458a90d15a9e1a7bbb2e__chunk_054", "distance": "0.73448378", "text": "r said. I looked out at the fence, a barren field, a distant group of low buildings. \"What's this?\" \"This is the place you ast for. That'll be a buck ten, mister.\" I touched his mind, planted a couple of false impressions and withdrew. He blinked, then started up, drove around the field, pulled up at an open gate with a blue-uniformed guard. He looked back at me. \"You want I should drive in, sir?\" \"I'll get out here.\" He jumped out, opened my door, helped me out with a hand under my good elbow. \"I'll get your change, sir,\" he said, reaching for his hip. \"Keep it.\" \"Thank YOU.\" He hesitated."}]}
{"qid": "96c9e45de562458a90d15a9e1a7bbb2e_q5", "doc_id": "96c9e45de562458a90d15a9e1a7bbb2e", "question": "Who are the Gool, and what do they want?", "chunks": [{"chunk_id": "96c9e45de562458a90d15a9e1a7bbb2e__chunk_021", "distance": "0.41375637", "text": "e, my host's memory told me, were the young of the Gool. Here they built the fleets that would transport the spawn to the new worlds the Prime Overlord had discovered, worlds where food was free for the taking. Not sulphur alone, but potassium, calcium, iron and all the metals—riches beyond belief in endless profusion. No longer would the Gool tribe cluster—those who remained of a once-great race—at a single feeding trough. They would spread out across a galaxy—and beyond. But not if I could help it. The Gool had evolved a plan—but they'd had a stroke of bad luck. In the past, they had"}, {"chunk_id": "96c9e45de562458a90d15a9e1a7bbb2e__chunk_019", "distance": "0.48203790", "text": "e was a soundless shriek. \" Effulgence! It reached out—touched me! \" Using the technique I had grasped from the Gool itself, I struck, stifling the outcry, invaded the fetid blackness and grappled the obscene gelatinous immensity of the Gool spy as it spasmed in a frenzy of xenophobia—a ton of liver writhing at the bottom of a dark well. I clamped down control. The Gool mind folded in on itself, gibbering. Not pausing to rest, I followed up, probed along my channel of contact, tracing patterns, scanning the flaccid Gool mind.... I saw a world of yellow seas lapping at endless shores of mud."}, {"chunk_id": "96c9e45de562458a90d15a9e1a7bbb2e__chunk_024", "distance": "0.56725776", "text": "r the dark surface of the Gool world in its lonely trans-Plutonian orbit, I had plucked the ultimate secret of their kind. Matter across space. \"You've got to listen to me, Kayle,\" I shouted. \"I know you think I'm a Gool robot. But what I have is too big to let you blow it up without a fight. Matter transmission! You know what that can mean to us. The concept is too complex to try to describe in words. You'll have to take my word for it. I can build it, though, using standard components, plus an infinite-area antenna and a moebius-wound coil—and a few other things....\" I harangued Kayle for a"}, {"chunk_id": "96c9e45de562458a90d15a9e1a7bbb2e__chunk_008", "distance": "0.57482076", "text": "sychodynamics people have been telling me the Gool may have some kind of long-range telehypnotic ability that might make it possible for them to subvert a loyal man without his knowledge. You've told me yourself that you blacked out during the attack—and came to on the lifeboat, with no recollection of how you got there. \"This is war, Granthan. War against a vicious enemy who strike without warning and without mercy. You were sent out to investigate the possibility of—what's that term you use?—hyper-cortical invasion. You know better than most the risk I'd be running if you were allowed to"}]}
{"qid": "2fc95db8287a46f2b2469423e5880f97_q2", "doc_id": "2fc95db8287a46f2b2469423e5880f97", "question": "Who is Evelyn Sparling, and what are her traits in the story?", "chunks": [{"chunk_id": "2fc95db8287a46f2b2469423e5880f97__chunk_033", "distance": "0.59167886", "text": "ll stay head of the family, if I know her breed of green shata. Bossy, opinionated. By the way, Fordie,\" he said, rising and stretching so the fish-leather bounced and rippled off his biceps, \"that sister. She ever....\" And he'd be off again, cross-examining me about Evelyn. I sat in the swivel chair he'd vacated and tried to answer his questions. But there was a lot of stuff I didn't know. Evelyn was a healthy girl, for instance; how healthy, exactly, I had no way of finding out. Yes, I'd tell him, my aunts on both sides of my family each had had more than the average number of children. No,"}, {"chunk_id": "2fc95db8287a46f2b2469423e5880f97__chunk_009", "distance": "0.59964836", "text": "ained it all to me in the careful, patient way she always talks politics and things like that to men. \"Technically, Ferdinand, I'm the only passenger in our family. You can't be one, because, not being a citizen, you can't acquire an Earth Passport. However, you'll be going to Venus on the strength of this clause—'Miss Evelyn Sparling and all dependent male members of family, this number not to exceed the registered quota of sub-regulations pertaining'—and so on. I want you to understand these matters, so that you will grow into a man who takes an active interest in world affairs. No matter"}, {"chunk_id": "2fc95db8287a46f2b2469423e5880f97__chunk_044", "distance": "0.61620587", "text": "fingers. Then he recognized Sis from the pictures. He stepped to one side and, with the same sweeping gesture, holstered his blaster and pushed his green hood off. It was Sis's turn to jump when she saw the wild mass of hair rolling down his back. \"An honor, Miss Sparling,\" he said in that rumbly voice. \"Please come right in. There's a hurry-up draft.\" So Sis went in and I followed right after her. Mr. Brown closed the door. I tried to catch his eye so I could give him some kind of hint or explanation, but he had taken a couple of his big strides and was in the control section with Sis. She"}, {"chunk_id": "2fc95db8287a46f2b2469423e5880f97__chunk_017", "distance": "0.65317267", "text": "pened two long tooth-studded jaws. \"Green shatas!\" he said suddenly. \"Only a tadpole. I must be getting jumpy enough to splash.\" Then he shoved the blaster away in a holster made of the same scaly leather, crossed his arms on his chest and began to study me. I grunted to my feet, feeling a lot better. The coldness had gone out of his eyes. I held out my hand the way Sis had taught me. \"My name is Ferdinand Sparling. I'm very pleased to meet you, Mr.—Mr.—\" \"Hope for your sake,\" he said to me, \"that you aren't what you seem—tadpole brother to one of them husbandless anura.\" \" What? \" \"A 'nuran"}]}
{"qid": "2fc95db8287a46f2b2469423e5880f97_q3", "doc_id": "2fc95db8287a46f2b2469423e5880f97", "question": "Who is Alberta Lee Brown, and what are his traits in the story?", "chunks": [{"chunk_id": "2fc95db8287a46f2b2469423e5880f97__chunk_047", "distance": "0.52402544", "text": "ours, Mr. Alberta Lee Brown.\" Hearing his rightful name made him move suddenly and tower over her. Sis said with a certain amount of hurry and change of tone, \"What do you have to say about stowing away and using up lifeboat stores?\" He cocked his head and considered a moment. \"Look,\" he said finally, \"I have more than enough munit to pay for round trip tickets, but I couldn't get a return visa because of that brinosaur judge and all the charges she hung on me. Had to stow away. Picked the Eleanor Roosevelt because a couple of the boys in the crew are friends of mine and they were willing to"}, {"chunk_id": "2fc95db8287a46f2b2469423e5880f97__chunk_027", "distance": "0.52787423", "text": "t. Butt Lee Brown.\" I liked the sound of Ford. \"Is Butt a nickname, too?\" \"Yeah. Short for Alberta, but I haven't found a man who can draw a blaster fast enough to call me that. You see, Pop came over in the eighties—the big wave of immigrants when they evacuated Ontario. Named all us boys after Canadian provinces. I was the youngest, so I got the name they were saving for a girl.\" \"You had a lot of brothers, Mr. Butt?\" He grinned with a mighty set of teeth. \"Oh, a nestful. Of course, they were all killed in the Blue Chicago Rising by the MacGregor boys—all except me and Saskatchewan. Then"}, {"chunk_id": "2fc95db8287a46f2b2469423e5880f97__chunk_043", "distance": "0.63364738", "text": "Ferdinand....\" After that it was all over but the confession. That came in a few moments. I couldn't fool Sis. She just knew me too well, I decided miserably. Besides, she was a girl. All the same, I wouldn't get Mr. Butt Lee Brown into trouble if I could help it. I made Sis promise she wouldn't turn him in if I took her to him. And the quick, nodding way she said she would made me feel just a little better. The door opened on the signal, \"Sesame.\" When Butt saw somebody was with me, he jumped and the ten-inch blaster barrel grew out of his fingers. Then he recognized Sis from the pictures."}, {"chunk_id": "2fc95db8287a46f2b2469423e5880f97__chunk_046", "distance": "0.66382736", "text": "h and raised an enormous hand. Then he let the air out and dropped his arm. \"I take it you either have no defense or care to make none,\" Sis added caustically. Butt laughed slowly and carefully as if he were going over each word. \"Wonder if all the anura talk like that. And you want to foul up Venus.\" \"We haven't done so badly on Earth, after the mess you men made of politics. It needed a revolution of the mothers before—\" \"Needed nothing. Everyone wanted peace. Earth is a weary old world.\" \"It's a world of strong moral fiber compared to yours, Mr. Alberta Lee Brown.\" Hearing his rightful"}]}
{"qid": "2fc95db8287a46f2b2469423e5880f97_q4", "doc_id": "2fc95db8287a46f2b2469423e5880f97", "question": "How do the societal structures on Earth differ from Venus in the story?", "chunks": [{"chunk_id": "2fc95db8287a46f2b2469423e5880f97__chunk_000", "distance": "0.48727924", "text": "Venus Is a Man's World BY WILLIAM TENN Illustrated by GENE FAWCETTE [Transcriber's Note: This etext was produced from Galaxy Science Fiction July 1951. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.] Actually, there wouldn't be too much difference if women took over the Earth altogether. But not for some men and most boys! I've always said that even if Sis is seven years older than me—and a girl besides—she don't always know what's best. Put me on a spaceship jam-packed with three hundred females just aching to get themselves husbands"}, {"chunk_id": "2fc95db8287a46f2b2469423e5880f97__chunk_039", "distance": "0.54724658", "text": "owing I was getting in deeper all the time and not being able to help it. I mustn't give Mr. Brown away! \"They're trappers and farmers, pioneers and explorers, who're building Venus. And it takes a real man to build on a hot, hungry hell like Venus.\" \"Does it, now?\" she said, looking at me as if I were beginning to grow a second pair of ears. \"Tell me more.\" \"You can't have meek, law-abiding, women-ruled men when you start civilization on a new planet. You've got to have men who aren't afraid to make their own law if necessary—with their own guns. That's where law begins; the books get"}, {"chunk_id": "2fc95db8287a46f2b2469423e5880f97__chunk_022", "distance": "0.56165045", "text": "lot more men began to die or get no good from the radioactivity. Then the best men went to the planets, Sis says, until by now even if a woman can scrounge a personal husband, he's not much to boast about.\" The stranger nodded violently. \"Not on Earth, he isn't. Those busybody anura make sure of that. What a place! Suffering gridniks, I had a bellyful!\" He told me about it. Women were scarce on Venus, and he hadn't been able to find any who were willing to come out to his lonely little islands; he had decided to go to Earth where there was supposed to be a surplus. Naturally, having been"}, {"chunk_id": "2fc95db8287a46f2b2469423e5880f97__chunk_046", "distance": "0.59596288", "text": "h and raised an enormous hand. Then he let the air out and dropped his arm. \"I take it you either have no defense or care to make none,\" Sis added caustically. Butt laughed slowly and carefully as if he were going over each word. \"Wonder if all the anura talk like that. And you want to foul up Venus.\" \"We haven't done so badly on Earth, after the mess you men made of politics. It needed a revolution of the mothers before—\" \"Needed nothing. Everyone wanted peace. Earth is a weary old world.\" \"It's a world of strong moral fiber compared to yours, Mr. Alberta Lee Brown.\" Hearing his rightful"}]}
{"qid": "2fc95db8287a46f2b2469423e5880f97_q5", "doc_id": "2fc95db8287a46f2b2469423e5880f97", "question": "Describe the main setting of the story.", "chunks": [{"chunk_id": "2fc95db8287a46f2b2469423e5880f97__chunk_020", "distance": "0.71682203", "text": "the same time settlements were springing up on the planets. He looked impressed when I told him about Mom and Pop being one of the first couples to get married in Undersea. He looked thoughtful when I told him how Sis and I had been born there and spent half our childhood listening to the pressure pumps. He raised his eyebrows and looked disgusted when I told how Mom, as Undersea representative on the World Council, had been one of the framers of the Male Desuffrage Act after the Third Atomic War had resulted in the Maternal Revolution. He almost squeezed my arm when I got to the time Mom and"}, {"chunk_id": "2fc95db8287a46f2b2469423e5880f97__chunk_003", "distance": "0.71869314", "text": "ooth white doors—on and on and on. Gee , I thought excitedly, this is one big ship ! Of course, every once in a while I would run across a big scene of stars in the void set in the wall; but they were only pictures. Nothing that gave the feel of great empty space like I'd read about in The Boy Rocketeers , no portholes, no visiplates, nothing. So when I came to the crossway, I stopped for a second, then turned left. To the right, see, there was Deck Four, then Deck Three, leading inward past the engine fo'c'sle to the main jets and the grav helix going purr-purr-purrty-purr in the comforting"}, {"chunk_id": "2fc95db8287a46f2b2469423e5880f97__chunk_001", "distance": "0.72544265", "text": "red females just aching to get themselves husbands in the one place they're still to be had—the planet Venus—and you know I'll be in trouble. Bad trouble. With the law, which is the worst a boy can get into. Twenty minutes after we lifted from the Sahara Spaceport, I wriggled out of my acceleration hammock and started for the door of our cabin. \"Now you be careful, Ferdinand,\" Sis called after me as she opened a book called Family Problems of the Frontier Woman . \"Remember you're a nice boy. Don't make me ashamed of you.\" I tore down the corridor. Most of the cabins had purple lights on in"}, {"chunk_id": "2fc95db8287a46f2b2469423e5880f97__chunk_040", "distance": "0.72681892", "text": "r own guns. That's where law begins; the books get written up later.\" \"You're going to tell , Ferdinand, what evil, criminal male is speaking through your mouth!\" \"Nobody!\" I insisted. \"They're my own ideas!\" \"They are remarkably well-organized for a young boy's ideas. A boy who, I might add, has previously shown a ridiculous but nonetheless entirely masculine boredom with political philosophy. I plan to have a government career on that new planet you talk about, Ferdinand—after I have found a good, steady husband, of course—and I don't look forward to a masculinist radical in the family."}]}
{"qid": "cd79f936987e44da95c8ceaa4a3cb0d4_q2", "doc_id": "cd79f936987e44da95c8ceaa4a3cb0d4", "question": "What are the Terrans doing on Snaddra? What is the significance of their visit?", "chunks": [{"chunk_id": "cd79f936987e44da95c8ceaa4a3cb0d4__chunk_049", "distance": "0.39256287", "text": "the only vegetable that would grow on Snaddra, and originally a Terran import at that. So food and fiber had to be brought from the other planets, at fabulous expense, for Snaddra was not on any of the direct trade routes and was too unattractive to lure the tourist business. Something definitely had to be done, if it were not to decay altogether. And that was where the Planetary Dilettante came in. The traditional office of Planetary Dilettante was a civil-service job, awarded by competitive examination whenever it fell vacant to the person who scored highest in intelligence, character and"}, {"chunk_id": "cd79f936987e44da95c8ceaa4a3cb0d4__chunk_019", "distance": "0.46319723", "text": "gh the mud to meet a procession of young Snaddrath dressed in elaborate ceremonial costumes, and singing a popular ballad—to which less ribald, as well as less inspiring, words than the originals had been fitted by Bbulas, just in case, by some extremely remote chance, the Terrans had acquired a smattering of Snadd somewhere. Since neither party was accustomed to navigating mud, their progress was almost imperceptible. \"Alms, for the love of Ipsnadd,\" chanted Skkiru the beggar. His teeth chattered as he spoke, for the rags he wore had been custom-weatherbeaten for him by the planet's best"}, {"chunk_id": "cd79f936987e44da95c8ceaa4a3cb0d4__chunk_024", "distance": "0.47074652", "text": "from the Snaddrath. They were dressed much as the Snaddrath had been before they had adopted primitive garb. In fact, the Terrestrials were quite decent-looking life-forms, entirely different from the foppish monsters Skkiru had somehow expected to represent the cultural ruling race. Of course, he had frequently seen pictures of them, but everyone knew how easily those could be retouched. Why, it was the Terrestrials themselves, he had always understood, who had invented the art of retouching—thus proving beyond a doubt that they had something to hide. \"Look, Raoul,\" the older of the two"}, {"chunk_id": "cd79f936987e44da95c8ceaa4a3cb0d4__chunk_037", "distance": "0.47480899", "text": "the planet, it was not politic for the Earthmen to discover how heavily the Snaddrath depended upon imports. As the Earthmen reached the temple, Larhgan now appeared to join Bbulas at the head of the long flight of stairs that led to it. Although Skkiru had seen her in her priestly apparel before, it had not made the emotional impression upon him then that it did now, when, standing there, clad in beauty, dignity and warm clothes, she bade the newcomers welcome in several thousand words not too well chosen for her by Bbulas—who fancied himself a speech-writer as well as a speech-maker, for"}]}
{"qid": "cd79f936987e44da95c8ceaa4a3cb0d4_q3", "doc_id": "cd79f936987e44da95c8ceaa4a3cb0d4", "question": "Describe the natives of Snaddra.", "chunks": [{"chunk_id": "cd79f936987e44da95c8ceaa4a3cb0d4__chunk_019", "distance": "0.43527406", "text": "gh the mud to meet a procession of young Snaddrath dressed in elaborate ceremonial costumes, and singing a popular ballad—to which less ribald, as well as less inspiring, words than the originals had been fitted by Bbulas, just in case, by some extremely remote chance, the Terrans had acquired a smattering of Snadd somewhere. Since neither party was accustomed to navigating mud, their progress was almost imperceptible. \"Alms, for the love of Ipsnadd,\" chanted Skkiru the beggar. His teeth chattered as he spoke, for the rags he wore had been custom-weatherbeaten for him by the planet's best"}, {"chunk_id": "cd79f936987e44da95c8ceaa4a3cb0d4__chunk_021", "distance": "0.46064836", "text": "rimitive. The outside was no place for a civilized human being, particularly in the wet season or—more properly speaking on Snaddra—the wetter season. Skkiru's feet were soaked with mud; not that the light sandals worn by the members of the procession appeared to be doing them much good, either. It gave him a kind of melancholy pleasure to see that the privileged ones were likewise trying to repress shivers. Though their costumes were rich, they were also scanty, particularly in the case of the females, for Earthmen had been reported by tape and tale to be humanoid. As the mud clutched his"}, {"chunk_id": "cd79f936987e44da95c8ceaa4a3cb0d4__chunk_049", "distance": "0.46185595", "text": "the only vegetable that would grow on Snaddra, and originally a Terran import at that. So food and fiber had to be brought from the other planets, at fabulous expense, for Snaddra was not on any of the direct trade routes and was too unattractive to lure the tourist business. Something definitely had to be done, if it were not to decay altogether. And that was where the Planetary Dilettante came in. The traditional office of Planetary Dilettante was a civil-service job, awarded by competitive examination whenever it fell vacant to the person who scored highest in intelligence, character and"}, {"chunk_id": "cd79f936987e44da95c8ceaa4a3cb0d4__chunk_024", "distance": "0.46802843", "text": "from the Snaddrath. They were dressed much as the Snaddrath had been before they had adopted primitive garb. In fact, the Terrestrials were quite decent-looking life-forms, entirely different from the foppish monsters Skkiru had somehow expected to represent the cultural ruling race. Of course, he had frequently seen pictures of them, but everyone knew how easily those could be retouched. Why, it was the Terrestrials themselves, he had always understood, who had invented the art of retouching—thus proving beyond a doubt that they had something to hide. \"Look, Raoul,\" the older of the two"}]}
{"qid": "cd79f936987e44da95c8ceaa4a3cb0d4_q4", "doc_id": "cd79f936987e44da95c8ceaa4a3cb0d4", "question": "Describe the setting of the story, Snaddra.", "chunks": [{"chunk_id": "cd79f936987e44da95c8ceaa4a3cb0d4__chunk_019", "distance": "0.50618428", "text": "gh the mud to meet a procession of young Snaddrath dressed in elaborate ceremonial costumes, and singing a popular ballad—to which less ribald, as well as less inspiring, words than the originals had been fitted by Bbulas, just in case, by some extremely remote chance, the Terrans had acquired a smattering of Snadd somewhere. Since neither party was accustomed to navigating mud, their progress was almost imperceptible. \"Alms, for the love of Ipsnadd,\" chanted Skkiru the beggar. His teeth chattered as he spoke, for the rags he wore had been custom-weatherbeaten for him by the planet's best"}, {"chunk_id": "cd79f936987e44da95c8ceaa4a3cb0d4__chunk_048", "distance": "0.52894670", "text": "estrial magazine and had been acquired from a rare tape-and-book dealer on Gambrell, for, Skkiru thought, far too high a price. He could have designed them himself just as badly and much more cheaply. It wasn't that Skkiru didn't understand well enough that Snaddra had been forced into making such a drastic change in its way of life. What resources it once possessed had been depleted and—aside from minerals—they had never been very extensive to begin with. All life-forms on the planet were on the point of extinction, save fish and rice—the only vegetable that would grow on Snaddra, and"}, {"chunk_id": "cd79f936987e44da95c8ceaa4a3cb0d4__chunk_000", "distance": "0.53983301", "text": "The Ignoble Savages By EVELYN E. SMITH Illustrated by DILLON [Transcriber's Note: This etext was produced from Galaxy Science Fiction March 1957. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.] Snaddra had but one choice in its fight to afford to live belowground—underhandedly pretend theirs was an aboveboard society! \"Go Away from me, Skkiru,\" Larhgan said, pushing his hand off her arm. \"A beggar does not associate with the high priestess of Snaddra.\" \"But the Earthmen aren't due for another fifteen minutes,\" Skkiru protested. \"Of"}, {"chunk_id": "cd79f936987e44da95c8ceaa4a3cb0d4__chunk_021", "distance": "0.54063874", "text": "rimitive. The outside was no place for a civilized human being, particularly in the wet season or—more properly speaking on Snaddra—the wetter season. Skkiru's feet were soaked with mud; not that the light sandals worn by the members of the procession appeared to be doing them much good, either. It gave him a kind of melancholy pleasure to see that the privileged ones were likewise trying to repress shivers. Though their costumes were rich, they were also scanty, particularly in the case of the females, for Earthmen had been reported by tape and tale to be humanoid. As the mud clutched his"}]}
{"qid": "cd79f936987e44da95c8ceaa4a3cb0d4_q5", "doc_id": "cd79f936987e44da95c8ceaa4a3cb0d4", "question": "Who is Bbulas, and what happens to him throughout the story?", "chunks": [{"chunk_id": "cd79f936987e44da95c8ceaa4a3cb0d4__chunk_004", "distance": "0.53607976", "text": "lanet. And this new project was the last straw. No longer able to control his rage and grief, he turned a triple somersault in the air with rage. \"Then why was I made a beggar and she the high priestess? You arranged that purposely, Bbulas. You—\" \"Now, Skkiru,\" Bbulas said wearily, for they had been through all this before, \"you know that all the ranks and positions were distributed by impartial lot, except for mine, and, of course, such jobs as could carry over from the civilized into the primitive.\" Bbulas breathed on the spectacles he was wearing, as contact lenses were not considered"}, {"chunk_id": "cd79f936987e44da95c8ceaa4a3cb0d4__chunk_036", "distance": "0.53830194", "text": "ically with a large lowest caste. Bbulas had taken the easy way out. Skkiru swallowed the last of the chocolate and regarded the \"high priest\" with a simple-minded mendicant's grin. However, there were volcanic passions within him that surged up from his toes when, as the wind and rain whipped through his scanty coverings, he remembered the snug underskirts Bbulas was wearing beneath his warm gown. They were metal, but they were solid. All the garments visible or potentially visible were of woven metal, because, although there was cloth on the planet, it was not politic for the Earthmen to"}, {"chunk_id": "cd79f936987e44da95c8ceaa4a3cb0d4__chunk_052", "distance": "0.58029121", "text": "ad, after considerable soul-searching, called upon Bbulas to plan a method of saving Snaddra—and Bbulas, happy to be in the limelight at last, had come up with this program. It was not one Skkiru himself would have chosen. It was not one, he felt, that any reasonable person would have chosen. Nevertheless, the Bbulas Plan had been adopted by a majority vote of the Snaddrath, largely because no one had come up with a feasible alternative and, as a patriotic citizen, Skkiru would abide by it. He would accept the status of beggar; it was his duty to do so. Moreover, as in the case of the planet,"}, {"chunk_id": "cd79f936987e44da95c8ceaa4a3cb0d4__chunk_034", "distance": "0.59051859", "text": "discovered, did give him certain small, momentary advantages over those who had been alloted higher ranks. For one thing, it was quite in character for him to tread curiously upon the strangers' heels all the way to the temple—a ramshackle affair, but then it had been run up in only three days—where the official reception was to be held. The principal difficulty was that, because of his equipment, he had a little trouble keeping himself from overshooting the strangers. And though Bbulas might frown menacingly at him—and not only for his forwardness—that was in character on both sides, too."}]}
{"qid": "1834a081a5024a61889fa71a19cb88f1_q2", "doc_id": "1834a081a5024a61889fa71a19cb88f1", "question": "What is the main setting of the story", "chunks": [{"chunk_id": "1834a081a5024a61889fa71a19cb88f1__chunk_019", "distance": "0.74249291", "text": "sently holding it, he straightened up to face Mrs. Jacobsen and the irate newcomer. Hastily he pushed a tagged key at Harper. \"Here you are, Mr. Breen. I'm sure you'll find it comfortable.\" With a pallid smile he pressed a button and consigned Harper to the care of a silent and efficient robot. The room was more than comfortable. It was beautiful. Its bank of clear windows set in the green glass wall framed startling rubicund views of the Martian hinterland where, Harper affectionately thought, fungi were busy producing enzymes that were going to be worth millions for him and his associates."}, {"chunk_id": "1834a081a5024a61889fa71a19cb88f1__chunk_006", "distance": "0.74508762", "text": "as built the largest extra-terrestial hotel of the solar system there and that people are flocking to it to get cured of whatever ails 'em? Old man, you missed a bet!\" Leaping from the sofa, Harper rudely snatched the magazine from Scribney's hands. He glared at the spread which depicted a star-shaped structure of bottle-green glass resting jewel-like on the rufous rock of Mars. The main portion of the building consisted of a circular skyscraper with a glass-domed roof. Between its star-shaped annexes, other domes covered landscaped gardens and noxious pools which in the drawing looked lovely"}, {"chunk_id": "1834a081a5024a61889fa71a19cb88f1__chunk_046", "distance": "0.75185144", "text": "personally escorted him not merely to the door but across the lobby to the elevator. Harper gazed out at the stunned audience. This was more like the treatment he was accustomed to! Haughtily he squared his bony shoulders inside the immense jacket and stepped into the elevator. He was ready for the second step of his private Operation Robot. Back on Earth it was a warm, misty spring day—the kind of day unknown to the planet Mars. Bella and Scribney, superb in new spring outfits, waited restlessly while the rocket cooled and the passengers recovered from deceleration. \"Look, Scrib!\" Bella"}, {"chunk_id": "1834a081a5024a61889fa71a19cb88f1__chunk_005", "distance": "0.76168180", "text": "e craziest conglomeration of liquids ever tapped!\" Scribney, whose large, phlegmatic person and calm professorial brain were the complete antithesis of Harper's picked-crow physique and scheming financier's wits, looked severely over his glasses. Harp's nervous tribulations were beginning to bore him, as well as interfere with the harmony of his home. \"You're away behind the times, Harp,\" he declared. \"Don't you know that those have proved to be the most astoundingly curative springs ever discovered anywhere? Don't you know that a syndicate has built the largest extra-terrestial hotel of the"}]}
{"qid": "1834a081a5024a61889fa71a19cb88f1_q3", "doc_id": "1834a081a5024a61889fa71a19cb88f1", "question": "Why do the robots not make good hotel staff?", "chunks": [{"chunk_id": "1834a081a5024a61889fa71a19cb88f1__chunk_015", "distance": "0.42006475", "text": "u should be able to give me a television star if I want one! I won't have another of those damnable robots in my room, do you hear?\" No one within the confines of the huge lobby could have helped hearing. The clerk flinched visibly. \"Now, Mrs. Jacobsen,\" he soothed. \"You know the hotel is staffed entirely with robots. They're much more expensive, really, than human employees, but so much more efficient, you know. Admit it, they give excellent service, don't they, now?\" Toothily he smiled at the enraged woman. \"That's just it!\" Mrs. Jacobsen glared. \"The service is too good. I might just as"}, {"chunk_id": "1834a081a5024a61889fa71a19cb88f1__chunk_013", "distance": "0.50873542", "text": "t, he watched the robots moving efficiently about, pushing patients in wheelchairs, carrying trays, guiding newcomers, performing janitorial duties tirelessly, promptly, and best of all, silently. Harper was enthralled. He'd staff his offices with them. Hang the expense! There'd be no more of that obnoxious personal friction and proneness to error that was always deviling the most carefully trained office staffs! He'd investigate and find out the exact potentialities of these robots while here, and then go home and introduce them into the field of business. He'd show them whether he was"}, {"chunk_id": "1834a081a5024a61889fa71a19cb88f1__chunk_042", "distance": "0.56280094", "text": "king hand he mopped his forehead. \" My robots!\" he muttered. \"As if I invented the damned things!\" Despondently he looked at Harper. \"Go ahead and sue, Mr. Breen. If you don't, somebody else will. And if nobody sues, we'll go broke anyway, at the rate our guest list is declining. I'm ready to hand in my resignation.\" Again he sighed. \"The trouble,\" he explained, \"is that those fool robots are completely logical, and people aren't. There's no way to mix the two. It's dynamite. Maybe people can gradually learn to live with robots, but they haven't yet. Only we had to find it out the hard way."}, {"chunk_id": "1834a081a5024a61889fa71a19cb88f1__chunk_027", "distance": "0.57282686", "text": "eak. But just then the door opened briskly and two robots entered. With a horrified stare, Harper clutched his maltreated stomach. He saw a third robot enter, wheeling a chair. \"A wheel chair!\" squeaked the victim. \"I tell you, there's nothing wrong with me! Take it away! I'm only here for a rest-cure! Believe me! Take it away!\" The robots ignored him. For the first time in his spectacular and ruthless career Harper was up against creatures that he could neither bribe, persuade nor browbeat, inveigle nor ignore. It shattered his ebbing self-confidence. He began waving his hands helplessly."}]}
{"qid": "1834a081a5024a61889fa71a19cb88f1_q4", "doc_id": "1834a081a5024a61889fa71a19cb88f1", "question": "What are the treatments that Harper went through, and what were their effects?", "chunks": [{"chunk_id": "1834a081a5024a61889fa71a19cb88f1__chunk_022", "distance": "0.51745009", "text": "o further opportunity to examine them. With brisk, well-co-ordinated movements they wheeled a stretcher along-side his couch, stuck a hypo into his arm, bundled him onto the stretcher and started wheeling him out. Harper's tongue finally functioned. \"What's all this?\" he demanded. \"There's nothing wrong with me. Let me go!\" He struggled to rise, but a metal hand pushed him firmly on the chest. Inexorably it pushed him flat. \"You've got the wrong room!\" yelled Harp. \"Let me go!\" But the hypo began to take effect. His yells became weaker and drowsier. Hazily, as he drifted off, he thought of"}, {"chunk_id": "1834a081a5024a61889fa71a19cb88f1__chunk_028", "distance": "0.54502296", "text": "-confidence. He began waving his hands helplessly. The robots not only ignored Harper. They paid no attention at all to Jake Ellis, who was plucking at their metallic arms pleading, \"Take me, boys. I need the treatment bad, whatever it is. I need all the treatment I can get. Take me! I'm just a wreck, fellers—\" Stolidly they picked Harper up, plunked him into the chair, strapped him down and marched out with him. Dejectedly Ellis returned to his own room. Again he lifted the receiver of the room phone; but as usual a robot voice answered sweetly, mechanically, and meaninglessly. He hung up"}, {"chunk_id": "1834a081a5024a61889fa71a19cb88f1__chunk_017", "distance": "0.60025233", "text": "could at least be civil enough to wait your turn!\" Harper smirked. \"My good woman, I'm not a robot. Robots, of course, are always civil. But you should know by now that civility isn't a normal human trait.\" Leaving her temporarily quashed, he beckoned authoritatively to the clerk. \"I've just arrived and want to get settled. I'm here merely for a rest-cure, no treatments. You can assign my quarters before continuing your—ah—discussion with the lady.\" The clerk sputtered. Mrs. Jacobsen sputtered. But not for nothing was Harper one of the leading business executives of the earth. Harper's"}, {"chunk_id": "1834a081a5024a61889fa71a19cb88f1__chunk_027", "distance": "0.60389864", "text": "eak. But just then the door opened briskly and two robots entered. With a horrified stare, Harper clutched his maltreated stomach. He saw a third robot enter, wheeling a chair. \"A wheel chair!\" squeaked the victim. \"I tell you, there's nothing wrong with me! Take it away! I'm only here for a rest-cure! Believe me! Take it away!\" The robots ignored him. For the first time in his spectacular and ruthless career Harper was up against creatures that he could neither bribe, persuade nor browbeat, inveigle nor ignore. It shattered his ebbing self-confidence. He began waving his hands helplessly."}]}
{"qid": "1834a081a5024a61889fa71a19cb88f1_q5", "doc_id": "1834a081a5024a61889fa71a19cb88f1", "question": "Why has Ellis booked into the hotel, and what has his experience been like?", "chunks": [{"chunk_id": "1834a081a5024a61889fa71a19cb88f1__chunk_045", "distance": "0.59483069", "text": "o consideration that it would be an experiment for me, too. And there's the suit I'm clearly justified in instituting. However, I'm willing to discuss the matter with your superiors.\" With hope burgeoning for the first time in weeks, Hayes lifted his head. \"My dear Mr. Breen, to get rid of these pestiferous robots, I'll back you to the hilt! I'll notify the owners at once. At once, Mr. Breen! And while we wait for them, allow me to put you up as a guest of the hotel.\" Coming around to Harper, he effusively shook Harp's scrawny hand, and then personally escorted him not merely to the door but"}, {"chunk_id": "1834a081a5024a61889fa71a19cb88f1__chunk_033", "distance": "0.61516023", "text": "l bet that clerk got rattled and gave me the wrong key. I'll bet you're supposed to have this room and I'm getting your treatments. Why don't we switch rooms and see what happens?\" \"Say, maybe you're right!\" Jake's eyes gleamed at last with hope. \"I'll get my clothes.\" Harp's eyebrows rose. \"You mean they left you your clothes?\" \"Why, sure. You mean they took yours?\" Harp nodded. An idea began to formulate. \"Leave your things, will you? I'm desperate! I'm going to see the manager of this madhouse if I have to go down dressed in a sheet. Your clothes would be better than that.\" Jake, looking"}, {"chunk_id": "1834a081a5024a61889fa71a19cb88f1__chunk_006", "distance": "0.61656427", "text": "as built the largest extra-terrestial hotel of the solar system there and that people are flocking to it to get cured of whatever ails 'em? Old man, you missed a bet!\" Leaping from the sofa, Harper rudely snatched the magazine from Scribney's hands. He glared at the spread which depicted a star-shaped structure of bottle-green glass resting jewel-like on the rufous rock of Mars. The main portion of the building consisted of a circular skyscraper with a glass-domed roof. Between its star-shaped annexes, other domes covered landscaped gardens and noxious pools which in the drawing looked lovely"}, {"chunk_id": "1834a081a5024a61889fa71a19cb88f1__chunk_010", "distance": "0.62694627", "text": "!\" exploded Bella. \"Stop it! Maybe Jackson doesn't know a thing about it, whatever it is! If it's something at the Emerald Star Hotel, why don't you just go and find out for yourself instead of throwing a tantrum? That's the only sensible way!\" \"You're right, Bella,\" agreed Harper incisively. \"I'll go and find out for myself. Immediately!\" Scooping up his hat, he left at his usual lope. \"Well!\" remarked his sister. \"All I can say is that they'd better turn that happy-gas on extra strong for Harp's trip out!\" The trip out did Harper a world of good. Under the influence of the soporific gas"}]}
{"qid": "f8162edda8394d38a5d474ea7fe45079_q2", "doc_id": "f8162edda8394d38a5d474ea7fe45079", "question": "Compare and contrast Georges and Retief.", "chunks": [{"chunk_id": "f8162edda8394d38a5d474ea7fe45079__chunk_041", "distance": "0.49724543", "text": "e they were right all along. However, I've no time to waste in neurotic compensations. I have places to go and deeds to accomplish.\" \"At first glance,\" Retief said, \"it looks as though the places are already occupied, and the deeds are illegal.\" The Aga Kaga guffawed. \"For a diplomat, you speak plainly, Retief. Have another drink.\" He poured, eyeing Georges. \"What of M. Duror? How does he feel about it?\" Georges took a thoughtful swallow of whiskey. \"Not bad,\" he said. \"But not quite good enough to cover the odor of goats.\" The Aga Kaga snorted. \"I thought the goats were overdoing it a bit"}, {"chunk_id": "f8162edda8394d38a5d474ea7fe45079__chunk_029", "distance": "0.51969296", "text": "wing the leading rider. Retief leaned back and let out a long sigh. \"That was close,\" he said. \"I was about out of proverbs.\" \"You sound as though you'd brought off a coup,\" Georges said. \"From the expression on the whiskery one's face, we're in for trouble. What was he saying?\" \"Just a routine exchange of bluffs,\" Retief said. \"Now when we get there, remember to make your flattery sound like insults and your insults sound like flattery, and you'll be all right.\" \"These birds are armed. And they don't like strangers,\" Georges said. \"Maybe I should have boned up on their habits before I joined"}, {"chunk_id": "f8162edda8394d38a5d474ea7fe45079__chunk_050", "distance": "0.52916682", "text": "he spoils for local political opportunists and mob leaders, clothed in the mystical virtue of native birth. Have a banana.\" \"You're stretching your analogy a little too far,\" Retief said. \"You're banking on the inaction of the Corps. You could be wrong.\" \"I shall know when to stop,\" the Aga Kaga said. \"Tell me, Stanley,\" Retief said, rising. \"Are we quite private here?\" \"Yes, perfectly so,\" the Aga Kaga said. \"None would dare to intrude in my council.\" He cocked an eyebrow at Retief. \"You have a proposal to make in confidence? But what of our dear friend Georges? One would not like to see him"}, {"chunk_id": "f8162edda8394d38a5d474ea7fe45079__chunk_011", "distance": "0.54002094", "text": "broad verandah at Government House, Retief settled himself comfortably in a lounge chair. He accepted a tall glass from a white-jacketed waiter and regarded the flamboyant Flamme sunset, a gorgeous blaze of vermillion and purple that reflected from a still lake, tinged the broad lawn with color, silhouetted tall poplars among flower beds. \"You've done great things here in sixty years, Georges,\" said Retief. \"Not that natural geological processes wouldn't have produced the same results, given a couple of hundred million years.\" \"Don't belabor the point,\" the Boyar Chef d'Regime said. \"Since we"}]}
{"qid": "f8162edda8394d38a5d474ea7fe45079_q3", "doc_id": "f8162edda8394d38a5d474ea7fe45079", "question": "Describe the setting of the story.", "chunks": [{"chunk_id": "f8162edda8394d38a5d474ea7fe45079__chunk_022", "distance": "0.69808060", "text": "Look over there.\" A hundred yards away, a trio of brown-cloaked horsemen topped a rise, paused dramatically against the cloudless pale sky, then galloped down the slope toward the car, rifles bobbing at their backs, cloaks billowing out behind. Side by side they rode, through the brown-golden grain, cutting three narrow swaths that ran in a straight sweep from the ridge to the air-car where Retief and the Chef d'Regime hovered, waiting. Georges scrambled for the side of the car. \"Just wait 'til I get my hands on him!\" Retief pulled him back. \"Sit tight and look pleased, Georges. Never give"}, {"chunk_id": "f8162edda8394d38a5d474ea7fe45079__chunk_004", "distance": "0.72462881", "text": "id. \"They were assured of Corps support.\" \"I don't believe you'll find that in writing,\" said the Under-Secretary blandly. \"In any event, that was sixty years ago. At that time a foothold against Neo-Concordiatist elements was deemed desirable. Now the situation has changed.\" \"The Boyars have spent sixty years terraforming Flamme,\" Retief said. \"They've cleared jungle, descummed the seas, irrigated deserts, set out forests. They've just about reached the point where they can begin to enjoy it. The Aga Kagans have picked this as a good time to move in. They've landed thirty detachments of"}, {"chunk_id": "f8162edda8394d38a5d474ea7fe45079__chunk_035", "distance": "0.72689563", "text": "\" \"We have no such intentions, Excellency,\" Retief said. \"Is it not written, 'Have no faith in the Prince whose minister cheats you'?\" \"I've had some unhappy experiences with strangers,\" the Aga Kaga said. \"It is written in the sands that all strangers are kin. Still, he who visits rarely is a welcome guest. Be seated.\" III Handmaidens brought cushions, giggled and fled. Retief and Georges settled themselves comfortably. The Aga Kaga eyed them in silence. \"We have come to bear tidings from the Corps Diplomatique Terrestrienne,\" Retief said solemnly. A perfumed slave girl offered grapes."}, {"chunk_id": "f8162edda8394d38a5d474ea7fe45079__chunk_000", "distance": "0.72693145", "text": "THE DESERT AND THE STARS BY KEITH LAUMER The Aga Kaga wanted peace—a piece of everything in sight! [Transcriber's Note: This etext was produced from Worlds of If Science Fiction, November 1962. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.] \"I'm not at all sure,\" Under-Secretary Sternwheeler said, \"that I fully understand the necessity for your ... ah ... absenting yourself from your post of duty, Mr. Retief. Surely this matter could have been dealt with in the usual way—assuming any action is necessary.\" \"I had a sharp attack of"}]}
{"qid": "f8162edda8394d38a5d474ea7fe45079_q4", "doc_id": "f8162edda8394d38a5d474ea7fe45079", "question": "What is the role of history in the story?", "chunks": [{"chunk_id": "f8162edda8394d38a5d474ea7fe45079__chunk_045", "distance": "0.71573585", "text": "s of popular folk-lore. Let's be pragmatic; it's a matter of historical association. Some people can grab land and pass it off lightly as a moral duty; others are dubbed imperialist merely for holding onto their own. Unfair, you say. But that's life, my friends. And I shall continue to take every advantage of it.\" \"We'll fight you!\" Georges bellowed. He took another gulp of whiskey and slammed the glass down. \"You won't take this world without a struggle!\" \"Another?\" the Aga Kaga said, offering the bottle. Georges glowered as his glass was filled. The Aga Kaga held the glass up to the light."}, {"chunk_id": "f8162edda8394d38a5d474ea7fe45079__chunk_016", "distance": "0.72182465", "text": "cars of the most modern design.\" The Chef d'Regime chewed his cigar. \"Why the masquerade?\" \"Something to do with internal policies, I suppose.\" \"So we sit tight and watch 'em take our world away from us. That's what I get for playing along with you, Retief. We should have clobbered these monkeys as soon as they set foot on our world.\" \"Slow down, I haven't finished yet. There's still the Note.\" \"I've got plenty of paper already. Rolls and rolls of it.\" \"Give diplomatic processes a chance,\" said Retief. \"The Note hasn't even been delivered yet. Who knows? We may get surprising results.\" \"If"}, {"chunk_id": "f8162edda8394d38a5d474ea7fe45079__chunk_037", "distance": "0.72361821", "text": "a said. \"Let's drop the wisdom of the ages and get down to the issues. Not that I don't admire your repertoire of platitudes. How do you remember them all?\" \"Diplomats and other liars require good memories,\" said Retief. \"But as you point out, small wisdom to small minds. I'm here to effect a settlement of certain differences between yourself and the planetary authorities. I have here a Note, which I'm conveying on behalf of the Sector Under-Secretary. With your permission, I'll read it.\" \"Go ahead.\" The Aga Kaga kicked a couple of cushions onto the floor, eased a bottle from under the couch"}, {"chunk_id": "f8162edda8394d38a5d474ea7fe45079__chunk_048", "distance": "0.72877419", "text": "of the past?\" \"Ah, but they grew incautious. They went too far, too fast.\" \"The confounded impudence,\" Georges rasped. \"Tells us to our face what he has in mind!\" \"An ancient and honorable custom, from the time of Mein Kampf and the Communist Manifesto through the Porcelain Wall of Leung. Such declarations have a legendary quality. It's traditional that they're never taken at face value.\" \"But always,\" Retief said, \"there was a critical point at which the man on horseback could have been pulled from the saddle.\" \" Could have been,\" the Aga Kaga chuckled. He finished the grapes and began"}]}
{"qid": "f8162edda8394d38a5d474ea7fe45079_q5", "doc_id": "f8162edda8394d38a5d474ea7fe45079", "question": "What is the role of the Aga Kagans in the story?", "chunks": [{"chunk_id": "f8162edda8394d38a5d474ea7fe45079__chunk_014", "distance": "0.52432209", "text": "er, that'll be the end. There's a strong vigilante organization here that's been outfitting for the last four weeks. If I hadn't held them back with assurances that the CDT would step in and take care of this invasion, they would have hit them before now.\" \"That would have been a mistake,\" said Retief. \"The Aga Kagans are tough customers. They're active on half a dozen worlds at the moment. They've been building up for this push for the last five years. A show of resistance by you Boyars without Corps backing would be an invitation to slaughter—with the excuse that you started it.\" \"So what"}, {"chunk_id": "f8162edda8394d38a5d474ea7fe45079__chunk_002", "distance": "0.55002499", "text": "rts.\" \"It seems nobody's told the Aga Kagans about fiscal years,\" Retief said. \"They're going right ahead with their program of land-grabbing on Flamme. So far, I've persuaded the Boyars that this is a matter for the Corps, and not to take matters into their own hands.\" The Under-Secretary nodded. \"Quite right. Carry on along the same lines. Now, if there's nothing further—\" \"Thank you, Mr. Secretary,\" Magnan said, rising. \"We certainly appreciate your guidance.\" \"There is a little something further,\" said Retief, sitting solidly in his chair. \"What's the Corps going to do about the Aga"}, {"chunk_id": "f8162edda8394d38a5d474ea7fe45079__chunk_046", "distance": "0.56502658", "text": "lled. The Aga Kaga held the glass up to the light. \"Excellent color, don't you agree?\" He turned his eyes on Georges. \"It's pointless to resist,\" he said. \"We have you outgunned and outmanned. Your small nation has no chance against us. But we're prepared to be generous. You may continue to occupy such areas as we do not immediately require until such time as you're able to make other arrangements.\" \"And by the time we've got a crop growing out of what was bare rock, you'll be ready to move in,\" the Boyar Chef d'Regime snapped. \"But you'll find that we aren't alone!\" \"Quite alone,\" the Aga"}, {"chunk_id": "f8162edda8394d38a5d474ea7fe45079__chunk_036", "distance": "0.56582302", "text": "id solemnly. A perfumed slave girl offered grapes. \"Modest ignorance is better than boastful knowledge,\" the Aga Kaga said. \"What brings the CDT into the picture?\" \"The essay of the drunkard will be read in the tavern,\" Retief said. \"Whereas the words of kings....\" \"Very well, I concede the point.\" The Aga Kaga waved a hand at the serving maids. \"Depart, my dears. Attend me later. You too, Ralph. These are mere diplomats. They are men of words, not deeds.\" The bearded man glared and departed. The girls hurried after him. \"Now,\" the Aga Kaga said. \"Let's drop the wisdom of the ages and get"}]}
{"qid": "cc0c681db1a447bda048ed181919b50a_q2", "doc_id": "cc0c681db1a447bda048ed181919b50a", "question": "What settings does the story take place in?", "chunks": [{"chunk_id": "cc0c681db1a447bda048ed181919b50a__chunk_000", "distance": "0.73178101", "text": "MUCK MAN BY FREMONT DODGE The work wasn't hard, but there were some sacrifices. You had to give up hope and freedom—and being human! [Transcriber's Note: This etext was produced from Worlds of If Science Fiction, November 1963. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.] I The girl with the Slider egg glittering in her hair watched the bailiff lead Asa Graybar out of the courtroom. He recognized her as old Hazeltyne's daughter Harriet, no doubt come to see justice done. She didn't have the hothouse-flower look Asa would have"}, {"chunk_id": "cc0c681db1a447bda048ed181919b50a__chunk_021", "distance": "0.73998833", "text": "Kershaw pushed open a sliding door to lead the way out of the room where they had been left to revive from conversion. They went into a courtyard partly covered by a roof projecting from the Hazeltyne company's dome settlement. The far half of the courtyard was open to the gray drizzle that fell almost ceaselessly from the sky of Jordan's Planet and turned most of its surface into marsh and mud flats. A high wall enclosed the far portion of the courtyard. Ranged along the wall were thirty stalls for muck men. From fifty yards across the courtyard a muck man bounded over to them in two leaps."}, {"chunk_id": "cc0c681db1a447bda048ed181919b50a__chunk_008", "distance": "0.75820094", "text": "asked the man assigned to his case. It would look suspicious if he asked for Jordan's Planet without some preliminary questions. \"Four,\" answered the doctor. \"Squiffs for New Arcady. Adapted for climbing the skycraper trees and with the arm structure modified into pseudo-wings or gliding. Then we need spiderinos for Von Neumann Two. If you want the nearest thing we have to Earth, there's Caesar's Moon, where we'd just have to double your tolerance for carbon monoxide and make you a bigger and better gorilla than the natives. Last, of course, there's always a need for muck men on Jordan's"}, {"chunk_id": "cc0c681db1a447bda048ed181919b50a__chunk_004", "distance": "0.76368964", "text": "o-called social reorientation. But if he could get out to Jordan's Planet, with his physiology adapted to the environment of that wretched world, he could study the eggs under conditions no laboratory could duplicate. He might even be able to cause trouble for Hazeltyne. His only problem would be staying alive for a year. An interview with a doctor from the Conversion Corps was required for all persons who elected changeling status. The law stated that potential changelings must be fully informed of the rights and hazards of altered shape before they signed a release. The requirement held"}]}
{"qid": "cc0c681db1a447bda048ed181919b50a_q3", "doc_id": "cc0c681db1a447bda048ed181919b50a", "question": "What happens to Tom Dorr in the story?", "chunks": [{"chunk_id": "cc0c681db1a447bda048ed181919b50a__chunk_024", "distance": "0.47680670", "text": "turned without a word and hopped feebly away from Furston. He lifted his head to breathe deeply and saw two humans watching him from an observation tower on the roof. He leaped twenty feet into the air for a closer look. Gazing at him with repugnance, after witnessing the end of his session with Furston, were Harriet Hazeltyne and general manager Tom Dorr. The girl's presence merely puzzled Asa, but Dorr's being here worried him. Dorr had tried to get rid of him once and was now in an excellent position to make the riddance permanent. At supper that night, squatting on the ground beside a"}, {"chunk_id": "cc0c681db1a447bda048ed181919b50a__chunk_038", "distance": "0.48518991", "text": "d pounds on Earth, close to six hundred here. Dorr made no move to help, but the girl reached under Kershaw's shoulder and strained to get him in. Once he was inside, Asa saw, the cabin was crowded. \"Are you going to have room for me too?\" he asked. \"Not this trip,\" Dorr answered. \"Now give me the egg.\" Asa didn't hesitate. \"The egg stays with me,\" he said softly. \"You do what I tell you, mucker,\" said Dorr. \"Nope. I want to make sure you come back.\" Asa turned his head to Harriet. \"You see, Miss Hazeltyne, I don't trust your friend. You might ask him to tell you about it.\" Dorr stared at him"}, {"chunk_id": "cc0c681db1a447bda048ed181919b50a__chunk_039", "distance": "0.52323991", "text": "ask him to tell you about it.\" Dorr stared at him with narrowed eyes. Suddenly he smiled in a way that worried Asa. \"Whatever you say, Graybar,\" Dorr said. He turned to the controls. In another minute the helicopter was in the sky. A round trip for the helicopter should have taken no more than twenty minutes, allowing time for Kershaw to be taken out at the settlement. After an hour passed Asa began to worry. He was sure Dorr would return for the egg. Finally he realized that Dorr could locate the egg approximately by the body of the dead Slider. Dorr could return for the egg any time with"}, {"chunk_id": "cc0c681db1a447bda048ed181919b50a__chunk_037", "distance": "0.56519401", "text": "gh the transparent nose Asa could see Tom Dorr and Harriet Hazeltyne. The company manager swung the door open and leaned out. \"I see you took care of the Slider,\" he said. \"Hand over the egg.\" \"Kershaw has a broken leg,\" Asa said. \"I'll help him in and then I'll get the egg.\" While Kershaw grabbed the door frame to help pull himself into the helicopter, Asa got under his companion's belly and lifted him by the waist. He hadn't realized before just how strong his new body was. Kershaw, as a muck man, would have weighed close to three hundred pounds on Earth, close to six hundred here. Dorr"}]}
{"qid": "cc0c681db1a447bda048ed181919b50a_q4", "doc_id": "cc0c681db1a447bda048ed181919b50a", "question": "What is the relationship like between Asa and Kershaw?", "chunks": [{"chunk_id": "cc0c681db1a447bda048ed181919b50a__chunk_035", "distance": "0.50773448", "text": "r and lie still. Asa took a deep breath and looked around. \"Kershaw!\" he called. \"Where are you?\" \"Over here.\" Kershaw stood briefly above the weeds and fell back again. Asa leaped over to him. \"Thanks,\" Kershaw said. \"Muck men stick together. You'll make a good one. I wouldn't have had a chance. My leg's busted.\" \"The helicopter ought to be here pretty soon,\" Asa said. He looked over at the dead Slider and shook his head. \"Tell me, what are the odds on getting killed doing this?\" \"Last time I was here there was about one mucker killed for every six eggs brought out. Of course you're not"}, {"chunk_id": "cc0c681db1a447bda048ed181919b50a__chunk_037", "distance": "0.52811551", "text": "gh the transparent nose Asa could see Tom Dorr and Harriet Hazeltyne. The company manager swung the door open and leaned out. \"I see you took care of the Slider,\" he said. \"Hand over the egg.\" \"Kershaw has a broken leg,\" Asa said. \"I'll help him in and then I'll get the egg.\" While Kershaw grabbed the door frame to help pull himself into the helicopter, Asa got under his companion's belly and lifted him by the waist. He hadn't realized before just how strong his new body was. Kershaw, as a muck man, would have weighed close to three hundred pounds on Earth, close to six hundred here. Dorr"}, {"chunk_id": "cc0c681db1a447bda048ed181919b50a__chunk_022", "distance": "0.53879315", "text": "yard a muck man bounded over to them in two leaps. Attached to a harness across his shoulders and chest were a gun and a long knife. \"Names?\" he growled. He was a foot taller than Graybar and big everywhere in proportion. \"Kershaw. I'm back, Furston.\" \"I'm Graybar.\" \"Kershaw again? Just start in where you left off, sucker. Come on, you.\" He pointed to Asa and leaped to the open portion of the courtyard. \"Do what he says,\" Kershaw whispered to Graybar. \"He's sort of a trusty and warden and parole officer rolled into one.\" Asa was put through a series of exercises to get him used to his"}, {"chunk_id": "cc0c681db1a447bda048ed181919b50a__chunk_018", "distance": "0.54135060", "text": "a deep, booming voice. \"Let's test our wings.\" It was not Kershaw's voice, but it had to be Kershaw. Asa opened his eyes. Everyone had seen pictures of muck men. It was different having one stand beside you. Kershaw looked much like an enormous frog except that his head was still mostly human. He was sitting on webbed feet, his lower legs bent double under huge thighs, and his trunk tilted forward so that his arms dangled to the ground. The arms were as thick around as an ordinary man's legs. The hands had become efficient scoops, with broad fingers webbed to the first joint and tipped with"}]}
{"qid": "cc0c681db1a447bda048ed181919b50a_q5", "doc_id": "cc0c681db1a447bda048ed181919b50a", "question": "What is the significance of the egg to the story?", "chunks": [{"chunk_id": "cc0c681db1a447bda048ed181919b50a__chunk_030", "distance": "0.54424983", "text": "e it didn't conceal an egg. As he worked, Asa kept thinking what an inefficient system it was. Everything about the operation was wrong. \"Got it!\" Kershaw shouted. He leaped out of the pit and started wiping slime off a round object the size of a baseball. Asa jumped out to watch. \"A big one,\" Kershaw said. He held it, still smeared with traces of mud, lovingly to his cheek, and then lifted it to eye level. \"Just look at it.\" A SLIDER EGG The egg was flashing with a mad radiance, like a thousand diamonds being splintered under a brilliant sun. Static crackled in Asa's earphones and he thought"}, {"chunk_id": "cc0c681db1a447bda048ed181919b50a__chunk_014", "distance": "0.54814470", "text": "beauty of a Slider's egg bothered to question its workings. For a few expectant moments there would be only random, fitful gleamings, and then there would be a wild coruscation of light, dancing from one filament to the next in a frenzy of brilliance. It took about four years for a Slider egg to die. Beauty, rarity and fading value made the eggs a luxury item like nothing the world had ever seen. If Asa had found a means of keeping them alive it would have made him wealthy at the expense of the Hazeltyne monopoly. \"You know what I think?\" Kershaw asked. \"I think those flashes are the egg"}, {"chunk_id": "cc0c681db1a447bda048ed181919b50a__chunk_013", "distance": "0.55001521", "text": "s maybe four times a day. So I stole a new one and got caught.\" Asa had held a Slider egg in his hand as he gazed into it. He could understand. The shell was clear as crystal, taut but elastic, while the albumen was just as clear around the sparkling network of organic filaments that served as a yolk. Along these interior threads played tiny flashes of lightning, part of some unexplained process of life. Electrical instruments picked up static discharges from the egg, but the phenomenon remained a mystery. Hardly anyone faced with the beauty of a Slider's egg bothered to question its"}, {"chunk_id": "cc0c681db1a447bda048ed181919b50a__chunk_040", "distance": "0.55505329", "text": "lider. Dorr could return for the egg any time with some other muck man to dig for it. Asa pulled down the mouthpiece of his radio. \"This is Graybar, calling the helicopter,\" he said. \"When are you coming?\" There was no answer except the hum of carrier wave. If he tried to carry the egg back, Asa knew, Sliders would attack him all along the way. A man had no chance of getting five miles with an egg by himself. He could leave the egg here, of course. Even so he would be lucky if he got back, following a hazy compass course from which he and Kershaw had certainly deviated on their outward trip."}]}
{"qid": "eaf675ceadd44e69b7dfe216f18d02d4_q2", "doc_id": "eaf675ceadd44e69b7dfe216f18d02d4", "question": "What relationship does Evelyn have with her father?", "chunks": [{"chunk_id": "eaf675ceadd44e69b7dfe216f18d02d4__chunk_045", "distance": "0.53140211", "text": "h! That loop of hair over her right forehead hid a scar identical to yours. I have had the individual frames analyzed!\" Evelyn's hands knotted unconsciously. She forced her body to relax, but her mind was racing. This introduced another variable to be controlled in her plan for destruction. She must make it a known quantity. \"Did your father send it to you?\" she asked. \"The day before you arrived here. It had been en route for months, of course.\" \"What did he say about it?\" \"He said, 'Your widow and son send greetings. Be of good cheer, and accept our love.' What nonsense! He knows very well"}, {"chunk_id": "eaf675ceadd44e69b7dfe216f18d02d4__chunk_038", "distance": "0.58585578", "text": "man leaning on the balustrade turned and looked at Evelyn, at first with amused contempt, then with narrowing, questioning eyes. \"Come here,\" he ordered. The Faeg dropped from her hand. With a titanic effort she activated her legs and walked toward him. He was studying her face very carefully. She felt that she was going to be sick. Her knees were so weak that she had to lean on the coping. With a forefinger he lifted up the mass of golden curls that hung over her right forehead and examined the scar hidden there, where the mentors had cut into her frontal lobe. The tiny doll they had created"}, {"chunk_id": "eaf675ceadd44e69b7dfe216f18d02d4__chunk_033", "distance": "0.61406517", "text": "oss his chest, and he studied the killer above him almost casually. But when the woman came out, their eyes met, and he started imperceptibly. Evelyn Kane felt a horrid chill creeping over her. The man's hair was white, now, and his proud face lined with deep furrows, but there could be no mistake. It was Gordon, Lord Kane. Her father. The sweat continued to grow on her forehead, and she felt for a moment that she needed only to wish hard enough, and this would be a dream. A dream of a big, kind, dark-haired man with laugh-wrinkles about his eyes, who sat her on his knee when she was a little"}, {"chunk_id": "eaf675ceadd44e69b7dfe216f18d02d4__chunk_043", "distance": "0.62303483", "text": "both of them waited in the dark, breathing rather loudly. Suddenly the center of the room was bright with a ball of light some two feet in diameter, and inside the luminous sphere were an old man, a woman, and a little boy of about four years. They were walking through a luxurious garden, and then they stopped, looked up, and waved gaily. Evelyn studied the trio with growing wonder. The old man and the boy were complete strangers. But the woman—! \"That is Phaen, my father,\" said Perat quietly. \"He stayed at home because he hated war. And that is a path in our country estate on Tharn-R-VII."}]}
{"qid": "eaf675ceadd44e69b7dfe216f18d02d4_q3", "doc_id": "eaf675ceadd44e69b7dfe216f18d02d4", "question": "What tricks does Evelyn use to stay alive and free?", "chunks": [{"chunk_id": "eaf675ceadd44e69b7dfe216f18d02d4__chunk_038", "distance": "0.51057935", "text": "man leaning on the balustrade turned and looked at Evelyn, at first with amused contempt, then with narrowing, questioning eyes. \"Come here,\" he ordered. The Faeg dropped from her hand. With a titanic effort she activated her legs and walked toward him. He was studying her face very carefully. She felt that she was going to be sick. Her knees were so weak that she had to lean on the coping. With a forefinger he lifted up the mass of golden curls that hung over her right forehead and examined the scar hidden there, where the mentors had cut into her frontal lobe. The tiny doll they had created"}, {"chunk_id": "eaf675ceadd44e69b7dfe216f18d02d4__chunk_018", "distance": "0.54223299", "text": "g information.\" So that was it. Buy her freedom by betraying fugitive Terrans. Well, he could take the information and then kill her. He nodded curtly to the guards, and they walked out of the hut, exchanging sly winks with one another. Evelyn Kane crossed her arms across her chest and felt her broken rib gingerly. The inquisitor stared up at her in sadistic admiration. He would certainly be on hand for the execution. His anticipation was cut short with a horrible realization. Under the paralyzing force of a mind greater than his own, he reached beneath the desk and switched off the recorder."}, {"chunk_id": "eaf675ceadd44e69b7dfe216f18d02d4__chunk_023", "distance": "0.57008404", "text": "ories high, reasonably intact. She walked off down the gravel path, which was stained here and there with dark sticky red. She gave her visa to the guard at the door and was admitted to an improvised waiting room, where another guard eyed her stonily. The firing was much nearer. She recognized the obscene coughs of a Faeg pistol and began to feel sick. A woman in the green uniform of the Scythe auxiliary came in, whispered something to the guard, and then told Evelyn to follow her. In the anteroom a grey cat looked her over curiously, and Evelyn frowned. She might have to get rid of the cat"}, {"chunk_id": "eaf675ceadd44e69b7dfe216f18d02d4__chunk_048", "distance": "0.59967828", "text": "r disposition of a woman prisoner.\" Evelyn's heart skipped a beat. \"Indeed?\" \"The wretch insists that he could remember if we would just let him alone. I suppose he took a bribe. You'll find one now and then who tries for a little extra profit.\" She must absolutely not be seen by the condemned inquisitor. The stimulus would almost certainly make him remember. \"I'll wait for you,\" she said indifferently, thrusting her arms out in a languorous yawn. \"Very well.\" Perat stepped to the door, then turned and looked back at her. \"On the other hand, I may need a clerk. It's way after hours, and the"}]}
{"qid": "eaf675ceadd44e69b7dfe216f18d02d4_q4", "doc_id": "eaf675ceadd44e69b7dfe216f18d02d4", "question": "What is the significance of the device given to Evelyn not exploding?", "chunks": [{"chunk_id": "eaf675ceadd44e69b7dfe216f18d02d4__chunk_038", "distance": "0.60056305", "text": "man leaning on the balustrade turned and looked at Evelyn, at first with amused contempt, then with narrowing, questioning eyes. \"Come here,\" he ordered. The Faeg dropped from her hand. With a titanic effort she activated her legs and walked toward him. He was studying her face very carefully. She felt that she was going to be sick. Her knees were so weak that she had to lean on the coping. With a forefinger he lifted up the mass of golden curls that hung over her right forehead and examined the scar hidden there, where the mentors had cut into her frontal lobe. The tiny doll they had created"}, {"chunk_id": "eaf675ceadd44e69b7dfe216f18d02d4__chunk_007", "distance": "0.61626172", "text": "she worked herself out of the crumpled bed and lay on the floor of her little cubicle, panting and holding her chest with both hands. The metal floor was very cold. Evidently the enemy torpedo fissionables had finally broken through to the center portions of the ship, letting in the icy breath of space. Small matter. Not by freezing would she die. She reached out her hand, felt for the all-important key, and gasped in dismay. The mahogany box containing the key had burst its metal bonds and was lying on its side. The explosion that had crushed her cubicle had been terrific. With a gurgle of"}, {"chunk_id": "eaf675ceadd44e69b7dfe216f18d02d4__chunk_018", "distance": "0.63248450", "text": "g information.\" So that was it. Buy her freedom by betraying fugitive Terrans. Well, he could take the information and then kill her. He nodded curtly to the guards, and they walked out of the hut, exchanging sly winks with one another. Evelyn Kane crossed her arms across her chest and felt her broken rib gingerly. The inquisitor stared up at her in sadistic admiration. He would certainly be on hand for the execution. His anticipation was cut short with a horrible realization. Under the paralyzing force of a mind greater than his own, he reached beneath the desk and switched off the recorder."}, {"chunk_id": "eaf675ceadd44e69b7dfe216f18d02d4__chunk_045", "distance": "0.63374853", "text": "h! That loop of hair over her right forehead hid a scar identical to yours. I have had the individual frames analyzed!\" Evelyn's hands knotted unconsciously. She forced her body to relax, but her mind was racing. This introduced another variable to be controlled in her plan for destruction. She must make it a known quantity. \"Did your father send it to you?\" she asked. \"The day before you arrived here. It had been en route for months, of course.\" \"What did he say about it?\" \"He said, 'Your widow and son send greetings. Be of good cheer, and accept our love.' What nonsense! He knows very well"}]}
{"qid": "eaf675ceadd44e69b7dfe216f18d02d4_q5", "doc_id": "eaf675ceadd44e69b7dfe216f18d02d4", "question": "How is the theme of duty explored in this story?", "chunks": [{"chunk_id": "eaf675ceadd44e69b7dfe216f18d02d4__chunk_035", "distance": "0.64862096", "text": "d especially the prisoners. A task so revolting he could not relegate to his own officers. He must do it himself, but he wanted his underlings to know he loathed them for it. She was merely a symbol of that contempt. His next words did not surprise her. \"It is even more stimulating to require a shuddering female to kill them. You are shuddering you know?\" She nodded dumbly. Her palm was so wet that a drop of sweat dropped from it to the floor. She was thinking hard. She could kill the Commandant and save her father for a little while. But then the problem of detonating the pile remained, and"}, {"chunk_id": "eaf675ceadd44e69b7dfe216f18d02d4__chunk_034", "distance": "0.65023756", "text": "yes, who sat her on his knee when she was a little girl and read bedtime stories to her from a great book with many pictures. An icy, amused voice came through: \"Our orders are to kill all prisoners. It is entertaining to shoot down helpless men, isn't it? It warms me to know that I am cruel and wanton, and worthy of my trust.\" Even in the midst of her horror, a cold, analytical part of her was explaining why the Commandant had called her to the balcony. Because all captured Terrans had to be killed, he hated his superiors, his own men, and especially the prisoners. A task so revolting he"}, {"chunk_id": "eaf675ceadd44e69b7dfe216f18d02d4__chunk_031", "distance": "0.68654168", "text": "rrior turned to boring paper work. His closely cut black hair and the two sparkling red-gemmed rings—apparently identical—on his right hand seemed to denote a certain fastidiousness and unconscious superiority. To Evelyn the jeweled fingers bespoke an unnatural contrast to the past history of the man and were symptomatic of a personality that could find stimulation only in strange and cruel pleasures. In alarm she suddenly realized that she had inadvertently let her appraisal penetrate her uncovered conscious mind, and that this probe was there awaiting it. \"You are right,\" he said coldly,"}, {"chunk_id": "eaf675ceadd44e69b7dfe216f18d02d4__chunk_047", "distance": "0.71288848", "text": "why should I want two of them?\" Evelyn crossed the room and returned the ring. \"Existence is so full of mysteries, isn't it?\" murmured Perat. \"Sometimes it seems unfortunate that we must pass through a sentient phase on our way to death. This foolish, foolish war. Maybe the old count was right.\" \"You could be courtmartialed for that.\" \"Speaking of courtmartials, I've got to attend one tonight—an appeal from a death sentence.\" He arose, smoothed his hair and clothes, and poured another glass of terif . \"Some fool inquisitor can't show proper disposition of a woman prisoner.\" Evelyn's heart"}]}
{"qid": "7b3118cb48ce48b2b9cbc84747a8022c_q2", "doc_id": "7b3118cb48ce48b2b9cbc84747a8022c", "question": "Describe the setting of the story.", "chunks": [{"chunk_id": "7b3118cb48ce48b2b9cbc84747a8022c__chunk_003", "distance": "0.63720322", "text": "e horizon. This wasn't the California desert! Down the hill, where the liquid oxygen plant ought to have been, a river wound across the scene, almost hidden beneath its leafy roof of huge ancient trees. Shock contracted Maitland's diaphragm and spread through his body. His breathing quickened. Now he remembered what had happened during the night, the sound in the darkness, the dimly seen figure, and then—what? Blackout.... Where was he? Who had brought him here? For what purpose? He thought he knew the answer to the last of those questions. As a member of the original atomic reaction-motor"}, {"chunk_id": "7b3118cb48ce48b2b9cbc84747a8022c__chunk_001", "distance": "0.64420885", "text": "f his bed. Outside, the residential section of the Reservation slept silently under the pale illumination of the full Moon. He guessed sleepily that it was about three o'clock. What had he heard? He had a definite impression that the sound had come from within the room. It had sounded like someone stumbling into a chair, or— Something moved in the darkness on the other side of the room. Maitland started to sit up and it was as though a thousand volts had shorted his brain.... This time, he awoke more normally. He opened his eyes, looked through the window at a section of azure sky, listened"}, {"chunk_id": "7b3118cb48ce48b2b9cbc84747a8022c__chunk_023", "distance": "0.64945495", "text": "below the horizon, and tried to think of a region that had this kind of terrain. That prairie out there was unique. Almost anywhere in the world, land like that would be cultivated, not allowed to go to grass. This might be somewhere in Africa.... He shook his head, puzzled. The Sun disappeared and its blood-hued glow began to fade from the sky. Maitland sat there, trying to get hold of the problem from an angle where it wouldn't just slip away. After a while the western sky became a screen of clear luminous blue, a backdrop for a pure white brilliant star. As always at that sight, Maitland"}, {"chunk_id": "7b3118cb48ce48b2b9cbc84747a8022c__chunk_041", "distance": "0.65969539", "text": "en there, and what I've seen of this world looks a lot better.\" She shrugged. \"Swarts says that I want to go back to the Dark Age of Technology because I have not adapted well to modern culture. Myself, I think I have just a romantic nature. Far times and places look more exciting....\" \"How do you mean—\" Maitland wrinkled his brow—\"adapt to modern culture? Don't tell me you're from another time!\" \"Oh, no! But my home is Aresund, a little fishing village at the head of a fiord in what you would call Norway. So far north, we are much behind the times. We live in the old way, from the sea, speak"}]}
{"qid": "7b3118cb48ce48b2b9cbc84747a8022c_q3", "doc_id": "7b3118cb48ce48b2b9cbc84747a8022c", "question": "What is the significance of space in the story?", "chunks": [{"chunk_id": "7b3118cb48ce48b2b9cbc84747a8022c__chunk_047", "distance": "0.57251251", "text": "her head, bewildered. \"I always thought that would be a tough problem to crack,\" he agreed. \"But tell me about what men are doing in the Solar System. How is life on Mars and Venus, and how long does it take to get to those places?\" He waited, expectantly silent, but she only looked puzzled. \"I don't understand. Mars? What are Mars?\" After several seconds, Maitland swallowed. Something seemed to be the matter with his throat, making it difficult for him to speak. \"Surely you have space travel?\" She frowned and shook her head. \"What does that mean—space travel?\" He was gripping the edge of the"}, {"chunk_id": "7b3118cb48ce48b2b9cbc84747a8022c__chunk_048", "distance": "0.58959252", "text": "ean—space travel?\" He was gripping the edge of the bed now, glaring at her. \"A civilization that could discover time travel and build robot factories wouldn't find it hard to send a ship to Mars!\" \"A ship ? Oh, you mean something like a vliegvlotter . Why, no, I don't suppose it would be hard. But why would anyone want to do a thing like that?\" He was on his feet towering over her, fists clenched. She raised her arms as if to shield her face if he should hit her. \"Let's get this perfectly clear,\" he said, more harshly than he realized. \"So far as you know, no one has ever visited the planets,"}, {"chunk_id": "7b3118cb48ce48b2b9cbc84747a8022c__chunk_019", "distance": "0.60846090", "text": "ading what you term science fiction. Maitland, how would you like to go to the Moon ?\" Something eager leaped in Maitland's breast at the abrupt question, and he tried to turn his head. Then he forced himself to relax. \"What do you mean?\" Swarts was chuckling. \"I really hit a semantic push-button there, didn't I? Maitland, I brought you here because you're a man who wants to go to the Moon. I'm interested in finding out why .\" In the evening a girl brought Maitland his meal. As the door slid aside, he automatically stood up, and they stared at each other for several seconds. She had the high"}, {"chunk_id": "7b3118cb48ce48b2b9cbc84747a8022c__chunk_053", "distance": "0.62137008", "text": "hat I belong here, although the people of the town have accepted me as one of them.\" \"Even,\" he said, \"granting that you have solved the population problem, there's still the adventure of the thing. Surely, somewhere, there must be men who still feel that.... Ingrid, doesn't it fire something in your blood, the idea of going to Mars—just to go there and see what's there and walk under a new sky and a smaller Sun? Aren't you interested in finding out what the canals are? Or what's under the clouds of Venus? Wouldn't you like to see the rings of Saturn from, a distance of only two hundred"}]}
{"qid": "7b3118cb48ce48b2b9cbc84747a8022c_q4", "doc_id": "7b3118cb48ce48b2b9cbc84747a8022c", "question": "What is the relationship between Maitland and Ching throughout the story?", "chunks": [{"chunk_id": "7b3118cb48ce48b2b9cbc84747a8022c__chunk_037", "distance": "0.42275965", "text": "ed from his eyes and Swarts was standing over him, white-lipped. Maitland swore at him for a few seconds, then relaxed and smiled weakly. His head was starting to ache from the effort of blinking. \"What year is this?\" he asked. \"All right,\" Swarts said. \"A.D. 2634.\" Maitland's smile became a grin. \"I really haven't the time to waste talking irrelevancies,\" Swarts said a while later. \"Honestly. Maitland, I'm working against a time limit. If you'll cooperate, I'll tell Ching to answer your questions.\"' \"Ching?\" \"Ingrid Ching is the girl who has been bringing you your meals.\" Maitland considered"}, {"chunk_id": "7b3118cb48ce48b2b9cbc84747a8022c__chunk_019", "distance": "0.56985879", "text": "ading what you term science fiction. Maitland, how would you like to go to the Moon ?\" Something eager leaped in Maitland's breast at the abrupt question, and he tried to turn his head. Then he forced himself to relax. \"What do you mean?\" Swarts was chuckling. \"I really hit a semantic push-button there, didn't I? Maitland, I brought you here because you're a man who wants to go to the Moon. I'm interested in finding out why .\" In the evening a girl brought Maitland his meal. As the door slid aside, he automatically stood up, and they stared at each other for several seconds. She had the high"}, {"chunk_id": "7b3118cb48ce48b2b9cbc84747a8022c__chunk_018", "distance": "0.57991451", "text": "ou are thirty-four years old. You are an engineer, specialty heat transfer, particularly as applied to rocket motors.... No, Mr. Maitland, I'm not going to question you about your work; just forget about it. Your home town is Madison, Wisconsin....\" \"You seem to know everything about me,\" Maitland said defiantly, looking up into the hanging forest of cabling. \"Why this recital?\" \"I do not know everything about you—yet. And I'm testing the equipment, calibrating it to your reactions.\" He went on, \"Your favorite recreations are chess and reading what you term science fiction. Maitland, how"}, {"chunk_id": "7b3118cb48ce48b2b9cbc84747a8022c__chunk_010", "distance": "0.58965695", "text": "clad in gray trunks and sandals, stood across the threshold looking in at him. Maitland stood up and stared back, conscious suddenly that in his rumpled pajamas he made an unimpressive figure. The fellow looked about forty-five. The first details Maitland noticed were the forehead, which was quite broad, and the calm, clear eyes. The dark hair, white at the temples, was combed back, still damp from swimming. Below, there was a wide mouth and a firm, rounded chin. This man was intelligent, Maitland decided, and extremely sure of himself. Somehow, the face didn't go with the rest of him. The"}]}
{"qid": "7b3118cb48ce48b2b9cbc84747a8022c_q5", "doc_id": "7b3118cb48ce48b2b9cbc84747a8022c", "question": "What kinds of gadgets and machinery are used by Swarts in the story?", "chunks": [{"chunk_id": "7b3118cb48ce48b2b9cbc84747a8022c__chunk_036", "distance": "0.48979551", "text": "s of Swarts in standing by his silly rules and not telling him about this new world. Within a minute, he was in an ungovernable rage. His muscles tightened against the restraining straps. He panted, sweat came out on his forehead, and he began to curse. Swarts! How he hated.... The scene was suddenly a flock of sheep spread over a green hillside. There was blood hammering in Maitland's temples. His face felt hot and swollen and he writhed against the restraint of the straps. The scene disappeared, the lenses of the projector retreated from his eyes and Swarts was standing over him,"}, {"chunk_id": "7b3118cb48ce48b2b9cbc84747a8022c__chunk_022", "distance": "0.50119448", "text": "re was he? Who was Swarts? What was the purpose of the \"tests\" he was being given? It was possible, of course, that this was all an elaborate scheme for getting military secrets, despite Swarts' protestations to the contrary. Maitland frowned. This place certainly didn't have the appearance of a military establishment, and so far there had been nothing to suggest the kind of interrogation to be expected from foreign intelligence officers. It might be better to tackle the first question first. He looked at the Sun, a red spheroid already half below the horizon, and tried to think of a region"}, {"chunk_id": "7b3118cb48ce48b2b9cbc84747a8022c__chunk_045", "distance": "0.54990774", "text": "killing-machines, produced in robot factories from robot-mined ores.... Very clever.\" She gave a little shudder. \"And yet they founded modern civilization,\" she added. \"The grandsons of the technicians who built the Machine Army set up our robot production system, and today no human being has to dirty his hands raising food or manufacturing things. It could never have been done, either, before the population was—reduced to three hundred million.\" \"Then the Afrikanders are still on top? Still the masters?\" She shook her head. \"There are no more Afrikanders.\" \"Rebellion?\" \"No. Intermarriage."}, {"chunk_id": "7b3118cb48ce48b2b9cbc84747a8022c__chunk_055", "distance": "0.55151916", "text": "ou grew up in the Age of Technology. Everybody was terribly excited about what could be done with machines—machines to blow up a city all at once, or fly around the world, or take a man to Mars. We have had our fill of—what is the word?—gadgets. Our machines serve us, and so long as they function right, we are satisfied to forget about them. \"Because this is the Age of Man . We are terribly interested in what can be done with people. Our scientists, like Swarts, are studying human rather than nuclear reactions. We are much more fascinated by the life and death of cultures than by the"}]}
{"qid": "d66eb3f2a6ba492a999110101fcc9b07_q2", "doc_id": "d66eb3f2a6ba492a999110101fcc9b07", "question": "Who is Linda, and what is her significance in the story?", "chunks": [{"chunk_id": "d66eb3f2a6ba492a999110101fcc9b07__chunk_002", "distance": "0.52501136", "text": "o'clock,\" she'd said, smiling sweetly at me out of the phone. She knew why I wanted to talk to her. And when Linda said ten o'clock, she meant ten o'clock. Don't get me wrong. I don't mean that Linda's a perfectionist or a harridan or anything like that. Far from it. But she does have a fixation on that one subject of punctuality. The result of her job, of course. She was an ore-sled dispatcher. Ore-sleds, being robots, were invariably punctual. If an ore-sled didn't return on time, no one waited for it. They simply knew that it had been captured by some other Project and had blown itself up."}, {"chunk_id": "d66eb3f2a6ba492a999110101fcc9b07__chunk_003", "distance": "0.52881628", "text": "red by some other Project and had blown itself up. Well, of course, after working as an ore-sled dispatcher for three years, Linda quite naturally was a bit obsessed. I remember one time, shortly after we'd started dating, when I arrived at her place five minutes late and found her having hysterics. She thought I'd been killed. She couldn't visualize anything less than that keeping me from arriving at the designated moment. When I told her what actually had happened—I'd broken a shoe lace—she refused to speak to me for four days. And then the elevator didn't come. Until then, I'd managed"}, {"chunk_id": "d66eb3f2a6ba492a999110101fcc9b07__chunk_027", "distance": "0.57025433", "text": "tial enemies were on the other side of them. I sat shaken, digesting this news, until suddenly I remembered Linda. I leaped to my feet, reading from my watch that it was now ten-fifteen. I dashed once more from the apartment and down the hall to the elevator, praying that the spy had been captured by now and that Linda would agree with me that a spy in the elevator was good and sufficient reason for me to be late. He was still there. At least, the elevator was still out. I sagged against the wall, thinking dismal thoughts. Then I noticed the door to the right of the elevator. Through that"}, {"chunk_id": "d66eb3f2a6ba492a999110101fcc9b07__chunk_007", "distance": "0.58262378", "text": "n. Linda lived down on the hundred fortieth floor, thirteen stories away. It never took more than two or three minutes to get to her place, so I was giving myself plenty of time. But then the elevator didn't come. I pushed the button, waited, and nothing happened. I couldn't understand it. The elevator had always arrived before, within thirty seconds of the button being pushed. This was a local stop, with an elevator that traveled between the hundred thirty-third floor and the hundred sixty-seventh floor, where it was possible to make connections for either the next local or for the express."}]}
{"qid": "d66eb3f2a6ba492a999110101fcc9b07_q3", "doc_id": "d66eb3f2a6ba492a999110101fcc9b07", "question": "Describe the physical and social settings of the story.", "chunks": [{"chunk_id": "d66eb3f2a6ba492a999110101fcc9b07__chunk_019", "distance": "0.73519158", "text": "he state of siege in which we all lived had had no reality for me. The Project, after all, was self-sufficient and completely enclosed. No one ever left, no one ever entered. Under our roof, we were a nation, two hundred stories high. The ever-present threat of other projects had never been more for me—or for most other people either, I suspected—than occasional ore-sleds that didn't return, occasional spies shot down as they tried to sneak into the building, occasional spies of our own leaving the Project in tiny radiation-proof cars, hoping to get safely within another project and bring"}, {"chunk_id": "d66eb3f2a6ba492a999110101fcc9b07__chunk_037", "distance": "0.74065506", "text": "I have never in my life seen that long hall quite so empty as it was right then. No one came out of any of the apartments, no one emerged from any of the branch halls. We walked to my apartment. I thumbed the door open and we went inside. Once the door was closed behind us, he visibly relaxed, sagging against the door, his gun hand hanging limp at his side, a nervous smile playing across his lips. I looked at him, judging the distance between us, wondering if I could leap at him before he could bring the gun up again. But he must have read my intentions on my face. He straightened, shaking"}, {"chunk_id": "d66eb3f2a6ba492a999110101fcc9b07__chunk_042", "distance": "0.74481207", "text": "that?\" He frowned bitterly. \"The same answer,\" he muttered, more to himself than to me. \"The same answer every time. You people have crawled into your caves and you're ready to stay in them forever.\" I looked around at my apartment. \"Rather a well-appointed cave,\" I told him. \"But a cave nevertheless.\" He leaned toward me, his eyes gleaming with a fanatical flame. \"Don't you ever wish to get Outside?\" Incredible! I nearly poured boiling water all over myself. \"Outside? Of course not!\" \"The same thing,\" he grumbled, \"over and over again. Always the same stupidity. Listen, you! Do you realize"}, {"chunk_id": "d66eb3f2a6ba492a999110101fcc9b07__chunk_036", "distance": "0.74592823", "text": "his questions promptly, cooperating with him until and unless I saw a chance to either escape or capture him. \"All right,\" he whispered. \"Go on.\" He prodded me with the gun. And so we went back up the stairs to one fifty-three, and stopped at the door. He stood close behind me, the gun pressed against my back, and grated in my ear, \"I'll have this gun in my pocket. If you make one false move I'll kill you. Now, we're going to your apartment. We're friends, just strolling along together. You got that?\" I nodded. \"All right. Let's go.\" We went. I have never in my life seen that long hall quite"}]}
{"qid": "d66eb3f2a6ba492a999110101fcc9b07_q4", "doc_id": "d66eb3f2a6ba492a999110101fcc9b07", "question": "What is the significance of the spy in the elevator?", "chunks": [{"chunk_id": "d66eb3f2a6ba492a999110101fcc9b07__chunk_016", "distance": "0.31234670", "text": "t of the matter is—\" she leaned even closer to the screen—\"there's a spy in the elevator.\" II It was my turn to be stunned. I just gaped at her. \"A—a what?\" \"A spy. He was discovered on the hundred forty-seventh floor, and managed to get into the elevator before the Army could catch him. He jammed it between floors. But the Army is doing everything it can think of to get him out.\" \"Well—but why should there be any problem about getting him out?\" \"He plugged in the manual controls. We can't control the elevator from outside at all. And when anyone tries to get into the shaft, he aims the"}, {"chunk_id": "d66eb3f2a6ba492a999110101fcc9b07__chunk_032", "distance": "0.41522336", "text": "possible answers flashed through my mind. The more recent maps might simply have omitted this discarded and unnecessary door. It might be sealed shut on the other side. The Army might have caught the spy already. Somebody in authority might simply have goofed. As I stood there, pondering these possibilities, the door opened and the spy came out, waving a gun. III He couldn't have been anyone else but the spy. The gun, in the first place. The fact that he looked harried and upset and terribly nervous, in the second place. And, of course, the fact that he came from the elevator shaft. Looking"}, {"chunk_id": "d66eb3f2a6ba492a999110101fcc9b07__chunk_018", "distance": "0.44447744", "text": "r right, suddenly straightened up again, and said, \"We-will-resume-service-as-soon-as-possible.\" Click. Blank screen. For a minute or two, all I could do was sit and absorb what I'd been told. A spy in the elevator! A spy who had managed to work his way all the way up to the hundred forty-seventh floor before being unmasked! What in the world was the matter with the Army? If things were getting that lax, the Project was doomed, force-screen or no. Who knew how many more spies there were in the Project, still unsuspected? Until that moment, the state of siege in which we all lived had had no"}, {"chunk_id": "d66eb3f2a6ba492a999110101fcc9b07__chunk_027", "distance": "0.45577443", "text": "tial enemies were on the other side of them. I sat shaken, digesting this news, until suddenly I remembered Linda. I leaped to my feet, reading from my watch that it was now ten-fifteen. I dashed once more from the apartment and down the hall to the elevator, praying that the spy had been captured by now and that Linda would agree with me that a spy in the elevator was good and sufficient reason for me to be late. He was still there. At least, the elevator was still out. I sagged against the wall, thinking dismal thoughts. Then I noticed the door to the right of the elevator. Through that"}]}
{"qid": "d66eb3f2a6ba492a999110101fcc9b07_q5", "doc_id": "d66eb3f2a6ba492a999110101fcc9b07", "question": "Who is Edmund Rice, and what happens to him in the story?", "chunks": [{"chunk_id": "d66eb3f2a6ba492a999110101fcc9b07__chunk_011", "distance": "0.63683265", "text": "to register a complaint so loud they'd be able to hear me in sub-basement three. I got some more letters that spelled: BUSY. It took three tries before I got through to a hurried-looking female receptionist \"My name is Rice!\" I bellowed. \"Edmund Rice! I live on the hundred and fifty-third floor! I just rang for the elevator and——\" \"The-elevator-is-disconnected.\" She said it very rapidly, as though she were growing very used to saying it. It only stopped me for a second. \"Disconnected? What do you mean disconnected? Elevators don't get disconnected!\" I told her."}, {"chunk_id": "d66eb3f2a6ba492a999110101fcc9b07__chunk_035", "distance": "0.71048927", "text": "ered, \"Where do they go?\" I had to clear my throat before I could speak. \"All the way down,\" I said. \"Good,\" he said—just as we both heard a sudden raucous squealing from perhaps four flights down, a squealing which could be nothing but the opening of a hall door. It was followed by the heavy thud of ascending boots. The Army! But if I had any visions of imminent rescue, the spy dashed them. He said, \"Where do you live?\" \"One fifty-three,\" I said. This was a desperate and dangerous man. I knew my only slim chance of safety lay in answering his questions promptly, cooperating with him until"}, {"chunk_id": "d66eb3f2a6ba492a999110101fcc9b07__chunk_052", "distance": "0.72780859", "text": "\" he cried. \"Like you? Like me? Like all the other people in this mausoleum?\" \"Now, wait a minute—\" \"No!\" he shouted. \"You wait a minute! I want to tell you something. You think I'm a spy. That blundering Army of yours thinks I'm a spy. That fathead who turned me in thinks I'm a spy. But I'm not a spy, and I'm going to tell you what I am.\" I waited, looking as attentive as possible. \"I come,\" he said, \"from a Project about eighty miles north of here. I came here by foot, without any sort of radiation shield at all to protect me.\" The maniac was back. I didn't say a word. I didn't want to set"}, {"chunk_id": "d66eb3f2a6ba492a999110101fcc9b07__chunk_039", "distance": "0.74480063", "text": "s.\" \"Make me a cup. And don't get any bright ideas about dousing me with boiling water.\" \"I only have my day's allotment,\" I protested. \"Just enough for two cups, lunch and dinner.\" \"Two cups is fine,\" he said. \"One for each of us.\" And now I had yet another grudge against this blasted spy. Which reminded me again of Linda. From the looks of things, I wasn't ever going to get to her place. By now she was probably in mourning for me and might even have the Sanitation Staff searching for my remains. As I made the chico, he asked me questions. My name first, and then, \"What do you do for a"}]}
{"qid": "ba58d75c003a4653a5b299a75b17ab78_q2", "doc_id": "ba58d75c003a4653a5b299a75b17ab78", "question": "What is the reason and development of the conflict between the Captain and Quade?", "chunks": [{"chunk_id": "ba58d75c003a4653a5b299a75b17ab78__chunk_022", "distance": "0.48388451", "text": "tinued earnestly, \"these men aren't going to think of me—of us , the officers, as their leaders. As far as the crew is concerned, Ordinary Spaceman Quade is the best man on this ship.\" \"He is a good man,\" Nagurski said. \"You mustn't be jealous of his status.\" The dog growled. He must have sensed what I almost did to Nagurski. \"Never mind that for now,\" I said wearily. \"What was your idea for getting our exploration parties through this transphasia?\" \"There's only one idea for that,\" said Quade, ducking his long head and stepping through the connecting hatch. \"With the Captain's"}, {"chunk_id": "ba58d75c003a4653a5b299a75b17ab78__chunk_003", "distance": "0.49851221", "text": "n wrong, Captain. Traditionally, alien races never interfere with our explorations. Generally, they are so alien to us they can't even recognize our existence.\" I drew myself up to my full height—and noticed in irritation it was still an inch less than Quade's. \"I don't understand you men. Look at yourself, Quade. You've been busted to Ordinary Spaceman for just that kind of thinking, for relying on tradition, on things that have worked before. Not only your thinking is slipshod, you've grown careless about everything else, even your own life.\" \"Just a minute, Captain. I've never been"}, {"chunk_id": "ba58d75c003a4653a5b299a75b17ab78__chunk_031", "distance": "0.50829744", "text": "oration made a man a reckless fool by doing things on one planet he had once found safe and wise on some other world. The thought intruded itself: why hadn't I recognized this before I let Quade escape to almost certain death? Wasn't it because I wanted him dead, because I resented the crew's resentment of my authority, and recognized in him the leader and symbol of this resentment? I threw away that idea along with my half-used cigarette. It might very well be true, but how did that help now? I had to think . I was going after him, that was certain. Not only for humane reasons—he was the"}, {"chunk_id": "ba58d75c003a4653a5b299a75b17ab78__chunk_056", "distance": "0.52689505", "text": "e worlds, most worlds, but not good on all worlds. I'm never going to be that foolhardy again.\" \"But you're losing confidence , Quade! You aren't sure of yourself any more. Isn't confidence a spaceman's most valuable asset?\" \"The hell it is,\" Quade said grimly. \"It's his deadliest liability.\" \"In that case, I must inform you that I am demoting you to Acting Executive Officer.\" \"Huh?\" Quade gawked. \"But dammit, Captain, you can't do that to me! I'll lose hazard pay and be that much further from retirement!\" \"That's tough,\" I sympathized, \"but in every service a chap gets broken in rank now and"}]}
{"qid": "ba58d75c003a4653a5b299a75b17ab78_q3", "doc_id": "ba58d75c003a4653a5b299a75b17ab78", "question": "What is the difference in Gavin's and Nagurski's attitudes?", "chunks": [{"chunk_id": "ba58d75c003a4653a5b299a75b17ab78__chunk_017", "distance": "0.63348395", "text": "ldn't live long enough to get used to it.\" He said nothing on the route back to the spacer. \"I know all about this sort of thing, Gav,\" First Officer Nagurski said expansively. He was rubbing the well-worn ears of our beagle mascot, Bruce. A heavy tail thudded on the steel deck from time to time. My finger could barely get in the chafing band of my regulation collar. I was hot and tired, fresh—in only the chronological sense—from a pressure suit. \"What do you know all about, Nagurski? Dogs? Spacemen? Women? Transphasia?\" \"Yes,\" he answered casually. \"But I had immediate reference to our"}, {"chunk_id": "ba58d75c003a4653a5b299a75b17ab78__chunk_021", "distance": "0.64595366", "text": "boys; they know what they are doing. You can rely on them absolutely.\" I leaned forward, elbows on knees. \"Let me tell you a thing, Nagurski. Your trust of these damn-fool spacemen is why you are no longer a captain. You can't trust anything out here in space, much less human nature. Even I know that much!\" He was pained. \"If you don't trust the men, they won't trust you, Gav.\" \"They don't have to trust me. All they have to do is obey me or, by Jupiter, get frozen stiff and thawed out just in time for court-marshal back home. Listen,\" I continued earnestly, \"these men aren't going to think"}, {"chunk_id": "ba58d75c003a4653a5b299a75b17ab78__chunk_020", "distance": "0.66068280", "text": "to laugh. \"I've been in space a good many years. I really wanted to relax a little bit more. Besides, the increase in hazard pay was actually more than my salary as a captain. I'm a notch nearer retirement too.\" \"Tell me, did you always feel this way about letting the men select their own leader?\" Nagurski brought out a pipe. He would have a pipe, I decided. \"No, not always. I was like you at first. Fresh from the cosmic energy test lab, suspicious of everything, trying to tell the old hands what to do. But I learned that they are pretty smart boys; they know what they are doing. You can rely"}, {"chunk_id": "ba58d75c003a4653a5b299a75b17ab78__chunk_043", "distance": "0.66263986", "text": "g, chunk-style Hershey bar. I was thankful for the invigorating Sousa march blasting inside my helmet. Before the tape had cut in, kicked on by the decibel gauge, I had heard or felt something dark and ominous in the outside air. \"Yes, this is definitely the trail of Quail,\" Nagurski said soberly. \"This is serious business. I must ask whoever has been giggling on this channel to shut up. Pardon me, Captain. You weren't giggling, sir?\" \"I have never giggled in my life, Nagurski.\" \"Yes, sir. That's what we all thought.\" A moment later, Nagurski added, \"Anyway, I just noticed it was my shelf—my,"}]}
{"qid": "ba58d75c003a4653a5b299a75b17ab78_q4", "doc_id": "ba58d75c003a4653a5b299a75b17ab78", "question": "What happens to Quade throughout the story?", "chunks": [{"chunk_id": "ba58d75c003a4653a5b299a75b17ab78__chunk_057", "distance": "0.50381160", "text": "n every service a chap gets broken in rank now and then.\" \"Maybe it's worth it,\" Quade said heavily. \"Now maybe I've learned how to stay alive out here. I just hope I don't forget.\" I thought about that. I was nearly through with my first mission and I could speak with experience, even if it was the least amount of experience aboard. \"Quade,\" I said, \"space isn't as dangerous as all that.\" I clapped him on the shoulder fraternally. \"You worry too much!\""}, {"chunk_id": "ba58d75c003a4653a5b299a75b17ab78__chunk_032", "distance": "0.51525462", "text": "as certain. Not only for humane reasons—he was the most important member of the crew. With him around, there were only two opinions, his and mine. Without him, I'd have endless opinions to contend with. But it wouldn't do any good to go out no better equipped than he. There was no time to wait for tractors to be built if we wanted to reach him alive, and we certainly couldn't reach him five or ten miles out with our three miles of safety line. We would have to go in spacesuits. But how would that leave us any better off than Quade? Why was Quade vulnerable in his spacesuit, as I knew from"}, {"chunk_id": "ba58d75c003a4653a5b299a75b17ab78__chunk_014", "distance": "0.51676106", "text": "re a small, sharp pain dug in and dwindled down to nothing in one long second. The new odor pattern in my head told me Quade was saying something I couldn't quite make out. Quade then pulled me in the direction of the nasty little pain. \"Wait a minute, Spaceman!\" I bellowed. \"Where the devil do you think you're dragging me? Halt! That's a direct order.\" He stopped. \"Don't you want to find out what that was? This is an exploration party, you know, sir.\" \"I'm not sure I do want to find out what that was just now. I didn't like the feel of it. But the important thing is for us not to get any"}, {"chunk_id": "ba58d75c003a4653a5b299a75b17ab78__chunk_045", "distance": "0.52012634", "text": ". A man in a spacesuit, faceplate in the dust, two hundred yards ahead. Grudgingly I stepped forward, out of the shadow of the ridge. A hysterically screaming wind rocked me on my toes. We pushed on sluggishly to Quade's side, moving to the tempo of Pomp and Circumstance . Farley lugged Quade over on his back and read his gauges. The Quartermaster rose with grim deliberation, and hiccuped. \"Better get him back to the spaceship fast. I've seen this kind of thing before with transphasia. His body cooled down because of the screaming wind—psychosomatic reaction—and his heating circuits"}]}
{"qid": "ba58d75c003a4653a5b299a75b17ab78_q5", "doc_id": "ba58d75c003a4653a5b299a75b17ab78", "question": "What is the significance of cohesion in the story?", "chunks": [{"chunk_id": "ba58d75c003a4653a5b299a75b17ab78__chunk_032", "distance": "0.67955446", "text": "as certain. Not only for humane reasons—he was the most important member of the crew. With him around, there were only two opinions, his and mine. Without him, I'd have endless opinions to contend with. But it wouldn't do any good to go out no better equipped than he. There was no time to wait for tractors to be built if we wanted to reach him alive, and we certainly couldn't reach him five or ten miles out with our three miles of safety line. We would have to go in spacesuits. But how would that leave us any better off than Quade? Why was Quade vulnerable in his spacesuit, as I knew from"}, {"chunk_id": "ba58d75c003a4653a5b299a75b17ab78__chunk_031", "distance": "0.71016240", "text": "oration made a man a reckless fool by doing things on one planet he had once found safe and wise on some other world. The thought intruded itself: why hadn't I recognized this before I let Quade escape to almost certain death? Wasn't it because I wanted him dead, because I resented the crew's resentment of my authority, and recognized in him the leader and symbol of this resentment? I threw away that idea along with my half-used cigarette. It might very well be true, but how did that help now? I had to think . I was going after him, that was certain. Not only for humane reasons—he was the"}, {"chunk_id": "ba58d75c003a4653a5b299a75b17ab78__chunk_042", "distance": "0.71491092", "text": "wine from my drinking tube against the roof of my mouth to sharpen my taste. It brought out the footsteps sharper. It also made the landscape more of a teen-ager's caloric nightmare. The four of us pulled ourselves closer together by reeling in more of our safety line. Farley and Hoffman, Nagurski and myself, we were cabled together. It gave us a larger hunk of reality to hold onto. Even so, things wavered for me during a wisp of time. We stumbled over the ridge, feeling out the territory. It was a sticky job crawling over a melting, chunk-style Hershey bar. I was thankful for the"}, {"chunk_id": "ba58d75c003a4653a5b299a75b17ab78__chunk_023", "distance": "0.72982031", "text": "through the connecting hatch. \"With the Captain's permission....\" \"Go ahead, Quade, tell him,\" Nagurski invited. \"There's only one way to wade through transphasia with any reliability,\" Quade told me. \"You keep some kind of physical contact with the spaceship. Parties are strung out on guide line, like we were, but the cable has to be run back and made fast to the hull.\" \"How far can we run it back?\" Quade shrugged. \"Miles.\" \"How many?\" \"We have three miles of cable. As long as you can feel, taste, see, smell or hear that rope anchoring you to home, you aren't lost.\" \"Three miles isn't good"}]}
{"qid": "977f33f68a5640aeaef7ee221fd6b79c_q2", "doc_id": "977f33f68a5640aeaef7ee221fd6b79c", "question": "Who is Mr. Lexington, and what traits does he demonstrate?", "chunks": [{"chunk_id": "977f33f68a5640aeaef7ee221fd6b79c__chunk_018", "distance": "0.48454112", "text": "me a hard time just for the hell of it.\" \"Well, am I?\" Lexington demanded. Looking at him squarely, seeing the intensity of the pain-drawn eyes, Peter had the startling feeling that Lexington was rooting for him! \"No, you're not.\" \"Then what am I after?\" \"Suppose you tell me.\" So suddenly that it was almost like a collapse, the tension went out of the old man's face and shoulders. He nodded with inexpressible tiredness. \"Good again. The man I want doesn't exist. He has to be made—the same as I was. You qualify, so far. You've lost your illusions, but haven't had time yet to replace them with"}, {"chunk_id": "977f33f68a5640aeaef7ee221fd6b79c__chunk_009", "distance": "0.54898882", "text": "eep as though retreating from pain, and this was a citadel of a man, yes, but beginning to crumble. \"What can you do?\" asked Lexington abruptly. Peter started, opened his mouth to answer, closed it again. He'd been jolted too often in too short a time to be stampeded into blurting a reply that would cost him this job. \"Good,\" said Lexington. \"Only a fool would try to answer that. Do you have any knowledge of medicine?\" \"Not enough to matter,\" Peter said, stung by the compliment. \"I don't mean how to bandage a cut or splint a broken arm. I mean things like cell structure, neural"}, {"chunk_id": "977f33f68a5640aeaef7ee221fd6b79c__chunk_031", "distance": "0.54978752", "text": "elf to speak, and let the silence remain unbroken. Finally Lexington spoke. \"I know it's hard to believe, but there it is.\" \"Hard to believe?\" said Peter. \"I almost can't. The trade journals run articles about factories like this one, but planned for ten, maybe twenty years in the future.\" \"Damn fools!\" exclaimed Lexington, getting part of his breath back. \"They could have had it years ago, if they'd been willing to drop their idiotic notions about specialization.\" Lexington mopped his forehead with a large white handkerchief. Apparently the walk through the factory had tired him"}, {"chunk_id": "977f33f68a5640aeaef7ee221fd6b79c__chunk_005", "distance": "0.55773020", "text": "d he had to answer aloud if there was a microphone around; but the soft voice said: \"Follow the open doors down the hall. Mr. Lexington is expecting you.\" \"Thanks,\" Peter said, and a door at one side of the anteroom swung open for him. He went through it with his composure slipping still further from his grip. This was no way to go into an interview, but doors kept opening before and shutting after him, until only one was left, and the last of his calm was blasted away by a bellow from within. \"Don't stand out there like a jackass! Either come in or go away!\" Peter found himself leaping"}]}
{"qid": "977f33f68a5640aeaef7ee221fd6b79c_q3", "doc_id": "977f33f68a5640aeaef7ee221fd6b79c", "question": "Describe the setting of the story.", "chunks": [{"chunk_id": "977f33f68a5640aeaef7ee221fd6b79c__chunk_004", "distance": "0.68343711", "text": "y by trucks backing up to it. Maybe the employees' entrance was on the third side. It wasn't. Staring back at the last blank wall, Peter suddenly remembered the time he had set out to kill. He looked at his watch and gasped. At a run, set to straight-arm the door, he almost fell on his face. The door had opened by itself. He stopped and looked for a photo-electric eye, but a soft voice said through a loudspeaker in the anteroom wall: \"Mr. Manners?\" \"What?\" he panted. \"Who—?\" \"You are Mr. Manners?\" the voice asked. He nodded, then realized he had to answer aloud if there was a microphone"}, {"chunk_id": "977f33f68a5640aeaef7ee221fd6b79c__chunk_000", "distance": "0.71892786", "text": "LEX By W. T. HAGGERT Illustrated by WOOD [Transcriber's Note: This etext was produced from Galaxy Magazine August 1959. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.] Nothing in the world could be happier and mere serene than a man who loves his work—but what happens when it loves him back? Keep your nerve, Peter Manners told himself; it's only a job. But nerve has to rest on a sturdier foundation than cash reserves just above zero and eviction if he came away from this interview still unemployed. Clay, at the Association of"}, {"chunk_id": "977f33f68a5640aeaef7ee221fd6b79c__chunk_007", "distance": "0.71966457", "text": "\"I'm Peter Manners. The Association—\" \"Sit down,\" said the man at the desk. \"Let's look you over.\" He was a huge man behind an even huger desk. Peter took a chair in front of the desk and let himself be inspected. It wasn't comfortable. He did some looking over of his own to ease the tension. The room was more than merely large, carpeted throughout with a high-pile, rich, sound-deadening rug. The oversized desk and massive leather chairs, heavy patterned drapes, ornately framed paintings—by God, even a glass-brick manteled fireplace and bowls with flowers!—made him feel as if he had walked"}, {"chunk_id": "977f33f68a5640aeaef7ee221fd6b79c__chunk_008", "distance": "0.72192484", "text": "ls with flowers!—made him feel as if he had walked down a hospital corridor into Hollywood's idea of an office. His eyes eventually had to move to Lexington, and they were daunted for another instant. This was a citadel of a man—great girders of frame supporting buttresses of muscle—with a vaulting head and drawbridge chin and a steel gaze that defied any attempt to storm it. But then Peter came out of his momentary flinch, and there was an age to the man, about 65, and he saw the muscles had turned to fat, the complexion ashen, the eyes set deep as though retreating from pain, and this was a"}]}
{"qid": "977f33f68a5640aeaef7ee221fd6b79c_q4", "doc_id": "977f33f68a5640aeaef7ee221fd6b79c", "question": "Describe the significance of the machinery throughout the story.", "chunks": [{"chunk_id": "977f33f68a5640aeaef7ee221fd6b79c__chunk_027", "distance": "0.50302732", "text": "ou through the manufacturing and assembly sections right now, but they're too noisy for me to explain what's going on while we're there.\" Peter followed numbly as Lexington led him through a maze of machines, each one seemingly intent on cutting, bending, welding, grinding or carrying some bit of metal, or just standing idle, waiting for something to do. The two-armed manipulators Peter had just seen were everywhere, scuttling from machine to machine, apparently with an exact knowledge of what they were doing and the most efficient way of doing it. He wondered what would happen if one of them"}, {"chunk_id": "977f33f68a5640aeaef7ee221fd6b79c__chunk_024", "distance": "0.53916210", "text": "plant, as a matter of fact, is controlled from one point and is really a single unit. These materials handlers, or manipulators, were about the toughest things in the place to design. But they're tremendously useful. You'll see a lot of them around.\" Lexington was about to leave the side of the machine when abruptly one of the arms rose to the handkerchief in his breast pocket and daintily tugged it into a more attractive position. It took only a split second, and before Lexington could react, all three machines were moving away to attend to mysterious duties of their own. Peter tore his eyes"}, {"chunk_id": "977f33f68a5640aeaef7ee221fd6b79c__chunk_023", "distance": "0.55172098", "text": "istening machines, apparently self-powered, rolled noiselessly up to the door in formation and stopped there, apparently waiting to be inspected. They gave Peter the creeps. Simple square boxes, set on casters, with two arms each mounted on the sides might have looked similar. The arms, fashioned much like human arms, hung at the sides, not limply, but in a relaxed position that somehow indicated readiness. Lexington went over to one of them and patted it lovingly. \"Really, these machines are only an extension of one large machine. The whole plant, as a matter of fact, is controlled from one"}, {"chunk_id": "977f33f68a5640aeaef7ee221fd6b79c__chunk_029", "distance": "0.56472075", "text": "on indicated a small room where a typewriter could be heard clattering away. \"Standard business machines, operated by the central control mechanism. In that room,\" he said, as the door swung open and Peter saw that the typewriter was actually a sort of teletype, with no one before the keyboard, \"incoming mail is sorted and inquiries are replied to. In this one over here, purchase orders are prepared, and across the hall there's a very similar rig set up in conjunction with an automatic bookkeeper to keep track of the pennies and to bill the customers.\" \"Then all you do is read the incoming"}]}
{"qid": "977f33f68a5640aeaef7ee221fd6b79c_q5", "doc_id": "977f33f68a5640aeaef7ee221fd6b79c", "question": "What is the relationship between Mr. Lexington and Peter?", "chunks": [{"chunk_id": "977f33f68a5640aeaef7ee221fd6b79c__chunk_018", "distance": "0.43076873", "text": "me a hard time just for the hell of it.\" \"Well, am I?\" Lexington demanded. Looking at him squarely, seeing the intensity of the pain-drawn eyes, Peter had the startling feeling that Lexington was rooting for him! \"No, you're not.\" \"Then what am I after?\" \"Suppose you tell me.\" So suddenly that it was almost like a collapse, the tension went out of the old man's face and shoulders. He nodded with inexpressible tiredness. \"Good again. The man I want doesn't exist. He has to be made—the same as I was. You qualify, so far. You've lost your illusions, but haven't had time yet to replace them with"}, {"chunk_id": "977f33f68a5640aeaef7ee221fd6b79c__chunk_030", "distance": "0.49184036", "text": "customers.\" \"Then all you do is read the incoming mail and maintain the machinery?\" asked Peter, trying to shake off the feeling of open amazement that had engulfed him. \"I don't even do those things, except for a few letters that come in every week that—it doesn't want to deal with by itself.\" The shock of what he had just seen was showing plainly on Peter's face when they walked back into Lexington's office and sat down. Lexington looked at him for quite a while without saying anything, his face sagging and pale. Peter didn't trust himself to speak, and let the silence remain unbroken."}, {"chunk_id": "977f33f68a5640aeaef7ee221fd6b79c__chunk_005", "distance": "0.49420983", "text": "d he had to answer aloud if there was a microphone around; but the soft voice said: \"Follow the open doors down the hall. Mr. Lexington is expecting you.\" \"Thanks,\" Peter said, and a door at one side of the anteroom swung open for him. He went through it with his composure slipping still further from his grip. This was no way to go into an interview, but doors kept opening before and shutting after him, until only one was left, and the last of his calm was blasted away by a bellow from within. \"Don't stand out there like a jackass! Either come in or go away!\" Peter found himself leaping"}, {"chunk_id": "977f33f68a5640aeaef7ee221fd6b79c__chunk_025", "distance": "0.50686949", "text": "ysterious duties of their own. Peter tore his eyes away from them in time to see the look of frustrated embarrassment that crossed Lexington's face, only to be replaced by one of anger. He said nothing, however, and led Peter to a large bay where racks of steel plate, bar forms, nuts, bolts, and other materials were stored. \"After unloading a truck, the machines check the shipment, report any shortages or overages, and store the materials here,\" he said, the trace of anger not yet gone from his voice. \"When an order is received, it's translated into the catalogue numbers used internally"}]}
{"qid": "a337a1e6bff94501af5dc059076eec79_q2", "doc_id": "a337a1e6bff94501af5dc059076eec79", "question": "Describe the setting of the story.", "chunks": [{"chunk_id": "a337a1e6bff94501af5dc059076eec79__chunk_051", "distance": "0.69082755", "text": "e that?\" Following his pointing finger, Tate saw a faint, ephemeral arc showing above a line of low hills in the distance. \"Kal-Jmar,\" said Syme. Tate brightened a little. His body was too filled with fatigue for his mind to do any work on the problem that was baffling him, and so it receded into the back of his mind. \"Kal-Jmar,\" whispered Syme again. There was no twilight. The sun dropped abruptly behind the low horizon, and darkness fell, sudden and absolute. Syme picked up the extra oxygen tank and the suitcase, checked his direction by a wrist compass, and started toward the hills. Tate"}, {"chunk_id": "a337a1e6bff94501af5dc059076eec79__chunk_000", "distance": "0.69158566", "text": "Produced by Greg Weeks, Mary Meehan and the Online Distributed Proofreading Team at http://www.pgdp.net Doorway to Kal-Jmar By Stuart Fleming Two men had died before Syme Rector's guns to give him the key to the ancient city of Kal-Jmar—a city of untold wealth, and of robots that made desires instant commands. [Transcriber's Note: This etext was produced from Planet Stories Winter 1944. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.] The tall man loitered a moment before a garish window display, his eyes impassive in his space-burned"}, {"chunk_id": "a337a1e6bff94501af5dc059076eec79__chunk_059", "distance": "0.69782460", "text": "ted. \"Look,\" he said again. \"The color is changing slightly, falling down the spectrum. I think that's a warning signal. When it reaches red, the door will close.\" He moved toward the widening door, like a sleepwalker. \"Wait,\" Syme said hoarsely. \"You forgot the machine.\" Tate turned, said, \"Oh yes,\" and walked back. Then he saw the gun in Syme's hand. His jaw dropped slightly, but he didn't say anything. He just stood there, looking dumbly from the gun to Syme's dark face. Syme shot him carefully in the chest. He dropped like a rag doll, but Syme's aim had been bad. He wasn't dead yet. He"}, {"chunk_id": "a337a1e6bff94501af5dc059076eec79__chunk_062", "distance": "0.69834256", "text": "and furbished waiting for him. He was intoxicated. The city was his! There was a gentle ramp leading upward, and Syme followed it, breathing in the manufactured air of his pressure suit like wine. All around him, the city blazed with treasures beyond price. It was his! The ramp led to a portal set in the side of a shining needle of a building. Syme strode up to the threshold, and the door dilated for him. He stepped inside; the door closed and a soft light glowed on. There was air here: good, breathable air. A tiny zephyr of it was blowing from some hidden source against his body. Greatly"}]}
{"qid": "a337a1e6bff94501af5dc059076eec79_q3", "doc_id": "a337a1e6bff94501af5dc059076eec79", "question": "Who is Harold Tate, and what happens to him in the story?", "chunks": [{"chunk_id": "a337a1e6bff94501af5dc059076eec79__chunk_016", "distance": "0.56576097", "text": "nwhile, he might as well enjoy himself, and it was safer to be seen with a companion than to be alone. He listened lazily to what the other was saying, leaning his tall, graceful body back into the softly-cushioned seat. \"Lissen,\" said Harold Tate. He leaned forward on one elbow, slipped, caught himself, and looked at the elbow reproachfully. \"Lissen,\" he said again, \"I trust you, Jones. You're obvi-obviously an adventurer, but you have an honest face. I can't see it very well at the moment, but I hic!—pardon—seem to recall it as an honest face. I'm going to tell you something, because I need"}, {"chunk_id": "a337a1e6bff94501af5dc059076eec79__chunk_049", "distance": "0.59047222", "text": "ead held high. He led the way, wordlessly, back to the wrecked sand car. Tate followed him with a hangdog, beaten air, as though he had just found something that shattered all his previous concepts of the verities in life, and didn't know what to do about it. Still silently, Syme refilled his oxygen tank, watched Tate do the same, and then picked up two spare tanks and the precious black suitcase and handed one of the tanks to Tate. Then he stumped around to the back of the car and inspected the damage. The cable reel, which might have drawn them out of the gully, was hopelessly smashed. That"}, {"chunk_id": "a337a1e6bff94501af5dc059076eec79__chunk_022", "distance": "0.60463661", "text": "our hours, by the blindest of chances, blurted out his secret to Syme Rector, the scourge of the spaceways, the man with a thousand credits on his sleek, tigerish head. Syme's smile was not tigerish now; it was carefully, studiedly mild. For Tate was no longer drunk, and it was important that it should not occur to him that he had been indiscreet. \"This is native territory we're coming to, Harold,\" he said. \"Better strap on your gun.\" \"Why. Are they really dangerous?\" \"They're unpredictable,\" Syme told him. \"They're built differently, and they think differently. They breathe like us, down in"}, {"chunk_id": "a337a1e6bff94501af5dc059076eec79__chunk_054", "distance": "0.60677314", "text": "ttery, and it needed every volt of that tremendous power. Tate made the connections, his hands trembling slightly, and set it up on a telescoping tripod. Syme watched him closely, his big body tensed with expectation. The field was before them, shimmering faintly in the starlight. It looked unsubstantial as the stuff of dreams, but both men knew that no power man possessed, unless it was the thing Tate held, could penetrate that screen. Tate set the mechanism up close to the field, aimed it very delicately, and closed a minute switch. After a long second, he opened it again. Nothing happened."}]}
{"qid": "a337a1e6bff94501af5dc059076eec79_q4", "doc_id": "a337a1e6bff94501af5dc059076eec79", "question": "What are the items that Syme Rector uses that help him survive?", "chunks": [{"chunk_id": "a337a1e6bff94501af5dc059076eec79__chunk_013", "distance": "0.58339369", "text": "les of his arms. His rescuer was tall and thin, of indeterminate age. He had light, sandy hair, a sharp nose, and—oddly conflicting—pale, serious eyes and a humorous wide mouth. He was still panting. \"I'm not hurt,\" Syme said. He grinned, his white teeth flashing in his dark, lean face. \"Thanks for giving me a hand.\" \"You scared hell out of me,\" said the man. \"I heard a thud. I thought—you'd gone over.\" He looked at Syme questioningly. \"That was my bag,\" the outlaw said quickly. \"It slipped out of my hand, and I overbalanced myself when I grabbed for it.\" The man sighed. \"I need a drink. You"}, {"chunk_id": "a337a1e6bff94501af5dc059076eec79__chunk_033", "distance": "0.58394575", "text": "s energy gun. That gun, Syme knew from experience, could burn through a small thickness of steelite if held on the same spot long enough. \"Come on,\" Syme said grimly. He rose and reached for a pressure suit, and Tate followed him. \"What do you think they'll—\" he began, and then stopped himself. \"I know. They're unpredictable.\" \"Yeah,\" said Syme, and opened the door. The air in the car whooshed into the near-vacuum outside, and he and Tate stepped out. The Martian leader looked at them enigmatically, then turned and started off. The other natives closed in on them, and they all bounded along"}, {"chunk_id": "a337a1e6bff94501af5dc059076eec79__chunk_022", "distance": "0.59560841", "text": "our hours, by the blindest of chances, blurted out his secret to Syme Rector, the scourge of the spaceways, the man with a thousand credits on his sleek, tigerish head. Syme's smile was not tigerish now; it was carefully, studiedly mild. For Tate was no longer drunk, and it was important that it should not occur to him that he had been indiscreet. \"This is native territory we're coming to, Harold,\" he said. \"Better strap on your gun.\" \"Why. Are they really dangerous?\" \"They're unpredictable,\" Syme told him. \"They're built differently, and they think differently. They breathe like us, down in"}, {"chunk_id": "a337a1e6bff94501af5dc059076eec79__chunk_003", "distance": "0.59835643", "text": "hat he was an outlaw—the very fact of the crashed, illegally-armed ship would have told them that. But they didn't know that he was Syme Rector, the most-wanted and most-feared raider in the System. In that was his only advantage. He walked a little faster, as his quarry turned up a side street and then boarded a moving ramp to an upper level. He watched until the short, wide-shouldered figure in spaceman's harness disappeared over the top of the ramp, and then followed. The man was waiting for him at the mouth of the ascending tunnel. Syme looked at him casually, without a flicker of"}]}
{"qid": "a337a1e6bff94501af5dc059076eec79_q5", "doc_id": "a337a1e6bff94501af5dc059076eec79", "question": "Describe the Martians in the story.", "chunks": [{"chunk_id": "a337a1e6bff94501af5dc059076eec79__chunk_020", "distance": "0.36818165", "text": "e Martians, whether they were the ancestors of the present decadent Martian race, or a different species. No one knew anything about them or about Kal-Jmar. In the early days, when the conquest of Mars was just beginning, Earth scientists had been wild to get into the city. They had observed it from every angle, taken photographs of its architecture and the robots that still patrolled its fantastically winding streets, and then they had tried everything they knew to pierce the wall. Later, however, when every unsuccessful attempt had precipitated a bloody uprising of the present-day"}, {"chunk_id": "a337a1e6bff94501af5dc059076eec79__chunk_030", "distance": "0.43646896", "text": "we walk from here on.\" Then he looked up again and caught a glimpse of the horde of beasts that were rushing up the gully toward them. \"My God!\" he said. \"What are those?\" Syme looked. \"Those,\" he said bitterly, \"are Martians.\" The natives, like all Martian fauna, were multi-legged. Also like all Martian fauna, they moved so fast that you couldn't see how many legs they did have. Actually, however, the natives had six legs apiece—or, more properly, four legs and two arms. Their lungs were not as large as they appeared, being collapsed at the moment. What caused the bulge that made their"}, {"chunk_id": "a337a1e6bff94501af5dc059076eec79__chunk_041", "distance": "0.43651164", "text": "r people would die out. You couldn't have that, of course.\" He sighed deeply. He spread his gloved hands before him and looked at them with a queer intentness. \"Well—how about the Martians—the Kal-Jmar Martians, I mean? I'd dearly love to know the answer to that one.\" \"Neither of the alternatives in your mind is correct. They were not a separate species, although they were unlike us. But they were not our ancestors, either. They were the contemporaries of our ancestors.\" \"Several thousand years ago Mars' loss of atmosphere began to make itself felt. There were two ways out. Some chose to seal"}, {"chunk_id": "a337a1e6bff94501af5dc059076eec79__chunk_032", "distance": "0.43821895", "text": "take care of the extremes of Martian temperature. Right now they were mostly black. The natives slowed down and spread out to surround the wrecked sand car, and it could be seen that most of them were armed with spears, although some had the slim Benson energy guns—strictly forbidden to Martians. Syme stopped cursing and watched tensely. Tate said nothing, but he swallowed audibly. One Martian, who looked exactly like all the rest, stepped forward and motioned unmistakably for the two to come out. He waited a moment and then gestured with his energy gun. That gun, Syme knew from experience,"}]}
{"qid": "2c180e6c50c149d59b91363514cab52a_q2", "doc_id": "2c180e6c50c149d59b91363514cab52a", "question": "Where is the story set?", "chunks": [{"chunk_id": "2c180e6c50c149d59b91363514cab52a__chunk_007", "distance": "0.76408553", "text": "e pressure suit he had been given because he would never need it, and marched out to meet the visiting spaceship. He wasn't quite clear how he came from walking effortlessly across the Martian plain that had all the distance-perpetuating qualities of a kid's crank movie machine to the comfortable interior of a strange cabin. Not a ship's cabin but a Northwoods cabin. The black and orange Hallowe'en log charring in the slate stone fireplace seemed real. So did the lean man with the smiling mustache painted with the random designs of the fire, standing before the horizontal pattern of chinked"}, {"chunk_id": "2c180e6c50c149d59b91363514cab52a__chunk_008", "distance": "0.78345704", "text": "standing before the horizontal pattern of chinked wall. \"Need a fresher?\" the host inquired. Manet's eyes wondered down to heavy water tumbler full of rich, amber whiskey full of sparks from the hearth. He stirred himself in the comfortingly warm leather chair. \"No, no, I'm fine .\" He let the word hang there for examination. \"Pardon me, but could you tell me just what place this is?\" The host shrugged. It was the only word for it. \"Whatever place you choose it to be, so long as you're with Trader Tom. 'Service,' that's my motto. It is a way of life with me.\" \"Trader Tom? Service?\" \"Yes!"}, {"chunk_id": "2c180e6c50c149d59b91363514cab52a__chunk_002", "distance": "0.78626132", "text": "razy part of it. Not that he was going to have any great long wait of it. He was already talking to himself, making verbal notes for his lectures, and he had cut out a picture of Annie Oakley from an old book. He tacked it up and winked at it whenever he passed that way. Lately she was winking back at him. Loneliness was a physical weight on his skull. It peeled the flesh from his arms and legs and sandpapered his self-pity to a fine sensitivity. No one on Earth was as lonely as William Manet, and even William Manet could only be this lonely on Mars. Manet was Atmosphere Seeder Station"}, {"chunk_id": "2c180e6c50c149d59b91363514cab52a__chunk_050", "distance": "0.78690910", "text": "ew York swing and jet combat and Daniel Boone, and we'll never change. We don't change and you can't change us for others. I've made the worst thing happen to you that can happen to any man. I've seen that you will always keep your friends. \" The prospect was frightful. Victor smiled. \"Aren't you going to denounce me for a fiend?\" \"Yes, it is time for the denouncement. Tell me, you feel that now you are through? You have fulfilled your function?\" \"Yes. Yes.\" \"Now you will have but to lean back, as it were, so to speak, and see me suffer?\" \" Yes. \" \"No. Can't do it, old man. Can't. I know."}]}
{"qid": "2c180e6c50c149d59b91363514cab52a_q3", "doc_id": "2c180e6c50c149d59b91363514cab52a", "question": "What is the relationship between Ronald and Manet?", "chunks": [{"chunk_id": "2c180e6c50c149d59b91363514cab52a__chunk_043", "distance": "0.39246511", "text": "some months. Ronald didn't say anything to Manet. But he looked offended. \"You,\" Manet said to Veronica with a shove in the small of the back, \"inside, inside.\" Ronald sidestepped the lurching girl. \"Do you know what I'm going to do with you?\" Manet demanded. \"I'm going to lock you up in here, and leave you for a day, a month, a year, forever! Now what do you think about that?\" \"If you think it's the right thing, dear,\" Veronica said hesitantly. \"You know best, Willy,\" Ronald said uncertainly. Manet slammed the hatch in disgust. Manet walked carefully down the corridor, watching streamers of"}, {"chunk_id": "2c180e6c50c149d59b91363514cab52a__chunk_023", "distance": "0.40769023", "text": "rful. Submissive. Co-operative. Manet had selected these factors in order to make Ronald as different a person from himself as possible. \"The Korean-American War was the greatest of all wars,\" Ronald said pontifically. \"Only in the air,\" Manet corrected him. Intelligence was one of the factors Manet had punched to suppress. Intelligence. Aggressiveness. Sense of perfection. Ronald couldn't know any more than Manet, but he could (and did) know less. He had seen to that when his own encephalograph matrix had programmed Ronald's feeder. \"There were no dogfights in Korea,\" Ronald said. \"I know.\""}, {"chunk_id": "2c180e6c50c149d59b91363514cab52a__chunk_028", "distance": "0.43046129", "text": "e the swing and lifted an uppercut to the ledge of Ronald's jaw. Ronald pinwheeled to the floor. He lifted his bruised head from the deck and worked his reddened mouth. \"Had enough?\" he asked Manet. Manet dropped his fists to his sides and turned away. \"Yes.\" Ronald hopped up lightly. \"Another checkers, Billy Boy?\" \"No.\" \"Okay. Anything you want, William, old conquerer.\" Manet scrunched up inside himself in impotent fury. Ronald was maddeningly co-operative and peaceful. He would even get in a fist fight to avoid trouble between them. He would do anything Manet wanted him to do. He was so"}, {"chunk_id": "2c180e6c50c149d59b91363514cab52a__chunk_027", "distance": "0.47544527", "text": "the American Sabre Jet was superior to the Mig. He maintained with a straight face that Tommy Dorsey was a better band man than Benny Goodman. Ronald was a terrific jerk. \"Ronald,\" Manet said, \"you are a terrific jerk.\" Ronald leaped up immediately and led with his right. Manet blocked it deftly and threw a right cross. Ronald blocked it deftly, and drove in a right to the navel. The two men separated and, puffing like steam locomotives passing the diesel works, closed again. Ronald leaped forward and led with his right. Manet stepped inside the swing and lifted an uppercut to the ledge of"}]}
{"qid": "2c180e6c50c149d59b91363514cab52a_q4", "doc_id": "2c180e6c50c149d59b91363514cab52a", "question": "What is the purpose of the modifier?", "chunks": [{"chunk_id": "2c180e6c50c149d59b91363514cab52a__chunk_035", "distance": "0.49182147", "text": "was the Modifier. The Modifier was what he needed to change Ronald. Or to shut him off. If only the Master Chart hadn't been lost, so he would know what the Modifier looked like! He hoped the Modifier itself wasn't lost. He hated to think of Ronald locked in the Usher tomb of the File Room for 18 flat years. Long before that, he would have worn his fists away hammering at the hatch. Then he might start pounding with his head. Perhaps before the time was up he would have worn himself down to nothing whatsoever. Manet selected the ripple-finished gray-covered manual from the hodgepodge, and"}, {"chunk_id": "2c180e6c50c149d59b91363514cab52a__chunk_021", "distance": "0.54750705", "text": "vital to your entire experiment in socialization. The Modifier is Part #A-1 on the Master Chart. He prowled through the box looking for some kind of a chart. There was nothing that looked like a chart inside. He retrieved the lid and looked at its inside. Nothing. He tipped the box and looked at its outside. Not a thing. There was always something missing from kits. Maybe even the Modifier itself. He read on, and probed and scattered the parts in the long box. He studied the manual intently and groped out with his free hand. The toe bone was connected to the foot bone.... The Red King sat"}, {"chunk_id": "2c180e6c50c149d59b91363514cab52a__chunk_020", "distance": "0.58538496", "text": "u go further, first find the Modifier in your kit. This is vital . He quickly riffled through the pages. Other Friends, Authority, A Companion .... Then The Final Model . Manet tried to flip past this section, but the pages after the sheet labeled The Final Model were stuck together. More than stuck. There was a thick slab of plastic in the back of the book. The edges were ridged as if there were pages to this section, but they could only be the tracks of lame ants. Manet flipped back to page one. First find the Modifier in your kit. This is vital to your entire experiment in socialization."}, {"chunk_id": "2c180e6c50c149d59b91363514cab52a__chunk_048", "distance": "0.65483212", "text": "it was not a flesh-sprayer but the Modifier. \"It's finished!\" were Victor's first words. \"It's done!\" Manet stared at the tiny wreck. \"To say the least.\" Victor stepped out of the oblong box. \"There is something you should understand. I am different from the others.\" \"They all say that.\" \"I am not your friend.\" \"No?\" \"No. You have made yourself an enemy.\" Manet felt nothing more at this information than an esthetic pleasure at the symmetry of the situation. \"It completes the final course in socialization,\" Victor continued. \"I am your adversary. I will do everything I can to defeat you. I"}]}
{"qid": "2c180e6c50c149d59b91363514cab52a_q5", "doc_id": "2c180e6c50c149d59b91363514cab52a", "question": "How is Manet's madness portrayed in the story?", "chunks": [{"chunk_id": "2c180e6c50c149d59b91363514cab52a__chunk_006", "distance": "0.35706913", "text": "as envy. Manet suspected hallucination, but in an existence with all the pallid dispassion of a requited love he was happy to welcome dementia. Sometimes he even manufactured it. Sometimes he would run through the arteries of the factory and play that it had suddenly gone mad hating human beings, and was about to close down its bulkheads on him as sure as the Engineers' Thumb and bale up the pressure-dehydrated digest, making so much stall flooring of him. He ran until he dropped with a kind of climaxing release of terror. So Manet put on the pressure suit he had been given because he would"}, {"chunk_id": "2c180e6c50c149d59b91363514cab52a__chunk_017", "distance": "0.39088088", "text": "this way again.\" Manet didn't open the box. He let it fade quietly in the filtered but still brilliant sunlight near a transparent wall. Manet puttered around the spawning monster, trying to brush the copper taste of the station out of his mouth in the mornings, talking to himself, winking at Annie Oakley, and waiting to go mad. Finally, Manet woke up one morning. He lay in the sheets of his bunk, suppressing the urge to go wash his hands, and came at last to the conclusion that, after all the delay, he was mad. So he went to open the box. The cardboard lid seemed to have become both brittle"}, {"chunk_id": "2c180e6c50c149d59b91363514cab52a__chunk_029", "distance": "0.44423234", "text": "ould do anything Manet wanted him to do. He was so utterly damned stupid. Manet's eyes orbitted towards the checkerboard. But if he were so much more stupid than he, Manet, why was it that their checker games always ended in a tie? The calendar said it was Spring on Earth when the radio was activated for a high-speed information and entertainment transmission. The buzzer-flasher activated in the solarium at the same time. Manet lay stretched out on his back, naked, in front of the transparent wall. By rolling his eyes back in his head, Manet could see over a hedge of eyebrows for several"}, {"chunk_id": "2c180e6c50c149d59b91363514cab52a__chunk_002", "distance": "0.51076609", "text": "razy part of it. Not that he was going to have any great long wait of it. He was already talking to himself, making verbal notes for his lectures, and he had cut out a picture of Annie Oakley from an old book. He tacked it up and winked at it whenever he passed that way. Lately she was winking back at him. Loneliness was a physical weight on his skull. It peeled the flesh from his arms and legs and sandpapered his self-pity to a fine sensitivity. No one on Earth was as lonely as William Manet, and even William Manet could only be this lonely on Mars. Manet was Atmosphere Seeder Station"}]}
{"qid": "beb60ac6e67048dc9cb458afe7c16166_q2", "doc_id": "beb60ac6e67048dc9cb458afe7c16166", "question": "Who is the Ruler and what is his role in the story?", "chunks": [{"chunk_id": "beb60ac6e67048dc9cb458afe7c16166__chunk_034", "distance": "0.46352279", "text": "ction. All Tr'en act instantly in the same manner. The Ruler is adopted by the previous Ruler; in this way we are assured of a common wisdom and a steady judgment.\" \"You have heard our government defined,\" the Ruler said. \"Now, you will define yours for us.\" Korvin shook his head. \"If you insist,\" he said, \"I'll try it. But you won't understand it.\" The Ruler frowned. \"We shall understand,\" he said. \"Begin. Who governs you?\" \"None,\" Korvin said. \"But you are governed?\" Korvin nodded. \"Yes.\" \"Then there is a governor,\" the Ruler insisted. \"True,\" Korvin said. \"But everyone is the governor.\""}, {"chunk_id": "beb60ac6e67048dc9cb458afe7c16166__chunk_035", "distance": "0.51119697", "text": "rue,\" Korvin said. \"But everyone is the governor.\" \"Then there is no government,\" the Ruler said. \"There is no single decision.\" \"No,\" Korvin said equably, \"there are many decisions binding on all.\" \"Who makes them binding?\" the Ruler asked. \"Who forces you to accept these decisions? Some of them must be unfavorable to some beings?\" \"Many of them are unfavorable,\" Korvin said. \"But we are not forced to accept them.\" \"Do you act against your own interests?\" Korvin shrugged. \"Not knowingly,\" he said. The Ruler flashed a look at the technicians handling the lie-detector. Korvin turned to see"}, {"chunk_id": "beb60ac6e67048dc9cb458afe7c16166__chunk_012", "distance": "0.53220940", "text": ", a Tr'en over seven feet tall and correspondingly broad, sat in the great chair, his four fingers tapping gently on the table near him, staring at Korvin and his guards. The guards stood on either side of their captive, looking as impassive as jade statues, six and a half feet high. Korvin wasn't attempting to escape. He wasn't pleading with the Ruler. He wasn't defying the Ruler, either. He was just answering questions. The Tr'en liked to have everything clear. They were a logical race. The Ruler had started with Korvin's race, his name, his sex—if any—and whether or not his appearance were"}, {"chunk_id": "beb60ac6e67048dc9cb458afe7c16166__chunk_029", "distance": "0.53376114", "text": "eems to us inefficient and liable to error, yet it is a possible system. Is it the system you mean?\" Very sharp, Korvin told himself grimly. \"It is,\" he said. \"Then the government which reigns over several planets is supreme,\" the Ruler said. \"It is,\" Korvin said. \"Who is it that governs?\" the Ruler said. The key question had, at last, been asked. Korvin felt grateful that the logical Tr'en had determined to begin from the beginning, instead of going off after details of armament first; it saved a lot of time. \"The answer to that question,\" Korvin said, \"cannot be given to you.\" \"Any question"}]}
{"qid": "beb60ac6e67048dc9cb458afe7c16166_q3", "doc_id": "beb60ac6e67048dc9cb458afe7c16166", "question": "What is the significance of translation in the story?", "chunks": [{"chunk_id": "beb60ac6e67048dc9cb458afe7c16166__chunk_000", "distance": "0.55983675", "text": "LOST IN TRANSLATION By LARRY M. HARRIS In language translation, you may get a literally accurate word-for-word translation ... but miss the meaning entirely. And in space-type translation ... the effect may be the same! Illustrated by Schoenherr The cell had been put together more efficiently than any Korvin had ever been in. But that was only natural, he told himself sadly; the Tr'en were an efficient people. All the preliminary reports had agreed on that; their efficiency, as a matter of fact, was what had made Korvin's arrival a necessity. They were well into the atomic era, and were on"}, {"chunk_id": "beb60ac6e67048dc9cb458afe7c16166__chunk_043", "distance": "0.64849967", "text": "can't digest it and stay what they are; you've got to be democratic, to some extent, to understand the idea. What keeps us obeying laws we ourselves make? What keeps us obeying laws that make things inconvenient for us? Sheer self-interest, of course—but try to make a Tr'en see it! With one government and one language, they just weren't equipped for translation. They were too efficient physically to try for the mental sciences at all. No mental sciences, no insight into my mind or their own—and that means no translation. But—damn it—I wish I were home already. I'm bored absolutely stiff! THE"}, {"chunk_id": "beb60ac6e67048dc9cb458afe7c16166__chunk_009", "distance": "0.70554489", "text": "to the smallest problems of everyday living was a little hard to get the hang of, Korvin told himself bitterly. He thought for a second. \"Why did you come to me?\" he said at last. Didyak beamed at him. The sight was remarkably unpleasant, involving as it did the disclosure of the Tr'en fifty-eight teeth, mostly pointed. Korvin stared back impassively. \"I have been ordered to come to you,\" Didyak said, \"by the Ruler. The Ruler wishes to talk with you.\" It wasn't quite \"talk\"; that was a general word in the Tr'en language, and Didyak had used a specific meaning, roughly: \"gain information"}, {"chunk_id": "beb60ac6e67048dc9cb458afe7c16166__chunk_041", "distance": "0.71634144", "text": "d to the physical and mathematical. Any insight at all into the mental sciences would have given them the key to his existence, and his entire plan, within seconds. But, then, it was lack of that insight that had called for this particular plan. That, and the political structure of the Tr'en. The same lack of insight let the Tr'en subconscious work on his escape without any annoying distractions in the way of deep reflection. Someone left a door unlocked and a weapon nearby—all quite intent, Korvin was sure. Getting to the ship was a little more complicated, but presented no new problems; he"}]}
{"qid": "beb60ac6e67048dc9cb458afe7c16166_q4", "doc_id": "beb60ac6e67048dc9cb458afe7c16166", "question": "Who is Didyak and what is his role in the story?", "chunks": [{"chunk_id": "beb60ac6e67048dc9cb458afe7c16166__chunk_009", "distance": "0.61148775", "text": "to the smallest problems of everyday living was a little hard to get the hang of, Korvin told himself bitterly. He thought for a second. \"Why did you come to me?\" he said at last. Didyak beamed at him. The sight was remarkably unpleasant, involving as it did the disclosure of the Tr'en fifty-eight teeth, mostly pointed. Korvin stared back impassively. \"I have been ordered to come to you,\" Didyak said, \"by the Ruler. The Ruler wishes to talk with you.\" It wasn't quite \"talk\"; that was a general word in the Tr'en language, and Didyak had used a specific meaning, roughly: \"gain information"}, {"chunk_id": "beb60ac6e67048dc9cb458afe7c16166__chunk_008", "distance": "0.64193857", "text": "struction of its kind Korvin had ever come across. It reminded him of some of the mathematical metalanguages he'd dealt with back on Earth, in training; but it was more closely and carefully constructed than even those marvels. \"I want nothing with you,\" Didyak said, leaning against the door-frame. \"You have other questions?\" Korvin sighed. \"What are you doing here, then?\" he asked. As conversation, it wasn't very choice; but it was, he admitted, better than solitude. \"I am leaning against the door,\" Didyak said. The Tr'en literalist approach to the smallest problems of everyday living was a"}, {"chunk_id": "beb60ac6e67048dc9cb458afe7c16166__chunk_006", "distance": "0.66424602", "text": "heories, but none that accounted for all the facts satisfactorily. Korvin really didn't care about it; it was none of his business. The Tr'en regarded him narrowly through catlike pupils. \"You are Korvin,\" he said. It was a ritual, Korvin had learned. \"You are of the Tr'en,\" he replied. The green being nodded. \"I am Didyak of the Tr'en,\" he said. Amenities over with, he relaxed slightly—but no more than slightly—and came into the cell, closing the door behind him. Korvin thought of jumping the Tr'en, but decided quickly against it. He was a captive, and it was unwise to assume that his"}, {"chunk_id": "beb60ac6e67048dc9cb458afe7c16166__chunk_010", "distance": "0.69386733", "text": "sed a specific meaning, roughly: \"gain information from, by peaceful and vocal means.\" Korvin filed it away for future reference. \"Why did the Ruler not come to me?\" Korvin asked. \"The Ruler is the Ruler,\" Didyak said, slightly discomfited. \"You are to go to him. Such is his command.\" Korvin shrugged, sighed and smoothed back his hair. \"I obey the command of the Ruler,\" he said—another ritual. Everybody obeyed the command of the Ruler. If you didn't, you never had a second chance to try. But Korvin meant exactly what he'd said. He was going to obey the commands of the Ruler of the Tr'en—and"}]}
{"qid": "beb60ac6e67048dc9cb458afe7c16166_q5", "doc_id": "beb60ac6e67048dc9cb458afe7c16166", "question": "Describe the setting of the story.", "chunks": [{"chunk_id": "beb60ac6e67048dc9cb458afe7c16166__chunk_026", "distance": "0.74079978", "text": "you tell the truth,\" the experts said at last, in a awed tone. \"Thus, you must be a traitor to your native planet. You must want us to conquer your planet, and have come here secretly to aid us.\" Korvin was very glad that wasn't a question. It was, after all, the only logical deduction. But it happened to be wrong. \"The name of your planet is Earth?\" the Ruler asked. A few minutes had passed; the experts were clustered around the single chair. Korvin was still strapped to the machine; a logical race makes use of a traitor, but a logical race does not trust him. \"Sometimes,\" Korvin said. \"It"}, {"chunk_id": "beb60ac6e67048dc9cb458afe7c16166__chunk_016", "distance": "0.74793231", "text": "and saw it coming through the door, pushed by two technicians. It was large and squat and metallic, and it had wheels, dials, blinking lights, tubes and wires, and a seat with armrests and straps. It was obviously a form of lie-detector—and Korvin felt himself marveling again at this race. Earth science had nothing to match their enormous command of the physical universe; adapting a hypnopædic language-course to an alien being so quickly had been wonder enough, but adapting the perilously delicate mechanisms that necessarily made up any lie-detector machinery was almost a miracle. The Tr'en,"}, {"chunk_id": "beb60ac6e67048dc9cb458afe7c16166__chunk_001", "distance": "0.75168061", "text": "y. They were well into the atomic era, and were on the verge of developing space travel. Before long they'd be settling the other planets of their system, and then the nearer stars. Faster-than-light travel couldn't be far away, for the magnificently efficient physical scientists of the Tr'en—and that would mean, in the ordinary course of events, an invitation to join the Comity of Planets. An invitation, the Comity was sure, which the Tr'en would not accept. Korvin stretched out on the cell's single bunk, a rigid affair which was hardly meant for comfort, and sighed. He'd had three days of"}, {"chunk_id": "beb60ac6e67048dc9cb458afe7c16166__chunk_044", "distance": "0.75903141", "text": "were home already. I'm bored absolutely stiff! THE END"}]}
{"qid": "42ccd388477c4aabbd8cde73b58e97d8_q2", "doc_id": "42ccd388477c4aabbd8cde73b58e97d8", "question": "What is the attitude of Dennis towards Marla?", "chunks": [{"chunk_id": "42ccd388477c4aabbd8cde73b58e97d8__chunk_016", "distance": "0.53195435", "text": ", the spacer itself—seem to have vanished.\" Dennis Brooke's space-tanned features had gone pale. His large hazel eyes, fringed with auburn lashes, too long for a man, were bright slits that smouldered. He stood silent, his hands clenched at his sides, while something cold and sharp seemed to dig at his heart with cruel precision. \"Marla!\" He breathed at last. The thought of Marla in the power of Koerber sent a wave of anguish that seared through him like an atom-blast. \"Commander,\" Dennis said, and his rich baritone voice had depths of emotion so great that they startled Commander Bertram"}, {"chunk_id": "42ccd388477c4aabbd8cde73b58e97d8__chunk_029", "distance": "0.56602407", "text": "reat resolve to deal with Koerber once and for all remained to him. Dennis tried not to think of Marla, too great an ache was involved in thinking of her and all he had lost. When he finally spoke, his voice was harsh, laconic: \"Prepare to return!\" Scotty Byrnes, the cruiser's nurse, who could take his motors through a major battle, or hell and high water and back again, for that matter, shifted the Venusian weed that made a perpetual bulge on his cheek and gazed curiously at Captain Brooke. They all knew the story in various versions, and with special additions. But they were spacemen,"}, {"chunk_id": "42ccd388477c4aabbd8cde73b58e97d8__chunk_006", "distance": "0.56684053", "text": "did so, his brilliant hazel eyes found themselves gazing into the unwinking, violet stare of a young Martian at the next table. There was a smouldering hatred in those eyes, and something else ... envy, perhaps, or was it jealousy? Dennis couldn't tell. But his senses became instantly alert. Danger brought a faint vibration which his superbly trained faculties could instantly denote. His steady, bronzed hand lowered the drink, and his eyes narrowed slightly. Absorbed in trying to puzzle the sudden enmity of this Martian stranger, he was unaware of the Mercurian Dancer. The latter had edged"}, {"chunk_id": "42ccd388477c4aabbd8cde73b58e97d8__chunk_015", "distance": "0.56708527", "text": "wned again as if what he had to say were difficult indeed. \"Marla Starland, your fiancee, accepted an assignment we offered her—a delicate piece of work here on Terra that only a very beautiful, and very clever young lady could perform. And,\" he paused, grimacing, \"somewhere between Venus and Terra, the interplanetary spacer bringing her and several other passengers, began to send distress signals. Finally, we couldn't contact the ship any more. It is three days overdue. All passengers, a cargo of radium from Venus worth untold millions, the spacer itself—seem to have vanished.\" Dennis"}]}
{"qid": "42ccd388477c4aabbd8cde73b58e97d8_q3", "doc_id": "42ccd388477c4aabbd8cde73b58e97d8", "question": "What is the importance of the Martian man attacking Dennis?", "chunks": [{"chunk_id": "42ccd388477c4aabbd8cde73b58e97d8__chunk_009", "distance": "0.38645846", "text": "nd as the Martian half-doubled over, he lefted him with a short jab to the chin that staggered and all but dropped him. The Martian's violet eyes were black with fury now. He staggered back and sucked in air, his face contorted with excruciating pain. But he was not through. His powerful right shot like a blast straight for Dennis' chest, striking like a piston just below the heart. Dennis took it, flat-footed, without flinching; then he let his right ride over with all the force at his command. It caught the Martian on the jaw and spun him like a top, the pale, imperious face went crimson as"}, {"chunk_id": "42ccd388477c4aabbd8cde73b58e97d8__chunk_008", "distance": "0.43500865", "text": "peed of an Hellacorium, the table went crashing to one side as he leaped with deadly intent on the sprawled figure of Dennis Brooke. A high-pitched scream brought instant silence as a Terran girl cried out. Then the Martian's hand reached out hungrily. But Dennis was not there. Leaping to one side, impervious to the fall of the dancer, he avoided the murderous rush of the Martian youth, then he wheeled swiftly and planted a sledge-hammer blow in that most vulnerable spot of all Martians, the spot just below their narrow, wasp-like waist, and as the Martian half-doubled over, he lefted him"}, {"chunk_id": "42ccd388477c4aabbd8cde73b58e97d8__chunk_006", "distance": "0.45460081", "text": "did so, his brilliant hazel eyes found themselves gazing into the unwinking, violet stare of a young Martian at the next table. There was a smouldering hatred in those eyes, and something else ... envy, perhaps, or was it jealousy? Dennis couldn't tell. But his senses became instantly alert. Danger brought a faint vibration which his superbly trained faculties could instantly denote. His steady, bronzed hand lowered the drink, and his eyes narrowed slightly. Absorbed in trying to puzzle the sudden enmity of this Martian stranger, he was unaware of the Mercurian Dancer. The latter had edged"}, {"chunk_id": "42ccd388477c4aabbd8cde73b58e97d8__chunk_013", "distance": "0.49349993", "text": "hed shortly as he became conscious of the venomous stare of the Mercurian Dancer, of the excited voices of the guests and the emphatic disapproval of the Venusian proprietor who was shocked at having a brawl in his ultra-expensive, ultra-exclusive Palace. \"Better come to Headquarters with me, Dennis,\" the lieutenant said gently. \"We'll say you captured him, and if he's Koerber's, the credit's yours. A trip to Terra's what you need, Venus for you is a hoodoo!\" The stern, white haired I.S.P. Commander behind the immense Aluminil desk, frowned slightly as Dennis Brooke entered. He eyed the six"}]}
{"qid": "42ccd388477c4aabbd8cde73b58e97d8_q4", "doc_id": "42ccd388477c4aabbd8cde73b58e97d8", "question": "What does Dennis do for living and how is he treated at work?", "chunks": [{"chunk_id": "42ccd388477c4aabbd8cde73b58e97d8__chunk_014", "distance": "0.54409182", "text": "slightly as Dennis Brooke entered. He eyed the six foot four frame of the Captain before him with a mixture of feelings, as if uncertain how to begin. Finally, he sighed as if, having come to a decision, he were forcing himself to speak: \"Sit down, Dennis. I've sent for you, despite your grounding, for two reasons. The first one you already know—your capture of one of Koerber's henchmen—has given us a line as to his present orbit of piracy, and the means of a check on his activities. But that's not really why I've brought you here.\" He frowned again as if what he had to say were difficult"}, {"chunk_id": "42ccd388477c4aabbd8cde73b58e97d8__chunk_013", "distance": "0.55540681", "text": "hed shortly as he became conscious of the venomous stare of the Mercurian Dancer, of the excited voices of the guests and the emphatic disapproval of the Venusian proprietor who was shocked at having a brawl in his ultra-expensive, ultra-exclusive Palace. \"Better come to Headquarters with me, Dennis,\" the lieutenant said gently. \"We'll say you captured him, and if he's Koerber's, the credit's yours. A trip to Terra's what you need, Venus for you is a hoodoo!\" The stern, white haired I.S.P. Commander behind the immense Aluminil desk, frowned slightly as Dennis Brooke entered. He eyed the six"}, {"chunk_id": "42ccd388477c4aabbd8cde73b58e97d8__chunk_011", "distance": "0.62061191", "text": "to be a piece of fool's luck, Brooke!\" The Police Lieutenant favored Dennis with a wry smile. \"If I'm not mistaken this chap's a member of Bren Koerber's pirate crew. Who else could afford to risk his neck at the International, and have in his possession a disintegrator? Pity we have no complete records on that devil's crew! Anyway, we'll radio the I.S.P., perhaps they have details on this dandy!\" He eyed admiringly the priceless Martian embroideries on the unconscious Martian's tunic, the costly border of red, ocelandian fur, and the magnificent black acerine on his finger. Dennis Brooke"}, {"chunk_id": "42ccd388477c4aabbd8cde73b58e97d8__chunk_050", "distance": "0.63440573", "text": "e several folds of flesh under his chin shook like gelatin. \"Cowards are hell!\" He spat. \"Easy, Dallas, Randall's a kid, give 'im a chance.\" Dennis observed. \"You Captain ... you're defending 'im? Why you had a greater stake in this than we, and he's spoiled it for you!\" \"Yep,\" Dennis nodded. \"But I'm still keeping my senses clear. No feuds on my ship. Get it!\" The last two words cut like a scimitar. Dallas nodded and lowered his eyes. Scotty shifted his cud and spat a thin stream of juice over the iridescent ground. One by one they re-entered the cruiser."}]}
{"qid": "42ccd388477c4aabbd8cde73b58e97d8_q5", "doc_id": "42ccd388477c4aabbd8cde73b58e97d8", "question": "Where does the story take place?", "chunks": [{"chunk_id": "42ccd388477c4aabbd8cde73b58e97d8__chunk_047", "distance": "0.77705526", "text": "book, and then we'll decide on a party to explore the terrain and try to find out what happened to Koerber's ship. I must know,\" he said in a low voice, but with such passion that the others were startled. A figure appeared in the slanting doorway of the ship in time to hear the last words. It was George Randall, adjusting a bandaged forehead bumped during the crash landing. \"Captain ... I ... I wanted ...\" he paused unable to continue. \"You wanted what?\" Captain Brooke's voice was terse. \"Perhaps you wanted to explain why you weren't at your battle station?\" \"Sir, I wanted to know if ... if"}, {"chunk_id": "42ccd388477c4aabbd8cde73b58e97d8__chunk_031", "distance": "0.77924156", "text": "ce, as if the tragedy that had occurred aboard the wrecked liner, had touched them intimately. Aboard the I.S.P. Cruiser, a surprise awaited them. It was young George Randall, whose excited face met them as soon as they had entered the airlocks and removed the space suits. \"Captain Brooke ... Captain, recordings are showing on the new 'Jet Analyzers' must be the trail of some spacer. Can't be far!\" He was fairly dancing in his excitement, as if the marvelous work of the new invention that detected the disturbance of atomic jets at great distance were his own achievement. Dennis Brooke smiled."}, {"chunk_id": "42ccd388477c4aabbd8cde73b58e97d8__chunk_045", "distance": "0.78498977", "text": "g, ragged line of cliffs. \"I think we got Koerber, though,\" he said at last. \"While Tom was doing a job of navigation, I had one last glimpse of him coming down fast and out of control somewhere behind those crags over there!\" \"To hell with Koerber!\" Tom Jeffery exploded. \"You mean we're stuck in this hellish rock-pile?\" \"Easy, Tom!\" Captain Brooke's tones were like ice. On his pale, impassive face, his eyes were like flaming topaz. \"Where's Randall?\" \"Probably hiding his head under a bunk!\" Dallas laughed with scorn. His contemptuous remark voiced the feelings of the entire crew. A man who"}, {"chunk_id": "42ccd388477c4aabbd8cde73b58e97d8__chunk_026", "distance": "0.79043663", "text": "trol room: \"Prepare to board!\" Every member of the crew wanted to be among the boarding party, for all but George Randall, the junior member of the crew had served his apprenticeship among the inner planets, Mars, Venus and Terra. He felt nauseated at the very thought of going out there in that vast abyss of space. His young, beardless face, with the candid blue eyes went pale when the order was given. But presently, Captain Brooke named those who were to go beside himself: \"You, Tom and Scotty, take one emergency plane, and Dallas!\" \"Yes, Captain!\" Dallas Bernan, the immense third lieutenant"}]}
{"qid": "ca0040cc3bc740f39e51994855bd284d_q2", "doc_id": "ca0040cc3bc740f39e51994855bd284d", "question": "What is the relationship between the Jaqs and the Terrestrials throughout the story?", "chunks": [{"chunk_id": "ca0040cc3bc740f39e51994855bd284d__chunk_002", "distance": "0.56352448", "text": "lous experience.\" He turned to the wall-screen and pressed a button. A system triagram appeared: eight luminous green dots arranged around a larger disk representing the primary. He picked up a pointer, indicating the innermost planet. \"The situation on Adobe is nearing crisis. The confounded settlers—a mere handful of them—have managed, as usual, to stir up trouble with an intelligent indigenous life form, the Jaq. I can't think why they bother, merely for a few oases among the endless deserts. However I have, at last, received authorization from Sector Headquarters to take certain action.\""}, {"chunk_id": "ca0040cc3bc740f39e51994855bd284d__chunk_014", "distance": "0.60777336", "text": "s a Terrestrial. Who are you? What you doin' here? We're pretty close to the edge of the oases. That's Flap-jack country over there.\" He waved a hand toward the north, where the desert lay. \"I'm glad you're a poor shot. That missile was too close for comfort.\" \"Missile, eh? Must be Flap-jack artillery. We got nothing like that.\" \"I heard there was a full-fledged war brewing,\" said Retief. \"I didn't expect—\" \"Good!\" Potter said. \"We figured a few of you boys from Ivory would be joining up when you heard. You are from Ivory?\" \"Yes. I'm—\" \"Hey, you must be Lemuel's cousin. Good night! I pretty"}, {"chunk_id": "ca0040cc3bc740f39e51994855bd284d__chunk_030", "distance": "0.65642154", "text": "He got to his feet. The captive Flap-jack rippled its fringe in an agitated way. Retief tensed his thumb in the eye-socket. \"Sit tight,\" he said. \"Don't try to do anything hasty....\" His remarks were falling on deaf ears—or no ears at all—but the thumb spoke as loudly as words. There was a slither of sand. Another. He became aware of a ring of presences drawing closer. Retief tightened his grip on the alien. He could see a dark shape now, looming up almost to his own six-three. It looked like the Flap-jacks came in all sizes. A low rumble sounded, like a deep-throated growl. It strummed on,"}, {"chunk_id": "ca0040cc3bc740f39e51994855bd284d__chunk_054", "distance": "0.65776360", "text": "tief handed over a sqat jug. Swazey drew the cork, sniffed, drank and passed it to Lemuel. \"Mister, where'd you get that?\" \"The Flap-jacks make it. Here's another question for you: Would you concede a share in this planet to the Flap-jacks in return for a peace guarantee?\" At the end of a half hour of heated debate Lemuel turned to Retief. \"We'll make any reasonable deal,\" he said. \"I guess they got as much right here as we have. I think we'd agree to a fifty-fifty split. That'd give about a hundred and fifty oases to each side.\" \"What would you say to keeping all the oases and giving them"}]}
{"qid": "ca0040cc3bc740f39e51994855bd284d_q3", "doc_id": "ca0040cc3bc740f39e51994855bd284d", "question": "Where does the story take place?", "chunks": [{"chunk_id": "ca0040cc3bc740f39e51994855bd284d__chunk_014", "distance": "0.75847733", "text": "s a Terrestrial. Who are you? What you doin' here? We're pretty close to the edge of the oases. That's Flap-jack country over there.\" He waved a hand toward the north, where the desert lay. \"I'm glad you're a poor shot. That missile was too close for comfort.\" \"Missile, eh? Must be Flap-jack artillery. We got nothing like that.\" \"I heard there was a full-fledged war brewing,\" said Retief. \"I didn't expect—\" \"Good!\" Potter said. \"We figured a few of you boys from Ivory would be joining up when you heard. You are from Ivory?\" \"Yes. I'm—\" \"Hey, you must be Lemuel's cousin. Good night! I pretty"}, {"chunk_id": "ca0040cc3bc740f39e51994855bd284d__chunk_002", "distance": "0.76761127", "text": "lous experience.\" He turned to the wall-screen and pressed a button. A system triagram appeared: eight luminous green dots arranged around a larger disk representing the primary. He picked up a pointer, indicating the innermost planet. \"The situation on Adobe is nearing crisis. The confounded settlers—a mere handful of them—have managed, as usual, to stir up trouble with an intelligent indigenous life form, the Jaq. I can't think why they bother, merely for a few oases among the endless deserts. However I have, at last, received authorization from Sector Headquarters to take certain action.\""}, {"chunk_id": "ca0040cc3bc740f39e51994855bd284d__chunk_015", "distance": "0.77410269", "text": "you must be Lemuel's cousin. Good night! I pretty near made a bad mistake. Lemuel's a tough man to explain something to.\" \"I'm—\" \"Keep your head down. These damn Flap-jacks have got some wicked hand weapons. Come on....\" He moved off silently on all fours. Retief followed. They crossed two hundred yards of rough country before Potter got to his feet, took out a soggy bandana and mopped his face. \"You move good for a city man. I thought you folks on Ivory just sat under those domes and read dials. But I guess bein' Lemuel's cousin you was raised different.\" \"As a matter of fact—\" \"Have to get"}, {"chunk_id": "ca0040cc3bc740f39e51994855bd284d__chunk_001", "distance": "0.78171402", "text": "one of those charming resort worlds, with only an occasional visa problem, or perhaps a distressed spaceman or two a year. Instead, I'm zoo-keeper to these confounded settlers. And not for one world, mind you, but eight!\" He stared glumly at Vice-Consul Retief. \"Still,\" Retief said, \"it gives an opportunity to travel—\" \"Travel!\" the consul barked. \"I hate travel. Here in this backwater system particularly—\" He paused, blinked at Retief and cleared his throat. \"Not that a bit of travel isn't an excellent thing for a junior officer. Marvelous experience.\" He turned to the wall-screen and"}]}
{"qid": "ca0040cc3bc740f39e51994855bd284d_q4", "doc_id": "ca0040cc3bc740f39e51994855bd284d", "question": "What is the significance of wine in the story?", "chunks": [{"chunk_id": "ca0040cc3bc740f39e51994855bd284d__chunk_053", "distance": "0.63201517", "text": "aw-boned hand. \"Sorry I jumped you, stranger. Tell you the truth, I thought you was some kind of stool-pigeon from the CDT.\" Bert came up behind Lemuel. \"How do you know he ain't, Lemuel?\" he said. \"Maybe he—\" Lemuel floored Bert with a backward sweep of his arm. \"Next cotton-picker says some embassy Johnny can cool me gets worse'n that.\" \"Tell me,\" said Retief. \"How are you boys fixed for wine?\" \"Wine? Mister, we been livin' on stump water for a year now. 'Dobe's fatal to the kind of bacteria it takes to ferment likker.\" \"Try this.\" Retief handed over a sqat jug. Swazey drew the cork,"}, {"chunk_id": "ca0040cc3bc740f39e51994855bd284d__chunk_035", "distance": "0.67318416", "text": "oom, communed silently with Hoshick. \"Pray forgive our lack of translating devices,\" he said to Retief. \"Permit me to introduce my colleagues....\" A small Flap-jack rippled the chamber bearing on its back a silver tray laden with aromatic food. The waiter served the four diners, filled the drinking tubes with yellow wine. It smelled good. \"I trust you'll find these dishes palatable,\" said Hoshick. \"Our metabolisms are much alike, I believe.\" Retief tried the food. It had a delicious nut-like flavor. The wine was indistinguishable from Chateau d'Yquem. \"It was an unexpected pleasure to"}, {"chunk_id": "ca0040cc3bc740f39e51994855bd284d__chunk_051", "distance": "0.70178807", "text": "mentioned tilling the sand, raising lichens—things like that—\" \"That on which we dined but now,\" said Hoshick, \"and from which the wine is made.\" \"The big news in fashionable diplomacy today is farming competition. Now, if you'd like to take these deserts and raise lichen, we'll promise to stick to the oases and vegetables.\" Hoshick curled his back in attention. \"Retief, you're quite serious? You would leave all the fair sand hills to us?\" \"The whole works, Hoshick. I'll take the oases.\" Hoshick rippled his fringes ecstatically. \"Once again you have outdone me, Retief,\" he cried. \"This time,"}, {"chunk_id": "ca0040cc3bc740f39e51994855bd284d__chunk_036", "distance": "0.71041906", "text": "Chateau d'Yquem. \"It was an unexpected pleasure to encounter your party here,\" said Hoshick. \"I confess at first we took you for an indigenous earth-grubbing form, but we were soon disabused of that notion.\" He raised a tube, manipulating it deftly with his fringe tentacles. Retief returned the salute and drank. \"Of course,\" Hoshick continued, \"as soon as we realized that you were sportsmen like ourselves, we attempted to make amends by providing a bit of activity for you. We've ordered out our heavier equipment and a few trained skirmishers and soon we'll be able to give you an adequate"}]}
{"qid": "ca0040cc3bc740f39e51994855bd284d_q5", "doc_id": "ca0040cc3bc740f39e51994855bd284d", "question": "What is the significance of the fission weapon in the story?", "chunks": [{"chunk_id": "ca0040cc3bc740f39e51994855bd284d__chunk_038", "distance": "0.64995116", "text": "se, but a fantastically keen tracker.\" \"Oh, by all means,\" Retief said. \"No atomics. As you pointed out, spawn-sorting is a nuisance, and then too, it's wasteful of troops.\" \"Ah, well, they are after all expendable. But we agree: no atomics. Have you tried the ground-gwack eggs? Rather a specialty of my Mosaic....\" \"Delicious,\" said Retief. \"I wonder. Have you considered eliminating weapons altogether?\" A scratchy sound issued from the disk. \"Pardon my laughter,\" Hoshick said, \"but surely you jest?\" \"As a matter of fact,\" said Retief, \"we ourselves seldom use weapons.\" \"I seem to recall that"}, {"chunk_id": "ca0040cc3bc740f39e51994855bd284d__chunk_009", "distance": "0.66224903", "text": "reen, moving out. Retief felt sweat pop out on his forehead. The red blip meant heavy radiation from a warhead. Somebody was playing around with an outlawed but by no means unheard of fission weapon. But maybe it was just on a high trajectory and had no connection with the skiff.... Retief altered course to the south. The blip followed. He checked instrument readings, gripped the controls, watching. This was going to be tricky. The missile bored closer. At five miles Retief threw the light skiff into maximum acceleration, straight toward the oncoming bomb. Crushed back in the padded seat, he"}, {"chunk_id": "ca0040cc3bc740f39e51994855bd284d__chunk_010", "distance": "0.69186568", "text": "oncoming bomb. Crushed back in the padded seat, he watched the screen, correcting course minutely. The proximity fuse should be set for no more than 1000 yards. At a combined speed of two miles per second, the skiff flashed past the missile, and Retief was slammed violently against the restraining harness in the concussion of the explosion ... a mile astern, and harmless. Then the planetary surface was rushing up with frightening speed. Retief shook his head, kicked in the emergency retro-drive. Points of light arced up from the planet face below. If they were ordinary chemical warheads the"}, {"chunk_id": "ca0040cc3bc740f39e51994855bd284d__chunk_011", "distance": "0.70351857", "text": "below. If they were ordinary chemical warheads the skiff's meteor screens should handle them. The screen flashed brilliant white, then went dark. The skiff flipped on its back. Smoke filled the tiny compartment. There was a series of shocks, a final bone-shaking concussion, then stillness, broken by the ping of hot metal contracting. Coughing, Retief disengaged himself from the shock-webbing. He beat out sparks in his lap, groped underfoot for the hatch and wrenched it open. A wave of hot jungle air struck him. He lowered himself to a bed of shattered foliage, got to his feet ... and dropped"}]}
{"qid": "aaa46b420fa34763bbc75d3575ef5bed_q2", "doc_id": "aaa46b420fa34763bbc75d3575ef5bed", "question": "Describe the setting of the story.", "chunks": [{"chunk_id": "aaa46b420fa34763bbc75d3575ef5bed__chunk_000", "distance": "0.66794121", "text": "The Happy Castaway BY ROBERT E. McDOWELL Being space-wrecked and marooned is tough enough. But to face the horrors of such a planet as this was too much. Imagine Fawkes' terrible predicament; plenty of food—and twenty seven beautiful girls for companions. [Transcriber's Note: This etext was produced from Planet Stories Spring 1945. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.] Jonathan Fawkes opened his eyes. He was flat on his back, and a girl was bending over him. He detected a frightened expression on the girl's face. His pale"}, {"chunk_id": "aaa46b420fa34763bbc75d3575ef5bed__chunk_005", "distance": "0.66962856", "text": "k. A volcano. Otherwise there was no sign of life: just he and the strange yellow-headed girl alone in the center of that vast rolling prairie. \"I was going to explain,\" he heard her say. \"We think that we are on an asteroid.\" \"We?\" he looked back at her. \"Yes. There are twenty-seven of us. We were on our way to Jupiter, too, only we were going to be wives for the colonists.\" \"I remember,\" he exclaimed. \"Didn't the Jupiter Food-growers Association enlist you girls to go to the colonies?\" She nodded her head. \"Only twenty-seven of us came through the crash.\" \"Everybody thought your space ship"}, {"chunk_id": "aaa46b420fa34763bbc75d3575ef5bed__chunk_022", "distance": "0.67242754", "text": "ut the massive pile of a space liner. They started down a winding path. The space liner disappeared behind a promontory of the mountain. Jonathan steeled himself for the coming ordeal. He would have sat down and refused to budge except that he knew the girls would hoist him on their shoulders and bear him into the camp like a bag of meal. The trail debouched into the valley. Just ahead the space liner reappeared. He imagined that it had crashed into the mountain, skidded and rolled down its side until it lodged beside the stream. It reminded him of a wounded dinosaur. Three girls were bathing"}, {"chunk_id": "aaa46b420fa34763bbc75d3575ef5bed__chunk_010", "distance": "0.67360431", "text": "w, was deepening into a respectable canyon, then a gorge. In half a mile, the walls towered above them. A narrow ribbon of sky was visible overhead. Yellow fern-like plants sprouted from the crevices and floor of the canyon. They flushed a small furry creature from behind a bush. As it sped away, it resembled a cottontail of Earth. The girl whipped back her arm, flung the spear. It transfixed the rodent. She picked it up, tied it to her waist. Jonathan gaped. Such strength and accuracy astounded him. He thought, amazons and centaurs. He thought, but this is the year 3372; not the time of"}]}
{"qid": "aaa46b420fa34763bbc75d3575ef5bed_q3", "doc_id": "aaa46b420fa34763bbc75d3575ef5bed", "question": "Who is Ann Clotilde, and what happens to her throughout the story?", "chunks": [{"chunk_id": "aaa46b420fa34763bbc75d3575ef5bed__chunk_037", "distance": "0.54258215", "text": "you could notice it,\" he grinned. \"Well!\" came the strident voice of Billy from behind them. \"We're all glad to hear that!\" Jonathan leaped to his feet, dumping Ann to the ground. He jerked around. All twenty-six of the girls were lined up on the path. Their features were grim. He said: \"I don't feel so well after all.\" \"It don't wash,\" said Billy. \"It's time for a showdown.\" Jonathan's hair stood on end. He felt rather than saw Ann Clotilde take her stand beside him. He noticed that she was holding her spear at a menacing angle. She said in an angry voice: \"He's mine. I found him. Leave him"}, {"chunk_id": "aaa46b420fa34763bbc75d3575ef5bed__chunk_014", "distance": "0.55561942", "text": "rapped around her sarong fashion. She bounced to a stop in front of Jonathan, her brown eyes wide in surprise. He thought her sarong had been a table cloth at one time in its history. \"A man!\" she breathed. \"By Jupiter and all its little moons, it's a man!\" \"Don't let him get away!\" cried Ann. \"Hilda!\" the brunette shrieked. \"A man! It's a man!\" A third girl skidded around the bend in the canyon. Jonathan backed off warily. Ann Clotilde cried in anguish: \"Don't let him get away!\" Jonathan chose the centaurs. He wheeled around, dashed back the way he had come. Someone tackled him. He rolled on"}, {"chunk_id": "aaa46b420fa34763bbc75d3575ef5bed__chunk_006", "distance": "0.60226721", "text": "ugh the crash.\" \"Everybody thought your space ship hit a meteor,\" he said. \"We hit this asteroid.\" \"But that was three years ago.\" \"Has it been that long? We lost track of time.\" She didn't take her eyes off him, not for a second. Such attention made him acutely self conscious. She said, \"I'm Ann. Ann Clotilde. I was hunting when I saw your space ship. You had been thrown clear. You were lying all in a heap. I thought you were dead.\" She stooped, picked up a spear. \"Do you feel strong enough to hike back to our camp? It's only about four miles,\" she said. \"I think so,\" he said. Jonathan"}, {"chunk_id": "aaa46b420fa34763bbc75d3575ef5bed__chunk_035", "distance": "0.61281633", "text": "e. Ann Clotilde placed the flat of her hand on his chest and shoved. \" Ooof! \" he grunted. He sat down rather more forcibly than he had risen. \"Don't get up because of me,\" she informed him. \"It's my turn to cook, but I saw you out here beneath the trees. Dinner can wait. Jonathan do you know that you are irresistible?\" She seized his shoulders, stared into his eyes. He couldn't have felt any more uncomfortable had a hungry boa constrictor draped itself in his arms. He mopped his brow with his sleeve. \"Suppose the rest should come,\" he said in an embarrassed voice. \"They're busy. They won't"}]}
{"qid": "aaa46b420fa34763bbc75d3575ef5bed_q4", "doc_id": "aaa46b420fa34763bbc75d3575ef5bed", "question": "What happened to the 27 women stuck on the asteroid?", "chunks": [{"chunk_id": "aaa46b420fa34763bbc75d3575ef5bed__chunk_005", "distance": "0.48114562", "text": "k. A volcano. Otherwise there was no sign of life: just he and the strange yellow-headed girl alone in the center of that vast rolling prairie. \"I was going to explain,\" he heard her say. \"We think that we are on an asteroid.\" \"We?\" he looked back at her. \"Yes. There are twenty-seven of us. We were on our way to Jupiter, too, only we were going to be wives for the colonists.\" \"I remember,\" he exclaimed. \"Didn't the Jupiter Food-growers Association enlist you girls to go to the colonies?\" She nodded her head. \"Only twenty-seven of us came through the crash.\" \"Everybody thought your space ship"}, {"chunk_id": "aaa46b420fa34763bbc75d3575ef5bed__chunk_007", "distance": "0.56268615", "text": "miles,\" she said. \"I think so,\" he said. Jonathan Fawkes fidgeted uncomfortably. He would rather pilot a space ship through a meteor field than face twenty-seven young women. They were the only thing in the Spaceways of which he was in awe. Then he realized that the girl's dark blue eyes had strayed beyond him. A frown of concentration marred her regular features. He turned around. On the rim of the prairie he saw a dozen black specks moving toward them. She said: \"Get down!\" Her voice was agitated. She flung herself on her stomach and began to crawl away from the wreck. Jonathan Fawkes"}, {"chunk_id": "aaa46b420fa34763bbc75d3575ef5bed__chunk_006", "distance": "0.57026350", "text": "ugh the crash.\" \"Everybody thought your space ship hit a meteor,\" he said. \"We hit this asteroid.\" \"But that was three years ago.\" \"Has it been that long? We lost track of time.\" She didn't take her eyes off him, not for a second. Such attention made him acutely self conscious. She said, \"I'm Ann. Ann Clotilde. I was hunting when I saw your space ship. You had been thrown clear. You were lying all in a heap. I thought you were dead.\" She stooped, picked up a spear. \"Do you feel strong enough to hike back to our camp? It's only about four miles,\" she said. \"I think so,\" he said. Jonathan"}, {"chunk_id": "aaa46b420fa34763bbc75d3575ef5bed__chunk_026", "distance": "0.57041234", "text": "a captive princess. All the confidence engendered by the familiar settings of the space ship went out of him like wind. He, Jonathan Fawkes, was a castaway on an asteroid inhabited by twenty-seven wild women. As the meal boisterously progressed, he regained sufficient courage to glance timidly around. Directly across the table sat a striking, grey-eyed girl whose brown hair was coiled severely about her head. She looked to him like a stenographer. He watched horrified as she seized a whole roast fowl, tore it apart with her fingers, gnawed a leg. She caught him staring at her and rolled her"}]}
{"qid": "aaa46b420fa34763bbc75d3575ef5bed_q5", "doc_id": "aaa46b420fa34763bbc75d3575ef5bed", "question": "What transformation does Jonathan Fawkes undergo throughout the story?", "chunks": [{"chunk_id": "aaa46b420fa34763bbc75d3575ef5bed__chunk_007", "distance": "0.51451147", "text": "miles,\" she said. \"I think so,\" he said. Jonathan Fawkes fidgeted uncomfortably. He would rather pilot a space ship through a meteor field than face twenty-seven young women. They were the only thing in the Spaceways of which he was in awe. Then he realized that the girl's dark blue eyes had strayed beyond him. A frown of concentration marred her regular features. He turned around. On the rim of the prairie he saw a dozen black specks moving toward them. She said: \"Get down!\" Her voice was agitated. She flung herself on her stomach and began to crawl away from the wreck. Jonathan Fawkes"}, {"chunk_id": "aaa46b420fa34763bbc75d3575ef5bed__chunk_017", "distance": "0.51492989", "text": "im, anyway, if he makes a break.\" Jonathan Fawkes' humiliation was complete. He meekly trudged between two husky females, who ogled him shamelessly. He was amazed at the ease with which they had carried him. He was six feet three and no light weight. He thought enviously of the centaurs, free to gallop across the plains. He wished he was a centaur. The trail left the canyon, struggled up the precipitate walls. Jonathan picked his way gingerly, hugged the rock. \"Don't be afraid,\" advised one of his captors. \"Just don't look down.\" \"I'm not afraid,\" said Jonathan hotly. To prove it he trod the"}, {"chunk_id": "aaa46b420fa34763bbc75d3575ef5bed__chunk_002", "distance": "0.51761734", "text": "\"My name's Jonathan Fawkes. I'm a space pilot with Universal. What happened? I feel like I'd been poured out of a concrete mixer.\" She pointed to the wreck of a small space freighter a dozen feet away. Its nose was buried in the turf, folded back like an accordion. It had burst open like a ripe watermelon. He was surprised that he had survived at all. He scratched his head. \"I was running from Mars to Jupiter with a load of seed for the colonists.\" \"Oh!\" said the girl, biting her lips. \"Your co-pilot must be in the wreckage.\" He shook his head. \"No,\" he reassured her. \"I left him on Mars. He"}, {"chunk_id": "aaa46b420fa34763bbc75d3575ef5bed__chunk_033", "distance": "0.52062881", "text": "nd Jonathan Fawkes hobbling around by the aid of a cane. At the portal of the space ship, he stuck out his head, glanced all around warily. None of the girls were in sight. They had, he presumed, gone about their chores: hunting, fishing, gathering fruits and berries. He emerged all the way and set out for the creek. He walked with an exaggerated limp just in case any of them should be hanging around. As long as he was an invalid he was safe, he hoped. He sighed. Not every man could be waited on so solicitously by twenty-seven handsome strapping amazons. He wished he could carry it off in"}]}
{"qid": "0a9bdf02a1a84fb2b7408aa57f1ef5fd_q2", "doc_id": "0a9bdf02a1a84fb2b7408aa57f1ef5fd", "question": "What happens to Wass through the story?", "chunks": [{"chunk_id": "0a9bdf02a1a84fb2b7408aa57f1ef5fd__chunk_030", "distance": "0.50679499", "text": "m theorize so wildly. Then Wass touched his elbow. \"Look there, Martin. Left of the ramp.\" Light from their torches was reflected, as from glass. \"All right,\" Rodney said belligerently into his radio. \"What's holding up the procession?\" Martin was silent. Wass undertook to explain. Why not, after all? Martin asked himself. It was in Wass' own interest. In a moment, all three were standing before a bank of glass cases which stretched off into the distance as far as the combined light of their torches would reach. \"Seeds!\" Wass exclaimed, his faceplate pressed against the glass. Martin blinked."}, {"chunk_id": "0a9bdf02a1a84fb2b7408aa57f1ef5fd__chunk_048", "distance": "0.53613997", "text": "o sink again to the knees, repeated the act, times without number. Then Wass broke his silence, taunting. \"The ship leaves in two hours, Martin. Two hours. Hear me, Rodney?\" Martin pulled his left foot from the sand and growled deep in his throat. Ahead, through the confusing patterns of the sparkling dust, his flashlight gleamed against metal. He grabbed Rodney's arm, pointed. A grate. Rodney stared. \"Wass!\" he shouted. \"We've found a way out!\" Their radios recorded Wass' laughter. \"I'm at the switchboard now, Martin. I—\" There was a tinkle of breaking glass, breaking faceplate. The grate"}, {"chunk_id": "0a9bdf02a1a84fb2b7408aa57f1ef5fd__chunk_031", "distance": "0.57252729", "text": "ceplate pressed against the glass. Martin blinked. He thought how little time they had. He wet his lips. Wass' gloved hands fumbled awkwardly at a catch in the nearest section of the bank. Martin thought of the dark, convoluted land outside the city. If they wouldn't grow there.... Or had they, once? \"Don't, Wass!\" Torchlight reflected from Wass' faceplate as he turned his head. \"Why not?\" They were like children.... \"We don't know, released, what they'll do.\" \"Skipper,\" Wass said carefully, \"if we don't get out of this place by the deadline we may be eating these.\" Martin raised his arm"}, {"chunk_id": "0a9bdf02a1a84fb2b7408aa57f1ef5fd__chunk_038", "distance": "0.57601249", "text": "hey had a war,\" Martin said. Wass agreed. \"And the survivors retired here. Why?\" Martin said, \"They wanted to rebuild. Or maybe this was already built before the war as a retreat.\" He turned impatiently. \"How should I know?\" Wass turned, too, persistent. \"But the planet was through with them.\" \"In a minute,\" Martin said, too irritably, \"we'll have a sentient planet.\" From the corner of his eye he saw Rodney start at that. \"Knock it off, Wass. We're looking for reservoirs, you know.\" They moved slowly down the metal avenue, between the twisted shadow shapes, looking carefully about them."}]}
{"qid": "0a9bdf02a1a84fb2b7408aa57f1ef5fd_q3", "doc_id": "0a9bdf02a1a84fb2b7408aa57f1ef5fd", "question": "Where does the story take place?", "chunks": [{"chunk_id": "0a9bdf02a1a84fb2b7408aa57f1ef5fd__chunk_002", "distance": "0.71091878", "text": "movement of hand and arm he indicated the waiting city. Martin led Wass, and the gangling, scarecrow-like Rodney, through the stillness overlaying the barren ground. There was only the twilight sky, and harsh and black against it, the convoluted earth. And the city. Malignant. He wondered, again, what beings would choose to build a city—even a city like this one—in such surroundings. The men from the ship knew only the surface facts about this waiting geometric discovery. Theirs was the eleventh inter-planetary flight, and the previous ten, in the time allowed them for exploration while this"}, {"chunk_id": "0a9bdf02a1a84fb2b7408aa57f1ef5fd__chunk_008", "distance": "0.72030628", "text": ", Rodney, they must have had illumination.\" Martin looked back along the straight, metal street they'd walked on, and past that out over the bleak, furrowed slopes where the ship's lifeboat lay ... and he thought everything outside the city seemed, somehow, from here, a little dim, a little hazy. He straightened his shoulders. The city was alien, of course, and that explained most of it ... most of it. But he felt the black city was something familiar, yet twisted and distorted. \"Well,\" Wass said, his nose wrinkling a bit, \"now that we're here....\" \"Pictures,\" Martin decided. \"We have twelve"}, {"chunk_id": "0a9bdf02a1a84fb2b7408aa57f1ef5fd__chunk_001", "distance": "0.72064835", "text": "nions sat and stared in awed silence at the city a quarter-mile away. He saw the dull, black walls of buildings shouldering grimly into the twilight sky, saw the sheared edge where the metal city ended and the barren earth began ... and he remembered observing, even before they landed, the too-strict geometry imposed on the entire construction. He frowned. The first impression was ... malignant. Wass, blond and slight, with enough nose for three or four men, unbuckled his safety belt and stood up. \"Shall we, gentlemen?\" and with a graceful movement of hand and arm he indicated the waiting"}, {"chunk_id": "0a9bdf02a1a84fb2b7408aa57f1ef5fd__chunk_009", "distance": "0.72387576", "text": "e....\" \"Pictures,\" Martin decided. \"We have twelve hours. We'll start here. What's the matter, Wass?\" The blond man grinned ruefully. \"I left the camera in the lifeboat.\" There was a pause. Then Wass, defensively—\"It's almost as if the city didn't want to be photographed.\" Martin ignored the remark. \"Go get it. Rodney and I will be somewhere along this street.\" Wass turned away. Martin and Rodney started slowly down the wide metal street, at right angles to their path of entrance. Again Martin felt a tug of twisted, distorted familiarity. It was almost as if ... they were human up to a"}]}
{"qid": "0a9bdf02a1a84fb2b7408aa57f1ef5fd_q4", "doc_id": "0a9bdf02a1a84fb2b7408aa57f1ef5fd", "question": "What is the relationship like between Rodney, Martin, and Wass?", "chunks": [{"chunk_id": "0a9bdf02a1a84fb2b7408aa57f1ef5fd__chunk_030", "distance": "0.43461961", "text": "m theorize so wildly. Then Wass touched his elbow. \"Look there, Martin. Left of the ramp.\" Light from their torches was reflected, as from glass. \"All right,\" Rodney said belligerently into his radio. \"What's holding up the procession?\" Martin was silent. Wass undertook to explain. Why not, after all? Martin asked himself. It was in Wass' own interest. In a moment, all three were standing before a bank of glass cases which stretched off into the distance as far as the combined light of their torches would reach. \"Seeds!\" Wass exclaimed, his faceplate pressed against the glass. Martin blinked."}, {"chunk_id": "0a9bdf02a1a84fb2b7408aa57f1ef5fd__chunk_012", "distance": "0.45762169", "text": "n!\" Wass' voice came through the receivers in both their radios. \"Martin, I can't get out!\" Rodney mumbled something, and Martin told him to shut up. Wass said, more quietly, \"Remember that metal band? It's all clear now, and glittering, as far as I can see. I can't get across it; it's like a glass wall.\" \"We're trapped, we're trapped, they are—\" \"Shut up, Rodney! Wass, I'm only two sections from the edge. I'll check here.\" Martin clapped a hand on Rodney's shoulder again, starting him moving, toward the city's edge, past the black, silent buildings. The glittering band was here, too, like a"}, {"chunk_id": "0a9bdf02a1a84fb2b7408aa57f1ef5fd__chunk_048", "distance": "0.47107673", "text": "o sink again to the knees, repeated the act, times without number. Then Wass broke his silence, taunting. \"The ship leaves in two hours, Martin. Two hours. Hear me, Rodney?\" Martin pulled his left foot from the sand and growled deep in his throat. Ahead, through the confusing patterns of the sparkling dust, his flashlight gleamed against metal. He grabbed Rodney's arm, pointed. A grate. Rodney stared. \"Wass!\" he shouted. \"We've found a way out!\" Their radios recorded Wass' laughter. \"I'm at the switchboard now, Martin. I—\" There was a tinkle of breaking glass, breaking faceplate. The grate"}, {"chunk_id": "0a9bdf02a1a84fb2b7408aa57f1ef5fd__chunk_035", "distance": "0.47729141", "text": "rtin was watching Rodney, struggling to get up. \"I agree. As a last resort. We still have a little time.\" Rodney's tall, spare figure looked bowed and tired in the torchlight, now that he was up again. \"Martin, I—\" Martin turned his back. \"Skip it, Rodney,\" he said gently. \"Water,\" Wass said thoughtfully. \"There must be reservoirs under this city somewhere.\" Rodney said, \"How does water help us get out?\" Martin glanced at Wass, then started out of the switchboard room, not looking back. \"It got in and out of the city some way. Perhaps we can leave the same way.\" Down the ramp again. \"There's"}]}
{"qid": "0a9bdf02a1a84fb2b7408aa57f1ef5fd_q5", "doc_id": "0a9bdf02a1a84fb2b7408aa57f1ef5fd", "question": "What was the key to their escape?", "chunks": [{"chunk_id": "0a9bdf02a1a84fb2b7408aa57f1ef5fd__chunk_031", "distance": "0.60988188", "text": "ceplate pressed against the glass. Martin blinked. He thought how little time they had. He wet his lips. Wass' gloved hands fumbled awkwardly at a catch in the nearest section of the bank. Martin thought of the dark, convoluted land outside the city. If they wouldn't grow there.... Or had they, once? \"Don't, Wass!\" Torchlight reflected from Wass' faceplate as he turned his head. \"Why not?\" They were like children.... \"We don't know, released, what they'll do.\" \"Skipper,\" Wass said carefully, \"if we don't get out of this place by the deadline we may be eating these.\" Martin raised his arm"}, {"chunk_id": "0a9bdf02a1a84fb2b7408aa57f1ef5fd__chunk_035", "distance": "0.61453468", "text": "rtin was watching Rodney, struggling to get up. \"I agree. As a last resort. We still have a little time.\" Rodney's tall, spare figure looked bowed and tired in the torchlight, now that he was up again. \"Martin, I—\" Martin turned his back. \"Skip it, Rodney,\" he said gently. \"Water,\" Wass said thoughtfully. \"There must be reservoirs under this city somewhere.\" Rodney said, \"How does water help us get out?\" Martin glanced at Wass, then started out of the switchboard room, not looking back. \"It got in and out of the city some way. Perhaps we can leave the same way.\" Down the ramp again. \"There's"}, {"chunk_id": "0a9bdf02a1a84fb2b7408aa57f1ef5fd__chunk_042", "distance": "0.61548752", "text": "y's sudden grip on Martin's wrist nearly shattered the bone. \"Martin! It's all alive! It's moving!\" Martin hesitated long enough for a coil to move sinuously up toward the opening. Then he spun the wheel and the hatch slammed down. He was shaking. After a time he said, \"Rodney, Wass, it's dust, down there. Remember the wind? Air currents are moving it.\" Rodney sat down on the metal flooring. For a long time he said nothing. Then—\"It wasn't.... Why did you close the hatch then?\" Martin did not say he thought the other two would have shot him, otherwise. He said merely, \"At first I wasn't sure"}, {"chunk_id": "0a9bdf02a1a84fb2b7408aa57f1ef5fd__chunk_040", "distance": "0.63235909", "text": "later expeditions to study. So will we if we don't find a way to get out.\" Their radios recorded Rodney's gasp. Then—\"Martin! Martin! I think I've found something!\" Martin began to run. After a moment's hesitation, Wass swung in behind him. \"Here,\" Rodney said, as they came up to him, out of breath. \"Here. See? Right here.\" Three flashlights centered on a dark, metal disk raised a foot or more from the floor. \"Well, they had hands.\" With his torch Wass indicated a small wheel of the same metal as everything else in the city, set beside the disk. From its design Martin assumed that the disk"}]}
{"qid": "a1f43a9489d9444f8b3f27efd935d5b3_q2", "doc_id": "a1f43a9489d9444f8b3f27efd935d5b3", "question": "Describe the setting of the story.", "chunks": [{"chunk_id": "a1f43a9489d9444f8b3f27efd935d5b3__chunk_008", "distance": "0.65436101", "text": "s a cheerful scene; Dan liked it. Still, it hardly seemed worth all the effort.... He went to the wall switch and turned off the lights. The orange glow of the filaments died, leaving only a faint illumination from the night-light over the door. When the thieves arrived, it might give him a momentary advantage if his eyes were adjusted to the dark. He groped his way to the bunk. So far, so good, he reflected, stretching out. When they showed up, he'd have to handle everything just right. If he scared them off there'd be no second chance. He would have lost his crack at—whatever his discovery"}, {"chunk_id": "a1f43a9489d9444f8b3f27efd935d5b3__chunk_024", "distance": "0.65717483", "text": "curtains, a four-poster under a flowered canopy, a dressing table— The door opened and the girl stepped into the room. She was young. Not over eighteen, Dan thought—as nearly as he could tell with the blue light playing around her face. She had long hair tied with a ribbon, and long legs, neatly curved. She wore shorts and carried a tennis racquet in her left hand and an apple in her right. Her back to Dan and the cage, she tossed the racquet on a table, took a bite of the apple, and began briskly unbuttoning her shirt. Dan tried moving a lever. The cage edged toward the girl. Another; he"}, {"chunk_id": "a1f43a9489d9444f8b3f27efd935d5b3__chunk_010", "distance": "0.66504192", "text": "ore brightly than the framework. A faint sound cut into the stillness—a descending whine. The cage moved jerkily, settling toward the floor. Long blue sparks jumped, crackling, to span the closing gap; with a grate of metal, the cage settled against the floor. The spectral men reached for ghostly switches.... The glow died. Dan was aware of his heart thumping painfully under his ribs. His mouth was dry. This was the moment he'd been planning for, but now that it was here— Never mind. He took a deep breath, ran over the speeches he had prepared for the occasion: Greeting, visitors from the"}, {"chunk_id": "a1f43a9489d9444f8b3f27efd935d5b3__chunk_043", "distance": "0.66514438", "text": "ut into a ghostly afternoon sky. Faint outlines of buildings, like faded negatives, spread below. Dan looked around, spotted lettering on a square five-story structure. \"Over there,\" he said. Blote directed the machine as it swooped smoothly toward the flat roof Dan indicated. \"Better let me take over now,\" Dan suggested. \"I want to be sure to get us to the right place.\" \"Very well, Dan.\" Dan dropped the carrier through the roof, passed down through a dimly seen office. Blote twiddled a small knob. The scene around the cage grew even fainter. \"Best we remain unnoticed,\" he explained. The cage"}]}
{"qid": "a1f43a9489d9444f8b3f27efd935d5b3_q3", "doc_id": "a1f43a9489d9444f8b3f27efd935d5b3", "question": "What is the relationship between Dan and Blote?", "chunks": [{"chunk_id": "a1f43a9489d9444f8b3f27efd935d5b3__chunk_040", "distance": "0.49350125", "text": "the desk, and rolled one eye, bugging the other at Dan. \"Whereas, on the other hand,\" Blote's bass voice went on, \"you and me got the basis of a sweet deal. You supply the machine, and I fix you up with an abundance of the local medium of exchange. Equitable enough, I should say. What about it, Dan?\" \"Ah, let me see,\" Dan temporized. \"Time machine. Time machine—\" \"Don't attempt to weasel on me, Dan,\" Blote rumbled ominously. \"I'd better look in the phone book,\" Dan suggested. Silently, Blote produced a dog-eared directory. Dan opened it. \"Time, time. Let's see....\" He brightened. \"Time,"}, {"chunk_id": "a1f43a9489d9444f8b3f27efd935d5b3__chunk_042", "distance": "0.56375468", "text": "w, off to gather in the time machine.\" He took his place in the carrier, patted the seat beside him with a wide hand. \"Come, Dan. Get a wiggle on.\" Hesitantly, Dan moved to the carrier. The bluff was all right up to a point—but the point had just about been reached. He took his seat. Blote moved a lever. The familiar blue glow sprang up. \"Kindly direct me, Dan,\" Blote demanded. \"Two twenty-one Maple Street, I believe you said.\" \"I don't know the town very well,\" Dan said, \"but Maple's over that way.\" Blote worked levers. The carrier shot out into a ghostly afternoon sky. Faint outlines of"}, {"chunk_id": "a1f43a9489d9444f8b3f27efd935d5b3__chunk_043", "distance": "0.60943991", "text": "ut into a ghostly afternoon sky. Faint outlines of buildings, like faded negatives, spread below. Dan looked around, spotted lettering on a square five-story structure. \"Over there,\" he said. Blote directed the machine as it swooped smoothly toward the flat roof Dan indicated. \"Better let me take over now,\" Dan suggested. \"I want to be sure to get us to the right place.\" \"Very well, Dan.\" Dan dropped the carrier through the roof, passed down through a dimly seen office. Blote twiddled a small knob. The scene around the cage grew even fainter. \"Best we remain unnoticed,\" he explained. The cage"}, {"chunk_id": "a1f43a9489d9444f8b3f27efd935d5b3__chunk_045", "distance": "0.61556792", "text": "hine veered left, flickered through a barred door, came to a halt. Two nebulous figures loomed beside the cage. Dan cut the switch. If he'd guessed wrong— The scene fluoresced, sparks crackling, then popped into sharp focus. Blote scrambled out, brown eyes swivelling to take in the concrete walls, the barred door and— \"You!\" a hoarse voice bellowed. \"Grab him!\" someone yelled. Blote recoiled, threshing his ambulatory members in a fruitless attempt to regain the carrier as Manny and Fiorello closed in. Dan hauled at a lever. He caught a last glimpse of three struggling, blue-lit figures as the"}]}
{"qid": "a1f43a9489d9444f8b3f27efd935d5b3_q4", "doc_id": "a1f43a9489d9444f8b3f27efd935d5b3", "question": "What happens to Dan throughout the story?", "chunks": [{"chunk_id": "a1f43a9489d9444f8b3f27efd935d5b3__chunk_019", "distance": "0.54524404", "text": "\"Manny!\" Fiorello released his grip on Dan, lunged to aid his companion. Kelly passed Manny to one of three cops crowding in on his heels. Dan clung to the framework as Fiorello grappled with Kelly. A cop pushed past them, spotted Dan, moved in briskly for the pinch. Dan grabbed a lever at random and pulled. Sudden silence fell as the walls of the room glowed blue. A spectral Kelly capered before the cage, fluorescing in the blue-violet. Dan swallowed hard and nudged a second lever. The cage sank like an elevator into the floor, vivid blue washing up its sides. Hastily he reversed the"}, {"chunk_id": "a1f43a9489d9444f8b3f27efd935d5b3__chunk_028", "distance": "0.55457491", "text": "o the floor of the cage, breathing hard. There was a loud click! and the glow faded. With a lunge, Dan scrambled out of the cage. He stood looking around at a simple brown-painted office, dimly lit by sunlight filtered through elaborate venetian blinds. There were posters on the wall, a potted plant by the door, a heap of framed paintings beside it, and at the far side of the room a desk. And behind the desk—Something. II Dan gaped at a head the size of a beachball, mounted on a torso like a hundred-gallon bag of water. Two large brown eyes blinked at him from points eight inches apart."}, {"chunk_id": "a1f43a9489d9444f8b3f27efd935d5b3__chunk_046", "distance": "0.56728154", "text": "impse of three struggling, blue-lit figures as the carrier shot away through the cell wall. III Dan slumped back against the seat with a sigh. Now that he was in the clear, he would have to decide on his next move—fast. There was no telling what other resources Blote might have. He would have to hide the carrier, then— A low growling was coming from somewhere, rising in pitch and volume. Dan sat up, alarmed. This was no time for a malfunction. The sound rose higher, into a penetrating wail. There was no sign of mechanical trouble. The carrier glided on, swooping now over a nebulous landscape"}, {"chunk_id": "a1f43a9489d9444f8b3f27efd935d5b3__chunk_026", "distance": "0.56935984", "text": "his face up— Dan jabbed at a lever. The cage shot back through the wall. He was in a plain room with a depression in the floor, a wide window with a planter filled with glowing blue plants— The door opened. Even blue, the girl looked graceful as a deer as she took a last bite of the apple and stepped into the ten-foot-square sunken tub. Dan held his breath. The girl tossed the apple core aside, seemed to suddenly become aware of eyes on her, whirled— With a sudden lurch that threw Dan against the steel bars, the cage shot through the wall into the open air and hurtled off with an"}]}
{"qid": "a1f43a9489d9444f8b3f27efd935d5b3_q5", "doc_id": "a1f43a9489d9444f8b3f27efd935d5b3", "question": "What equipment is used in the story?", "chunks": [{"chunk_id": "a1f43a9489d9444f8b3f27efd935d5b3__chunk_035", "distance": "0.64933193", "text": "g the significance of the term.\" \"That thing,\" Dan jabbed a thumb toward the cage. \"The machine I came here in. You want me—\" \"Time machine,\" the voice repeated. \"Some sort of chronometer, perhaps?\" \"Huh?\" \"I pride myself on my command of the local idiom, yet I confess the implied concept snows me.\" The nine-fingered hands folded on the desk. The beachball head leaned forward interestedly. \"Clue me, Dan. What's a time machine?\" \"Well, it's what you use to travel through time.\" The brown eyes blinked in agitated alternation. \"Apparently I've loused up my investigation of the local cultural"}, {"chunk_id": "a1f43a9489d9444f8b3f27efd935d5b3__chunk_036", "distance": "0.66297567", "text": "e loused up my investigation of the local cultural background. I had no idea you were capable of that sort of thing.\" The immense head leaned back, the wide mouth opening and closing rapidly. \"And to think I've been spinning my wheels collecting primitive 2-D art!\" \"But—don't you have a time machine? I mean, isn't that one?\" \"That? That's merely a carrier. Now tell me more about your time machines. A fascinating concept! My superiors will be delighted at this development—and astonished as well. They regard this planet as Endsville.\" \"Your superiors?\" Dan eyed the window; much too far to jump."}, {"chunk_id": "a1f43a9489d9444f8b3f27efd935d5b3__chunk_038", "distance": "0.66856968", "text": "elty items for the impulse-emporiums of the entire Secondary Quadrant.\" \"But the way Manny and Fiorello came sailing in through the wall! That has to be a time machine they were riding in. Nothing else could just materialize out of thin air like that.\" \"You seem to have a time-machine fixation, Dan,\" Blote said. \"You shouldn't assume, just because you people have developed time travel, that everyone has. Now—\" Blote's voice sank to a bass whisper—\"I'll make a deal with you, Dan. You'll secure a small time machine in good condition for me. And in return—\" \" I'm supposed to supply you with a"}, {"chunk_id": "a1f43a9489d9444f8b3f27efd935d5b3__chunk_044", "distance": "0.67702442", "text": "\"Best we remain unnoticed,\" he explained. The cage descended steadily. Dan peered out, searching for identifying landmarks. He leveled off at the second floor, cruised along a barely visible corridor. Blote's eyes rolled, studying the small chambers along both sides of the passage at once. \"Ah, this must be the assembly area,\" he exclaimed. \"I see the machines employ a bar-type construction, not unlike our carriers.\" \"That's right,\" Dan said, staring through the haziness. \"This is where they do time....\" He tugged at a lever suddenly; the machine veered left, flickered through a barred door,"}]}
